{
  "surahs": [
    {
      "id": 1,
      "name": "الفاتحة",
      "verses": [
        { "id": 1, "text": "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ", "tafsir": "أبدأ قراءتي مستعيناً بالله المعبود بحق، واسع الرحمة.", "irab": "الباء: حرف جر، اسم: اسم مجرور، الله: لفظ الجلالة مضاف إليه." },
        { "id": 2, "text": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ", "tafsir": "الثناء والحمد لله وحده، خالق كل شيء ومالكه ومدبره.", "irab": "الحمد: مبتدأ مرفوع، لله: جار ومجرور متعلقان بمحذوف خبر." },
        { "id": 3, "text": "الرَّحْمَنِ الرَّحِيمِ", "tafsir": "صاحب الرحمة الواسعة التي وسعت كل شيء.", "irab": "نعت للفظ الجلالة (الله) مجرور." },
        { "id": 4, "text": "مَالِكِ يَوْمِ الدِّينِ", "tafsir": "هو وحده سبحانه المتصرف في يوم الجزاء والحساب.", "irab": "مالك: نعت ثالث، يوم: مضاف إليه، الدين: مضاف إليه ثانٍ." },
        { "id": 5, "text": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ", "tafsir": "نخصك وحدك بالعبادة، ونطلب منك وحدك العون.", "irab": "إياك: ضمير منفصل مبني في محل نصب مفعول به مقدم." },
        { "id": 6, "text": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ", "tafsir": "وفقنا وأرشدنا وثبتنا على الطريق الموصل للجنة.", "irab": "اهدنا: فعل أمر (للدعاء)، نا: مفعول به، الصراط: مفعول به ثانٍ." },
        { "id": 7, "text": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ", "tafsir": "طريق الذين هديتهم من الأنبياء، لا طريق المغضوب عليهم ولا الضالين.", "irab": "صراط: بدل من الأول، الذين: اسم موصول مضاف إليه." }
      ]
    },
    {
      "id": 2,
      "name": "البقرة",
      "verses": [
        { "id": 1, "text": "الم", "tafsir": "حروف مقطعة للإعجاز الإلهي.", "irab": "حروف مبنية لا محل لها." },
        { "id": 2, "text": "ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ", "tafsir": "هذا القرآن حق لا شك فيه، يرشد المتقين.", "irab": "ذلك: مبتدأ، الكتاب: بدل." }
        { "id": 3, "text": "الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ", "tafsir": "المؤمنون بالخفاء والمقيمون للصلاة والمنفقون مما أعطاهم الله.", "irab": "الذين: نعت للمتقين، يؤمنون: فعل مضارع مرفوع." },
    { "id": 4, "text": "وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ", "tafsir": "المصدقون بالوحي السماوي كله وباليوم الآخر يقيناً.", "irab": "الذين: معطوف، هم: مبتدأ، يوقنون: خبر." },
    { "id": 5, "text": "أُولَٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ", "tafsir": "هؤلاء على نور من خالقهم وهم الفائزون بالنجاة.", "irab": "أولئك: مبتدأ، على هدى: خبر، المفلحون: خبر ثانٍ." },
    { "id": 6, "text": "إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ", "tafsir": "الجاحدون لا تنفعهم الموعظة لعنادهم وإصرارهم على الباطل.", "irab": "إن: حرف ناسخ، الذين: اسمها، لا يؤمنون: جملة حالية." },
    { "id": 7, "text": "خَتَمَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰ أَبْصَارِهِمْ غِشَاوَةٌ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ", "tafsir": "طبع الله على قلوبهم وحجب سمعهم وأبصارهم عن رؤية الحق.", "irab": "ختم: فعل، الله: فاعل، غشاوة: مبتدأ مؤخر." },
    { "id": 8, "text": "وَمِنَ النَّاسِ مَن يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ وَمَا هُم بِمُؤْمِنِينَ", "tafsir": "بداية ذكر المنافقين الذين يدعون الإيمان ظاهراً فقط.", "irab": "من الناس: خبر مقدم، من: مبتدأ مؤخر." },
    { "id": 9, "text": "يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلَّا أَنفُسَهُمْ وَمَا يَشْعُرُونَ", "tafsir": "يظنون أنهم يخدعون الله والمؤمنين والحقيقة أنهم يخدعون أنفسهم.", "irab": "يخادعون: فعل، الله: مفعول به، أنفسهم: مفعول به." },
    { "id": 10, "text": "فِي قُلُوبِهِم مَّرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ", "tafsir": "قلوبهم مريضة بالشك فزادهم الله ضلالاً ولهم عقاب أليم.", "irab": "في قلوبهم: خبر، مرض: مبتدأ، مرضاً: مفعول به ثانٍ." },
    { "id": 11, "text": "وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ", "tafsir": "إذا نُهوا عن الفساد ادعوا كذباً أنهم أهل الإصلاح.", "irab": "إذا: ظرفية، نحن: مبتدأ، مصلحون: خبر." },
    { "id": 12, "text": "أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ وَلَٰكِن لَّا يَشْعُرُونَ", "tafsir": "تأكيد من الله أنهم هم المفسدون الحقيقيون لخراب ضمائرهم.", "irab": "ألا: استفتاحية، إنهم: حرف ناسخ، المفسدون: خبر." },
    { "id": 13, "text": "وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاسُ قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاءُ", "tafsir": "يحتقرون المؤمنين ويصفونهم بالسفه تكبراً وتعالياً.", "irab": "أنؤمن: الهمزة للاستفهام، السفهاء: فاعل." },
    { "id": 14, "text": "وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَوْا إِلَىٰ شَيَاطِينِهِمْ قَالُوا إِنَّا مَعَكُمْ", "tafsir": "يتلونون حسب من يجالسون؛ إيمان أمام المسلمين وكفر مع رفقائهم.", "irab": "لقوا: فعل، الذين: مفعول به، إنا: إن واسمها." },
    { "id": 15, "text": "اللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ", "tafsir": "الله يجازيهم على استهزائهم بتركهم يتمادون في ضلالهم.", "irab": "الله: مبتدأ، يستهزئ: جملة الخبر، يعمهون: حال." },
    { "id": 16, "text": "أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ فَمَا رَبِحَت تِّجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ", "tafsir": "استبدلوا الكفر بالإيمان فخسروا صفقتهم في الدنيا والآخرة.", "irab": "أولئك: مبتدأ، الذين: خبر، الضلالة: مفعول به." },
    { "id": 17, "text": "مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ ذَهَبَ اللَّهُ بِنُورِهِمْ", "tafsir": "مثلهم كمن أضاء ناراً ثم انطفأت فبقي في الظلمة والحيرة.", "irab": "مثلهم: مبتدأ، كمثل: خبر، ناراً: مفعول به." },
    { "id": 18, "text": "صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ", "tafsir": "صم عن الحق، بكم عن النطق به، عمي عن رؤيته فلا عودة لهم.", "irab": "صم: خبر لمبتدأ محذوف تقديره (هم)." },
    { "id": 19, "text": "أَوْ كَصَيِّبٍ مِّنَ السَّمَاءِ فِيهِ ظُلُمَاتٌ وَرَعْدٌ وَبَرْقٌ", "tafsir": "مثل آخر للمنافقين في شدة حيرتهم وخوفهم من هيبة الوحي.", "irab": "أو: حرف عطف، كصيب: جار ومجرور." },
    { "id": 20, "text": "يَكَادُ الْبَرْقُ يَخْطَفُ أَبْصَارَهُمْ ۖ كُلَّمَا أَضَاءَ لَهُم مَّشَوْا فِيهِ", "tafsir": "يتحركون عند مصلحتهم ويتوقفون عند الشدائد.", "irab": "يكاد: فعل مقاربة، البرق: اسمها، أبصارهم: مفعول به." },
    { "id": 21, "text": "يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ", "tafsir": "دعوة البشر لتوحيد الله وعبادته وحده ليصلوا للتقوى.", "irab": "يا: نداء، اعبدوا: فعل أمر، ربكم: مفعول به." },
    { "id": 22, "text": "الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنزَلَ مِنَ السَّمَاءِ مَاءً", "tafsir": "الله مهد الأرض وأنزل المطر لرزق العباد وصلاح حالهم.", "irab": "الذي: نعت، الأرض: مفعول به أول، فراشاً: مفعول به ثانٍ." },
    { "id": 23, "text": "وَإِن كُنتُمْ فِي رَيْبٍ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا بِسُورَةٍ مِّن مِّثْلِهِ", "tafsir": "تحدي المشركين أن يأتوا بسورة تشبه القرآن إن شكوا فيه.", "irab": "إن: شرطية، فأتوا: جواب الشرط، بسورة: جار ومجرور." },
    { "id": 24, "text": "فَإِن لَّمْ تَفْعَلُوا وَلَن تَفْعَلُوا فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ", "tafsir": "بما أن عجزكم مؤكد، فاحذروا نار جهنم المعدة للكافرين.", "irab": "فاتقوا: فعل أمر، النار: مفعول به، وقودها: مبتدأ." },
    { "id": 25, "text": "وَبَشِّرِ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ", "tafsir": "بشارة للمؤمنين الصالحين بالنعيم الخالد في الجنات.", "irab": "بشر: فعل أمر، الذين: مفعول به، جنات: اسم أن منصوب." }
    { "id": 26, "text": "۞ إِنَّ اللَّهَ لَا يَسْتَحْيِي أَن يَضْرِبَ مَثَلًا مَّا بَعُوضَةً فَمَا فَوْقَهَا", "tafsir": "الله يضرب الأمثال بكل شيء لبيان الحق وتثبيت المؤمنين.", "irab": "إن: حرف ناسخ، الله: اسمها، مثلاً: مفعول به." },
    { "id": 27, "text": "الَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ", "tafsir": "صفات الخاسرين الذين يفسدون في الأرض ويخلفون العهود.", "irab": "الذين: نعت، ينقضون: فعل وفاعل، عهد: مفعول به." },
    { "id": 28, "text": "كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ۖ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ", "tafsir": "تعجب من الكفر رغم شهود الخلق والإحياء والموت والبعث.", "irab": "كيف: اسم استفهام، تكفرون: فعل مضارع." },
    { "id": 29, "text": "هُوَ الَّذِي خَلَقَ لَكُم مَّا فِي الْأَرْضِ جَمِيعًا ثُمَّ اسْتَوَىٰ إِلَى السَّمَاءِ", "tafsir": "الله سخر الأرض وما فيها للبشر وأتقن خلق السموات السبع.", "irab": "هو: مبتدأ، الذي: خبر، خلق: فعل ماض." },
    { "id": 30, "text": "وَإِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً", "tafsir": "قرار الله بخلق آدم واستخلافه في الأرض وإخبار الملائكة بذلك.", "irab": "إني: إن واسمها، جاعل: خبر إن، خليفة: مفعول به." },
    { "id": 31, "text": "وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَى الْمَلَائِكَةِ", "tafsir": "تشريف آدم بالعلم بأسماء كل شيء لإظهار فضله.", "irab": "علم: فعل، آدم: مفعول أول، الأسماء: مفعول ثانٍ." },
    { "id": 32, "text": "قَالُوا سُبْحَانَكَ لَا عِلْمَ لَنَا إِلَّا مَا عَلَّمْتَنَا ۖ إِنَّكَ أَنتَ الْعَلِيمُ الْحَكِيمُ", "tafsir": "اعتراف الملائكة بفضل الله وأن العلم كله لله وحده.", "irab": "سبحانك: مفعول مطلق، إنك: إن واسمها." },
    { "id": 33, "text": "قَالَ يَا آدَمُ أَنبِئْهُم بِأَسْمَائِهِمْ ۖ فَلَمَّا أَنبَأَهُم بِأَسْمَائِهِمْ", "tafsir": "آدم عليه السلام يخبر الملائكة بالأسماء بأمر ربه.", "irab": "يا آدم: منادى، أنبئهم: فعل أمر ومفعول به." },
    { "id": 34, "text": "وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ أَبَىٰ وَاسْتَكْبَرَ", "tafsir": "أمر السجود لآدم تكريماً له، ورفض إبليس استكباراً وكفراً.", "irab": "اسجدوا: فعل أمر، إبليس: مستثنى منصوب." },
    { "id": 35, "text": "وَقُلْنَا يَا آدَمُ اسْكُنْ أَنتَ وَزَوْجُكَ الْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا", "tafsir": "إباحة الجنة لآدم وزوجته والتحذير من شجرة واحدة.", "irab": "اسكن: فعل أمر، الجنة: مفعول به." },
    { "id": 36, "text": "فأزَلَّهُمَا الشَّيْطَانُ عَنْهَا فَأَخْرَجَهُمَا مِمَّا كَانَا فِيهِ", "tafsir": "وسوسة إبليس لهما وخروجهما من النعيم إلى الأرض.", "irab": "أزلهما: فعل ماض، الشيطان: فاعل." },
    { "id": 37, "text": "فَتَلَقَّىٰ آدَمُ مِن رَّبِّهِ كَلِمَاتٍ فَتَابَ عَلَيْهِ ۚ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ", "tafsir": "توبة آدم واستغفاره وقبول الله لتوبته برحمته.", "irab": "تلقى: فعل، آدم: فاعل، كلمات: مفعول به." },
    { "id": 38, "text": "قُلْنَا اهْبِطُوا مِنْهَا جَمِيعًا ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّي هُدًى", "tafsir": "الأمر بالنزول للأرض مع وعد بالهدى لمن يتبع الرسل.", "irab": "اهبطوا: فعل أمر، هدى: فاعل." },
    { "id": 39, "text": "وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ", "tafsir": "مصير المكذبين بالوحي هو الخلود في عذاب جهنم.", "irab": "أولئك: مبتدأ، أصحاب: خبر." },
    { "id": 40, "text": "يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَوْفُوا بِعَهْدِي", "tafsir": "تذكير بني إسرائيل بنعم الله والأمر بالوفاء بالعهد.", "irab": "يا بني: منادى، اذكروا: فعل أمر." },
    { "id": 41, "text": "وَآمِنُوا بِمَا أَنزَلْتُ مُصَدِّقًا لِّمَا مَعَكُمْ وَلَا تَكُونُوا أَوَّلَ كَافِرٍ بِهِ", "tafsir": "دعوتهم للإيمان بالقرآن المصدق للتوراة وعدم جحده.", "irab": "آمنوا: فعل أمر، مصدقاً: حال منصوب." },
    { "id": 42, "text": "وَلَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُوا الْحَقَّ وَأَنتُمْ تَعْلَمُونَ", "tafsir": "النهي عن خلط الحق بالباطل وكتمان العلم الصحيح.", "irab": "لا تلبسوا: ناهية ومضارع مجزوم." },
    { "id": 43, "text": "وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَارْكَعُوا مَعَ الرَّاكِعِينَ", "tafsir": "الأمر بالصلاة والزكاة والعبادة الجماعية.", "irab": "أقيموا: فعل أمر، الصلاة: مفعول به." },
    { "id": 44, "text": "أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ الْكِتَابَ", "tafsir": "توبيخ من يأمر بالخير ولا يفعله رغم علمه بالكتاب.", "irab": "أتأمرون: همزة استفهام، الناس: مفعول به." },
    { "id": 45, "text": "وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ", "tafsir": "الصبر والصلاة وسيلة لتحمل مشاق الحياة والتكاليف.", "irab": "استعينوا: فعل أمر، كبيرة: خبر إن." },
    { "id": 46, "text": "الَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ", "tafsir": "صفات الخاشعين المؤمنين بلقاء الله والبعث.", "irab": "الذين: نعت، أنهم: أن واسمها." },
    { "id": 47, "text": "يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَنِّي فَضَّلْتُكُمْ", "tafsir": "تذكيرهم بنعم الله وتفضيلهم على عالمي زمانهم.", "irab": "أني: أن واسمها، فضلتكم: جملة الخبر." },
    { "id": 48, "text": "وَاتَّقُوا يَوْمًا لَّا تَجْزِي نَفْسٌ عَن نَّفْسٍ شَيْئًا وَلَا يُقْبَلُ مِنْهَا شَفَاعَةٌ", "tafsir": "الحذر من يوم القيامة حيث لا تنفع وساطة ولا فداء.", "irab": "اتقوا: فعل أمر، يوماً: مفعول به." },
    { "id": 49, "text": "وَإِذْ نَجَّيْنَاكُم مِّنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ", "tafsir": "تذكيرهم بنعمة النجاة من ظلم فرعون وقتله للأبناء.", "irab": "نجيناكم: فعل وفاعل ومفعول به." },
    { "id": 50, "text": "وَإِذْ فَرَقْنَا بِكُمُ الْبَحْرَ فَأَنجَيْنَاكُمْ وَأَغْرَقْنَا آلَ فِرْعَوْنَ", "tafsir": "معجزة شق البحر ونجاة بني إسرائيل وهلاك عدوهم.", "irab": "فرقنا: فعل وفاعل، البحر: مفعول به." }
     { "id": 51, "text": "وَإِذْ وَاعَدْنَا مُوسَىٰ أَرْبَعِينَ لَيْلَةً ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِن بَعْدِهِ وَأَنتُمْ ظَالِمُونَ", "tafsir": "عبادة بني إسرائيل للعجل في غيبة موسى عليه السلام وتلقيه للتوراة.", "irab": "واعدنا: فعل وفاعل، موسى: مفعول به، العجل: مفعول به ثانٍ." },
    { "id": 52, "text": "ثُمَّ عَفَوْنَا عَنكُم مِّن بَعْدِ ذَٰلِكَ لَعَلَّكُمْ تَشْكُرُونَ", "tafsir": "عفو الله عن جريمة الشرك لعلهم يشكرون فضله ورحمته.", "irab": "عفونا: فعل وفاعل، لعلكم: لعل واسمها، تشكرون: مضارع." },
    { "id": 53, "text": "وَإِذْ آتَيْنَا مُوسَى الْكِتَابَ وَالْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُونَ", "tafsir": "إنزال التوراة لتكون منهجاً يفرق بين الحق والباطل للهداية.", "irab": "آتينا: فعل وفاعل، الكتاب: مفعول به، الفرقان: معطوف." },
    { "id": 54, "text": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِاتِّخَاذِكُمُ الْعِجْلَ", "tafsir": "أمر موسى لقومه بالتوبة من الشرك بتطهير أنفسهم وقتل المذنبين.", "irab": "ظلمتم: فعل وفاعل، أنفسكم: مفعول به." },
    { "id": 55, "text": "وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَن نُّؤْمِنَ لَكَ حَتَّىٰ نَرَى اللَّهَ جَهْرَةً فَأَخَذَتْكُمُ الصَّاعِقَةُ", "tafsir": "طلبهم رؤية الله عياناً تعنتاً فأخذتهم الصاعقة عقاباً لهم.", "irab": "لن: حرف ناصب، نؤمن: مضارع منصوب، جهرة: حال." },
    { "id": 56, "text": "ثُمَّ بَعَثْنَاكُم مِّن بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ", "tafsir": "إحياء الله لهم بعد الصاعقة ليعتبروا ويشكروا نعمة الحياة.", "irab": "بعثناكم: فعل وفاعل ومفعول به، موتكم: اسم مجرور." },
    { "id": 57, "text": "وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ وَأَنزَلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَىٰ ۖ كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ", "tafsir": "توفير الظل والرزق الطيب (المن والسلوى) لبني إسرائيل في التيه.", "irab": "الغمام: مفعول به، المن: مفعول به، السلوى: معطوف." },
    { "id": 58, "text": "وَإِذْ قُلْنَا ادْخُلُوا هَٰذِهِ الْقَرْيَةَ فَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا", "tafsir": "الأمر بدخول بيت المقدس بتواضع وطلب المغفرة (حطة).", "irab": "ادخلوا: فعل أمر، القرية: مفعول به، رغداً: حال." },
    { "id": 59, "text": "فَبَدَّلَ الَّذِينَ ظَلَمُوا قَوْلًا غَيْرَ الَّذِي قِيلَ لَهُمْ فَأَنزَلْنَا عَلَى الَّذِينَ ظَلَمُوا رِجْزًا", "tafsir": "تغييرهم لأمر الله استهزاءً فاستحقوا العذاب من السماء.", "irab": "الذين: فاعل، قولاً: مفعول به، رجزاً: مفعول به ثانٍ." },
    { "id": 60, "text": "۞ وَإِذِ اسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِ فَقُلْنَا اضْرِب بِّعَصَاكَ الْحَجَرَ ۖ فَانفَجَرَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا", "tafsir": "معجزة انفجار ١٢ عيناً من الحجر لسقيا قبائل بني إسرائيل.", "irab": "استسقى: فعل، موسى: فاعل، عيناً: تمييز منصوب." },
    { "id": 61, "text": "وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنبِتُ الْأَرْضُ", "tafsir": "مللهم من نعم الله وطلبهم لأطعمة الأرض الأدنى (بقلها وقثائها وفومها).", "irab": "لن: ناصب، نصبر: مضارع منصوب، طعام: اسم مجرور." },
    { "id": 62, "text": "إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالنَّصَارَىٰ وَالصَّابِئِينَ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ", "tafsir": "وعد الله بالأجر لكل من آمن وعمل صالحاً قبل بعثة النبي ﷺ.", "irab": "إن: حرف ناسخ، الذين: اسم إن، من آمن: خبر إن." },
    { "id": 63, "text": "وَإِذْ أَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّورَ خُذُوا مَا آتَيْنَاكُم بِقُوَّةٍ", "tafsir": "أخذ العهد ورفع جبل الطور فوقهم ترهيباً ليلتزموا بالميثاق.", "irab": "أخذنا: فعل وفاعل، ميثاقكم: مفعول به، الطور: مفعول به." },
    { "id": 64, "text": "ثُمَّ تَوَلَّيْتُم مِّن بَعْدِ ذَٰلِكا ۖ فَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَكُنتُم مِّنَ الْخَاسِرِينَ", "tafsir": "إعراضهم عن الميثاق ولولا رحمة الله لهلكوا بخطاياهم.", "irab": "توليتم: فعل وفاعل، فضل: مبتدأ لخبر محذوف." },
    { "id": 65, "text": "وَلَقَدْ عَلِمْتُمُ الَّذِينَ اعْتَدَوْا مِنكُمْ فِي السَّبْتِ فَقُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِينَ", "tafsir": "عقاب المعتدين في يوم السبت بمسخهم قردة منبوذين.", "irab": "الذين: مفعول به، قردة: خبر كـان منصوب." },
    { "id": 66, "text": "فَجَعَلْنَاهَا نَكَالًا لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِّلْمُتَّقِينَ", "tafsir": "جعل هذه العقوبة عبرة لمن حضرها ومن جاء بعدها.", "irab": "جعلناها: فعل وفاعل ومفعول به أول، نكالاً: مفعول ثانٍ." },
    { "id": 67, "text": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ إِنَّ اللَّهَ يَأْمُرُكُمْ أَن تَذْبَحُوا بَقَرَةً", "tafsir": "بداية قصة البقرة وكشف القاتل المجهول بأمر الله.", "irab": "يأمركم: فعل ومفعول به، أن تذبحوا: مصدر مؤول." },
    { "id": 68, "text": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ ۚ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَلَا بِكْرٌ", "tafsir": "تشديدهم على أنفسهم بالسؤال عن عمر البقرة (لا كبيرة ولا صغيرة).", "irab": "ادع: فعل أمر، بقرة: خبر إنَّ، لا فارض: نعت." },
    { "id": 69, "text": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا ۚ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ صَفْرَاءُ فَاقِعٌ لَّوْنُهَا", "tafsir": "سؤالهم عن لونها فجاء الرد بأنها صفراء شديدة الصفرة.", "irab": "ما: اسم استفهام مبتدأ، لونها: خبر، صفراء: نعت." },
    { "id": 70, "text": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ إِنَّ الْبَقَرَ تَشَابَهَ عَلَيْنَا", "tafsir": "مزيد من التعنت والجدال بأن البقر قد التبس عليهم.", "irab": "إن: حرف ناسخ، البقر: اسمها، تشابه: فعل ماض." },
    { "id": 71, "text": "قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لَّا ذَلُولٌ تُثِيرُ الْأَرْضَ وَلَا تَسْقِي الْحَرْثَ مُسَلَّمَةٌ", "tafsir": "وصف البقرة بأنها لا تعمل في حرث ولا سقي وسليمة تماماً.", "irab": "ذلول: نعت، تثير: فعل مضارع، الأرض: مفعول به." },
    { "id": 72, "text": "وَإِذْ قَتَلْتُمْ نَفْسًا فَادَّارَأْتُمْ فِيهَا ۖ وَاللَّهُ مُخْرِجٌ مَّا كُنتُمْ تَكْتُمُونَ", "tafsir": "وقوع جريمة قتل وتدافع التهم والله مظهر للحقيقة.", "irab": "قتلتم: فعل وفاعل، نفساً: مفعول به، الله: مبتدأ." },
    { "id": 73, "text": "فَقُلْنَا اضْرِبُوهُ بِبَعْضِهَا ۚ كَذَٰلِكَ يُحْيِي اللَّهُ الْمَوْتَىٰ وَيُرِيكُمْ آيَاتِهِ", "tafsir": "إحياء المقتول بجزء من البقرة ليخبر بقاتله كآية على البعث.", "irab": "اضربوه: فعل وفاعل ومفعول به، يحيي: مضارع." },
    { "id": 74, "text": "ثُمَّ قَسَتْ قُلُوبُكُم مِّن بَعْدِ ذَٰلِكَ فَهِيَ كَالْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةً", "tafsir": "شدة قلوب بني إسرائيل التي فاقت صلابة الحجر في القسوة.", "irab": "قست: فعل، قلوبكم: فاعل، كالحجارة: جار ومجرور." },
    { "id": 75, "text": "۞ أَفَتَطْمَعُونَ أَن يُؤْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ", "tafsir": "استبعاد إيمان اليهود الذين اعتادوا تحريف كلام الله عمداً.", "irab": "أن يؤمنوا: مصدر مؤول، فريق: اسم كـان." }
    { "id": 76, "text": "وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَا بَعْضُهُمْ إِلَىٰ بَعْضٍ قَالُوا أَتُحَدِّثُونَهُم بِمَا فَتَحَ اللَّهُ عَلَيْكُمْ لِيُحَاجُّوكُم بِهِ عِندَ رَبِّكُمْ ۚ أَفَلَا تَعْقِلُونَ", "tafsir": "نفاق اليهود بإظهار الإيمان أمام المسلمين ولوم بعضهم لبعض على إفشاء أسرار التوراة.", "irab": "لقوا: فعل وفاعل، الذين: مفعول به، آمنا: فعل وفاعل." },
    { "id": 77, "text": "أَوَلَا يَعْلَمُونَ أَنَّ اللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ", "tafsir": "تذكير للمنافقين بأن الله مطلع على خفايا نفوسهم وما يجهرون به.", "irab": "أن: حرف ناسخ، الله: اسمها، يعلم: جملة الخبر." },
    { "id": 78, "text": "وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ الْكِتَابَ إِلَّا أَمَانِيَّ وَإِنْ هُمْ إِلَّا يَظُنُّونَ", "tafsir": "فئة جاهلة من أهل الكتاب تتبع الأوهام والأكاذيب والظنون دون علم.", "irab": "أميّون: مبتدأ مؤخر، الكتاب: مفعول به." },
    { "id": 79, "text": "فَوَيْلٌ لِّلَّذِينَ يَكْتُبُونَ الْكِتَابَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هَٰذَا مِنْ عِندِ اللَّهِ لِيَشْتَرُوا بِهِ ثَمَنًا قَلِيلًا ۖ فَوَيْلٌ لَّهُم مِّمَّا كَتَبَتْ أَيْدِيهِمْ وَوَيْلٌ لَّهُم مِّمَّا يَكْسِبُونَ", "tafsir": "وعيد شديد لمن يحرفون الكتب السماوية بأيديهم لأجل مكاسب مادية زائلة.", "irab": "ويل: مبتدأ، للذين: خبر، يكتبون: صلة الموصول." },
    { "id": 80, "text": "وَقَالُوا لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَةً ۚ قُلْ أَتَّخَذْتُمْ عِندَ اللَّهِ عَهْدًا فَلَن يُخْلِفَ اللَّهُ عَهْدَهُ ۖ أَمْ تَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ", "tafsir": "ادعاؤهم الباطل بأن عذابهم سيكون قصيراً جداً، وتكذيب الله لهم لقولهم بغير علم.", "irab": "لن: ناصب، تمسنا: مضارع منصوب، النار: فاعل." },
    { "id": 81, "text": "بَلَىٰ مَن كَسَبَ سَيِّئَةً وَأَحَاطَتْ بِهِ خَطِيئَتُهُ فَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ", "tafsir": "الحقيقة أن من غرق في الذنوب والكفر حتى أحاطت به فمصيره الخلود في النار.", "irab": "من: اسم شرط مبتدأ، أصحاب: خبر." },
    { "id": 82, "text": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ ۖ هُمْ فِيهَا خَالِدُونَ", "tafsir": "المؤمنون الصالحون هم أهل الجنة الباقون فيها أبداً جزاء إيمانهم.", "irab": "الذين: مبتدأ، الجنة: مضاف إليه." },
    { "id": 83, "text": "وَإِذْ أَخَذْنَا مِيثَاقَ بَنِي إِسْرَائِيلَ لَا تَعْبُدُونَ إِلَّا اللَّهَ وَبِالْوَالِدَيْنِ إِحْسَانًا وَذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَقُولُوا لِلنَّاسِ حُسْنًا وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ ثُمَّ تَوَلَّيْتُمْ إِلَّا قَلِيلًا مِّنكُمْ وَأَنتُم مُّعْرِضُونَ", "tafsir": "ميثاق بني إسرائيل: التوحيد، بر الوالدين، والإحسان للضعفاء، والقول الحسن.", "irab": "أخذنا: فعل وفاعل، ميثاق: مفعول به." },
    { "id": 84, "text": "وَإِذْ أَخَذْنَا مِيثَاقَكُمْ لَا تَسْفِكُونَ دِمَاءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَارِكُمْ ثُمَّ أَقْرَرْتُمْ وَأَنتُمْ تَشْهَدُونَ", "tafsir": "العهد على منع القتل والتهجير القسري، وقد أقروا بذلك وشهدوا عليه.", "irab": "لا: نافيه، تسفكون: مضارع مرفوع بثبوت النون." },
    { "id": 85, "text": "ثُمَّ أَنتُمْ هَٰؤُلَاءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَارِهِمْ تَظَاهَرُونَ عَلَيْهِم بِالْإِثْمِ وَالْعُدْوَانِ", "tafsir": "توبيخهم على نقض الميثاق بقتل إخوانهم والتحالف مع الأعداء بالظلم.", "irab": "تقتلون: فعل وفاعل، أنفسكم: مفعول به." },
    { "id": 86, "text": "أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ ۖ فَلَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ يُنصَرُونَ", "tafsir": "تفضيلهم الدنيا الزائلة على الآخرة الباقية فاستحقوا عذاباً لا يخفف.", "irab": "اشتروا: فعل وفاعل، العذاب: نائب فاعل." },
    { "id": 87, "text": "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ وَقَفَّيْنَا مِن بَعْدِهِ بِالرُّسُلِ ۖ وَآتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنَاتِ وَأَيَّدْنَاهُ بِرُوحِ الْقُدُسِ", "tafsir": "تتابع الرسل وتأييد عيسى بالمعجزات، واستكبار اليهود بقتل الرسل وتكذيبهم.", "irab": "آتينا: فعل وفاعل، موسى: مفعول به أول." },
    { "id": 88, "text": "وَقَالُوا قُلُوبُنَا غُلْفٌ ۚ بَل لَّعَنَهُمُ اللَّهُ بِكُفْرِهِمْ فَقَلِيلًا مَّا يُؤْمِنُونَ", "tafsir": "ادعاؤهم أن قلوبهم مغطاة لا تفقه، والحقيقة أن الله طردهم لكفرهم.", "irab": "قلوبنا: مبتدأ، غلف: خبر." },
    { "id": 89, "text": "وَلَمَّا جَاءَهُمْ كِتَابٌ مِّنْ عِندِ اللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ وَكَانُوا مِن قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا فَلَمَّا جَاءَهُم مَّا عَرَفُوا كَفَرُوا بِهِ", "tafsir": "جحودهم بالقرآن رغم علمهم بصدقه وأنه يحقق ما في كتبهم التي استفتحوا بها.", "irab": "كتاب: فاعل، مصدق: نعت." },
    { "id": 90, "text": "بِئْسَمَا اشْتَرَوْا بِهِ أَنفُسَهُمْ أَن يَكْفُرُوا بِمَا أَنزَلَ اللَّهُ بَغْيًا أَن يُنَزِّلَ اللَّهُ مِن فَضْلِهِ عَلَىٰ مَن يَشَاءُ مِنْ عِبَادِهِ", "tafsir": "بيعهم لأنفسهم للكفر حسداً لأن الوحي نزل على محمد ﷺ من فضل الله.", "irab": "بئس: فعل ذم، بغياً: مفعول لأجله." },
    { "id": 91, "text": "وَإِذَا قِيلَ لَهُمْ آمِنُوا بِمَا أَنزَلَ اللَّهُ قَالُوا نُؤْمِنُ بِمَا أُنزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَاءَهُ وَهُوَ الْحَقُّ مُصَدِّقًا لِّمَا مَعَهُمْ", "tafsir": "رفضهم الإيمان بالقرآن بدعوى الاكتفاء بما أنزل عليهم رغم ثبوت صدق القرآن.", "irab": "نؤمن: فعل مضارع، هو: مبتدأ، الحق: خبر." },
    { "id": 92, "text": "وَلَقَدْ جَاءَكُم مُّوسَىٰ بِالْبَيِّنَاتِ ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِن بَعْدِهِ وَأَنتُمْ ظَالِمُونَ", "tafsir": "تذكير بعبادتهم للعجل رغم رؤيتهم لمعجزات موسى الواضحة الدلالة.", "irab": "موسى: فاعل، العجل: مفعول به." },
    { "id": 93, "text": "وَإِذْ أَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّورَ خُذُوا مَا آتَيْنَاكُم بِقُوَّةٍ وَاسْمَعُوا ۖ قَالُوا سَمِعْنَا وَعَصَيْنَا", "tafsir": "إعلانهم المعصية بعد سماع الميثاق، وتشرب قلوبهم حب العجل بسبب الكفر.", "irab": "خذوا: فعل أمر، عصينا: فعل وفاعل." },
    { "id": 94, "text": "قُلْ إِن كَانَتْ لَكُمُ الدَّارُ الْآخِرَةُ عِندَ اللَّهِ خَالِصَةً مِّن دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِن كُنتُمْ صَادِقِينَ", "tafsir": "تحدي اليهود بتمني الموت إن كانوا فعلاً هم أهل الجنة وحدهم كما يدعون.", "irab": "الدار: اسم كانت، الموت: مفعول به." },
    { "id": 95, "text": "وَلَن يَتَمَنَّوْهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۗ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ", "tafsir": "لن يطلبوا الموت لعلمهم بسوء أعمالهم وخوفهم من الحساب والجزاء.", "irab": "لن: ناصب، أيديهم: فاعل." },
    { "id": 96, "text": "وَلَتَجِدَنَّهُمْ أَحْرَصَ النَّاسُ عَلَىٰ حَيَاةٍ وَمِنَ الَّذِينَ أَشْرَكُوا ۚ يَوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ أَلْفَ سَنَةٍ وَمَا هُوَ بِمُزَحْزِحِهِ مِنَ الْعَذَابِ أَن يُعَمَّرَ ۗ وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ", "tafsir": "حرصهم الشديد على الدنيا وخوفهم من الموت لعلمهم بسوء المصير.", "irab": "أحرص: مفعول به ثانٍ، الله: مبتدأ، بصير: خبر." },
    { "id": 97, "text": "قُلْ مَن كَانَ عَدُوًّا لِّجِبْرِيلَ فَإِنَّهُ نَزَّلَهُ عَلَىٰ قَلْبِكَ بِإِذْنِ اللَّهِ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَهُدًى وَبُشْرَىٰ لِلْمُؤْمِنِينَ", "tafsir": "الرد على من عادى جبريل، وتأكيد أنه نزل بالقرآن هدى وبشرى بأمر الله.", "irab": "جبريل: اسم مجرور، مصدقاً: حال." },
    { "id": 98, "text": "مَن كَانَ عَدُوًّا لِّلَّهِ وَمَلَائِكَتِهِ وَرُسُلِهِ وَجِبْرِيلَ وَمِيكَالَ فَإِنَّ اللَّهَ عَدُوٌّ لِّلْكَافِرِينَ", "tafsir": "وعيد الله لمن يعادي ملائكته ورسله، فمن عاداهم فقد عادى الله.", "irab": "عدواً: خبر كان، الله: اسم إن." },
    { "id": 99, "text": "وَلَقَدْ أَنزَلْنَا إِلَيْكَ آيَاتٍ بَيِّنَاتٍ ۖ وَمَا يَكْفُرُ بِهَا إِلَّا الْفَاسِقُونَ", "tafsir": "وضوح الآيات القرآنية، وأنه لا يجحدها إلا الخارجون عن الطاعة.", "irab": "آيات: مفعول به منصوب، الفاسقون: فاعل." },
    { "id": 100, "text": "أَوَكُلَّمَا عَاهَدُوا عَهْدًا نَّبَذَهُ فَرِيقٌ مِّنْهُم ۚ بَلْ أَكْثَرُهُمْ لَا يُؤْمِنُونَ", "tafsir": "نقضهم المتكرر للعهود وعدم إيمان أكثرهم بصدق المواثيق.", "irab": "عهداً: مفعول به، فريق: فاعل." }    { "id": 101, "text": "وَلَمَّا جَاءَهُمْ رَسُولٌ مِّنْ عِندِ اللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ نَبَذَ فَرِيقٌ مِّنَ الَّذِينَ أُوتُوا الْكِتَابَ كِتَابَ اللَّهِ وَرَاءَ ظُهُورِهِمْ كَأَنَّهُمْ لَا يَعْلَمُونَ", "tafsir": "إعراض علماء أهل الكتاب عن القرآن ونبذه رغم علمهم بصدقه وأنه يوافق ما عندهم.", "irab": "رسول: فاعل، مصدق: نعت، فريق: فاعل، كتاب الله: مفعول به." },
    { "id": 102, "text": "وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَىٰ مُلْكِ سُلَيْمَانَ ۖ وَمَا كَفَرَ سُلَيْمَانُ وَلَٰكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ", "tafsir": "قصة السحر في عهد سليمان وتبرئة الله له، وبيان أن الشياطين هم من علموا الناس السحر والفتنة.", "irab": "الشياطين: فاعل، السحر: مفعول به ثانٍ، هاروت: بدل." },
    { "id": 103, "text": "وَلَوْ أَنَّهُمْ آمَنُوا وَاتَّقَوْا لَمَثُوبَةٌ مِّنْ عِندِ اللَّهِ خَيْرٌ ۖ لَّوْ كَانُوا يَعْلَمُونَ", "tafsir": "لو أنهم اتبعوا الإيمان والتقوى لكان ثواب الله لهم خيراً من السحر الذي اتبعوه.", "irab": "آمنوا: فعل وفاعل، مثوبة: مبتدأ، خير: خبر." },
    { "id": 104, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقُولُوا رَاعِنَا وَقُولُوا انظُرْنَا وَاسْمَعُوا ۗ وَلِلْكَافِرِينَ عَذَابٌ أَلِيمٌ", "tafsir": "أدب خطاب النبي ﷺ واجتناب الألفاظ التي يحتملها السب (مثل راعنا) واستبدالها بـ (انظرنا).", "irab": "لا: ناهية، تقولوا: مضارع مجزوم، انظرنا: فعل أمر." },
    { "id": 105, "text": "مَّا يَوَدُّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَلَا الْمُشْرِكِينَ أَن يُنَزَّلَ عَلَيْكُم مِّنْ خَيْرٍ مِّن رَّبِّكُمْ", "tafsir": "حسد الكفار والمشركين للمسلمين وتمنيهم عدم نزول الوحي والخير عليهم.", "irab": "الذين: فاعل، أن ينزل: مصدر مؤول فاعل يود." },
    { "id": 106, "text": "۞ مَا نَنسَخْ مِنْ آيةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍ مِّنْهَا أَوْ مِثْلِهَا ۗ أَلَمْ تَعْلَمْ أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ", "tafsir": "حكمة النسخ في الآيات والأحكام وتبديلها بما هو أنفع للعباد بقدرة الله.", "irab": "ما: اسم شرط، ننسخ: فعل الشرط، نأتِ: جواب الشرط." },
    { "id": 107, "text": "أَلَمْ تَعْلَمْ أَنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ", "tafsir": "تأكيد ملك الله المطلق للكون وتصرفه فيه، وأنه لا ولي ولا ناصر للعباد سواه.", "irab": "ألم تعلم: استفهام ونفي، ملك: مبتدأ، ولي: مبتدأ مؤخر." },
    { "id": 108, "text": "أَمْ تُرِيدُونَ أَن تَسْأَلُوا رَسُولَكُمْ كَمَا سُئِلَ مُوسَىٰ مِن قَبْلُ ۗ وَمَن يَتَبَدَّلِ الْكُفْرَ بِالْإِيمَانِ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ", "tafsir": "النهي عن كثرة السؤال والتعنت مع الرسول ﷺ كما فعل بنو إسرائيل مع موسى.", "irab": "أن تسألوا: مفعول به، موسى: نائب فاعل، السبيل: مضاف إليه." },
    { "id": 109, "text": "وَدَّ كَثِيرٌ مِّن أَهْلِ الْكِتَابِ لَوْ يَرُدُّونَكُم مِّن بَعْدِ إِيمَانِكُمْ كُفَّارًا حَسَدًا مِّنْ عِندِ أَنفُسِهِم", "tafsir": "رغبة أهل الكتاب في رد المسلمين للكفر حسداً، والأمر بالعفو عنهم حتى يأتي أمر الله.", "irab": "ود: فعل، كثير: فاعل، كفاراً: حال، حسداً: مفعول لأجله." },
    { "id": 110, "text": "وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ ۚ وَمَا تُقَدِّمُوا لِأَنفُسِكُم مِّنْ خَيْرٍ تَجِدُوهُ عِندَ اللَّهِ", "tafsir": "الأمر بالعبادة والعمل الصالح الذي يجد العبد ثوابه مدخراً عند ربه.", "irab": "أقيموا: فعل أمر، ما: اسم شرط، تجدوه: جواب الشرط." },
    { "id": 111, "text": "وَقَالُوا لَن يَدْخُلَ الْجَنَّةَ إِلَّا مَن كَانَ هُودًا أَوْ نَصَارَىٰ ۗ تِلْكَ أَمَانِيُّهُمْ ۗ قُلْ هَاتُوا بُرْهَانَكُمْ", "tafsir": "ادعاؤهم الباطل بأن الجنة حكر عليهم، والمطالبة بالدليل الصادق على ذلك.", "irab": "يدخل: مضارع منصوب، الجنة: مفعول به، برهانكم: مفعول به." },
    { "id": 112, "text": "بَلَىٰ مَنْ أَسْلَمَ وَجْهَهُ لِلَّهِ وَهُوَ مُحْسِنٌ فَلَهُ أَجْرُهُ عِندَ رَبِّهِ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ", "tafsir": "شرط النجاة والجنة: الإخلاص لله (إسلام الوجه) واتباع السنة (الإحسان).", "irab": "من: اسم شرط، وجهه: مفعول به، أجره: مبتدأ مؤخر." },
    { "id": 113, "text": "وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَىٰ عَلَىٰ شَيْءٍ وَقَالَتِ النَّصَارَىٰ لَيْسَتِ الْيَهُودُ عَلَىٰ شَيْءٍ", "tafsir": "تبادل الاتهامات بين أهل الكتاب رغم قراءتهم للكتب السماوية، والله يحكم بينهم.", "irab": "اليهود: فاعل، النصارى: اسم ليس، شيء: اسم مجرور." },
    { "id": 114, "text": "وَمَنْ أَظْلَمُ مِمَّن مَّنَعَ مَسَاجِدَ اللَّهِ أَن يُذْكَرَ فِيهَا اسْمُهُ وَسَعَىٰ فِي خَرَابِهَا", "tafsir": "أشد الناس ظلماً هم من يمنعون الصلاة في المساجد ويسعون لخرابها الحسي والمعنوي.", "irab": "من: مبتدأ، أظلم: خبر، مساجد: مفعول به." },
    { "id": 115, "text": "وَلِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ ۚ فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ ۚ إِنَّ اللَّهَ وَاسِعٌ عَلِيمٌ", "tafsir": "الأرض كلها ملك لله، والقبلة حيثما أمر الله فثمة وجهه الكريم.", "irab": "لله: خبر مقدم، المشرق: مبتدأ، أينما: اسم شرط." },
    { "id": 116, "text": "وَقَالُوا اتَّخَذَ اللَّهُ وَلَدًا ۗ سُبْحَانَهُ ۖ بَل لَّهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ كُلٌّ لَّهُ قَانِتُونَ", "tafsir": "تنزيه الله عن اتخاذ الولد، وتأكيد ملكه وخضوع كل الكائنات له.", "irab": "اتخذ: فعل، ولداً: مفعول به، سبحانه: مفعول مطلق." },
    { "id": 117, "text": "بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ ۖ وَإِذَا قضَىٰ أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُن فَيَكُونُ", "tafsir": "خالق الكون ومبدعه على غير مثال سابق، وأمره نافذ بكلمة (كن).", "irab": "بديع: خبر لمبتدأ محذوف، أمراً: مفعول به، يكون: مضارع." },
    { "id": 118, "text": "وَقَالَ الَّذِينَ لَا يَعْلَمُونَ لَوْلَا يُكَلِّمُنَا اللَّهُ أَوْ تَأْتِينَا آيةٌ", "tafsir": "طلبات الجهلة برؤية معجزات خاصة أو سماع كلام الله مباشرة كما فعل من قبلهم.", "irab": "الذين: فاعل، يكلمنا: فعل، الله: فاعل، آية: فاعل." },
    { "id": 119, "text": "إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا ۖ وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ", "tafsir": "مهمة الرسول ﷺ هي التبشير بالجنة والإنذار من النار بالصدق والحق.", "irab": "أرسلناك: فعل وفاعل ومفعول به، بشيراً: حال." },
    { "id": 120, "text": "وَلَن تَرْضَىٰ عَنكَ الْيَهُودُ وَلَا النَّصَارَىٰ حَتَّىٰ تَتَّبِعَ مِلَّتَهُمْ", "tafsir": "تنبيه للرسول ﷺ بأن أهل الكتاب لن يرضوا عنه حتى يترك دينه ويتبع أهواءهم.", "irab": "لن: ناصب، ترضى: مضارع منصوب، اليهود: فاعل." }
    { "id": 121, "text": "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَتْلُونَهُ حَقَّ تِلَاوَتِهِ أُولَٰئِكَ يُؤْمِنُونَ بِهِ ۗ وَمَن يَكْفُرْ بِهِ فَأُولَٰئِكَ هُمُ الْخَاسِرُونَ", "tafsir": "الذين يقرأون كتبهم بصدق ويتبعون ما فيها يؤمنون بالقرآن، ومن جحد به فقد خسر نفسه.", "irab": "الذين: مبتدأ، يتلونه: جملة حالية، أولئك: مبتدأ ثانٍ، الخاسرون: خبر." },
    { "id": 122, "text": "يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَنِّي فَضَّلْتُكُمْ عَلَى الْعَالَمِينَ", "tafsir": "تكرار التذكير لبني إسرائيل بنعم الله وتفضيلهم على عالمي زمانهم لإقامة الحجة.", "irab": "يا بني: منادى، اذكروا: فعل أمر، نعمتي: مفعول به." },
    { "id": 123, "text": "وَاتَّقُوا يَوْمًا لَّا تَجْزِي نَفْسٌ عَن نَّفْسٍ شَيْئًا وَلَا يُقْبَلُ مِنْهَا عَدْلٌ وَلَا تَنفَعُهَا شَفَاعَةٌ وَلَا هُمْ يُنصَرُونَ", "tafsir": "التحذير من أهوال يوم القيامة حيث لا تنفع فدية ولا وساطة ولا ناصر من دون الله.", "irab": "اتقوا: فعل أمر، يوماً: مفعول به، نفس: فاعل، عدل: نائب فاعل." },
    { "id": 124, "text": "۞ وَإِذِ ابْتَلَىٰ إِبْرَاهِيمَ رَبُّهُ بِكَلِمَاتٍ فَأَتَمَّهُنَّ ۖ قَالَ إِنِّي جَاعِلُكَ لِلنَّاسِ إِمَامًا", "tafsir": "اختبار الله لإبراهيم عليه السلام بالأوامر فأتمها، فجعله الله قدوة وإماماً للناس.", "irab": "ابتلى: فعل ماض، إبراهيم: مفعول به مقدم، ربه: فاعل مؤخر، إماماً: مفعول به ثانٍ." },
    { "id": 125, "text": "وَإِذْ جَعَلْنَا الْبَيْتَ مَثَابَةً لِّلنَّاسِ وَأَمْنًا وَاتَّخِذُوا مِن مَّقَامِ إِبْرَاهِيمَ مُصَلًّى", "tafsir": "جعل الكعبة مرجعاً للناس وأمناً، والأمر باتخاذ مكان وقوف إبراهيم مكاناً للصلاة.", "irab": "جعلنا: فعل وفاعل، البيت: مفعول به أول، مثابة: مفعول به ثانٍ." },
    { "id": 126, "text": "وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَٰذَا بَلَدًا آمِنًا وَارْزُقْ أَهْلَهُ مِنَ الثَّمَرَاتِ مَنْ آمَنَ مِنْهُم بِاللَّهِ", "tafsir": "دعاء إبراهيم لمكة بالأمن والرزق الطيب للمؤمنين خاصة.", "irab": "اجعل: فعل أمر، هذا: مفعول به أول، بلداً: مفعول به ثانٍ، آمناً: نعت." },
    { "id": 127, "text": "وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ", "tafsir": "بناء الكعبة بيد إبراهيم وإسماعيل عليهما السلام ودعاؤهما لله بالقبول.", "irab": "يرفع: فعل مضارع، إبراهيم: فاعل، القواعد: مفعول به، إسماعيل: معطوف." },
    { "id": 128, "text": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا", "tafsir": "دعاء بالثبات على الإسلام وطلب معرفة شعائر الحج والتوبة من التقصير.", "irab": "اجعلنا: فعل ومفعول به، مسلمين: مفعول به ثانٍ، مناسكنا: مفعول به." },
    { "id": 129, "text": "رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِكَ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُزَكِّيهِمْ", "tafsir": "دعاء إبراهيم ببعثة النبي محمد ﷺ في أهل مكة لتعليمهم وتطهير نفوسهم.", "irab": "ابعث: فعل أمر، رسولاً: مفعول به، آياتك: مفعول به، يزكيهم: مضارع." },
    { "id": 130, "text": "وَمَن يَرْغَبُ عَن مِّلَّةِ إِبْرَاهِيمَ إِلَّا مَن سَفِهَ نَفْسَهُ ۚ وَلَقَدِ اصْطَفَيْنَاهُ فِي الدُّنْيَا", "tafsir": "لا يترك دين إبراهيم (التوحيد) إلا الجاهل الأحمق، فإبراهيم مختار ومصطفى عند الله.", "irab": "من: اسم استفهام، ملة: اسم مجرور، نفسه: مفعول به، اصطفيناه: فعل وفاعل ومفعول به." },
    { "id": 131, "text": "إِذْ قَالَ لَهُ رَبُّهُ أَسْلِمْ ۖ قَالَ أَسْلَمْتُ لِرَبِّ الْعَالَمِينَ", "tafsir": "سرعة استجابة إبراهيم لأمر ربه بالانقياد والتوحيد لله خالق كل شيء.", "irab": "قال: فعل ماض، له: جار ومجرور، أسلم: فعل أمر، أسلمت: فعل وفاعل." },
    { "id": 132, "text": "وَوَصَّىٰ بِهَا إِبْرَاهِيمُ بَنِيهِ وَيَعْقُوبُ يَا بَنِيَّ إِنَّ اللَّهَ اصْطَفَىٰ لَكُمُ الدِّينَ فَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ", "tafsir": "وصية إبراهيم ويعقوب لأبنائهما بالتمسك بالإسلام والثبات عليه حتى الموت.", "irab": "وصى: فعل ماض، بنيه: مفعول به، الله: اسم إن، مسلمون: خبر المبتدأ." },
    { "id": 133, "text": "أَمْ كُنتُمْ شُهَدَاءَ إِذْ حَضَرَ يَعْقُوبَ الْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِن بَعْدِي", "tafsir": "سؤال يعقوب لأبنائه عند موته ليتطمن على توحيدهم لله، فأكدوا اتباعهم لدين آبائهم.", "irab": "كنتم: كان واسمها، شهداء: خبرها، يعقوب: مفعول به مقدم، الموت: فاعل مؤخر." },
    { "id": 134, "text": "تِلْكَ أُمَّةٌ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ ۖ وَلَا تُسْأَلُونَ عَمَّا كَانُوا يَعْمَلُونَ", "tafsir": "كل أمة تجازى بعملها، ولن تنفعكم أنسابكم السابقة دون عمل صالح منكم.", "irab": "تلك: مبتدأ، أمة: خبر، خلت: فعل ماض، كسبت: فعل وفاعل." },
    { "id": 135, "text": "وَقَالُوا كُونُوا هُودًا أَوْ نَصَارَىٰ تَهْتَدُوا ۗ قُلْ بَلْ مِلَّةَ إِبْرَاهِيمَ حنيفًا ۖ وَمَا كَانَ مِنَ الْمُشْرِكِينَ", "tafsir": "دعوة أهل الكتاب لاتباع أديانهم، والرد بوجوب اتباع ملة إبراهيم الموحدة لله.", "irab": "كونوا: فعل أمر ناقص، هوداً: خبرها، تهتدوا: جواب الطلب، حنيفاً: حال." },
    { "id": 136, "text": "قُولُوا آمَنَّا بِاللَّهِ وَمَا أُنزِلَ إِلَيْنَا وَمَا أُنزِلَ إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ", "tafsir": "إعلان الإيمان بجميع الأنبياء وما أنزل الله عليهم من وحي دون تفرقة بينهم.", "irab": "قولوا: فعل أمر، آمنا: فعل وفاعل، الله: اسم مجرور، أنزل: فعل مبني للمجهول." },
    { "id": 137, "text": "فَإِنْ آمَنُوا بِمِثْلِ مَا آمَنتُم بِهِ فَقَدِ اهْتَدَوا ۖ وَّإِن تَوَلَّوْا فَإِنَّمَا هُمْ فِي شِقَاقٍ ۖ فَسَيَكْفِيكَهُمُ اللَّهُ", "tafsir": "الهداية في الإيمان كما آمن الصحابة، ومن أعرض فهو في عداء، والله كافيك شرهم.", "irab": "آمنوا: فعل ماض، اهتدوا: جواب الشرط، هم: مبتدأ، الله: فاعل يكفي." },
    { "id": 138, "text": "صِبْغَةَ اللَّهِ ۖ وَمَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً ۖ وَنحنُ لَهُ عَابِدُونَ", "tafsir": "دين الله هو الفطرة والصبغة الحقيقية للروح، ولا أحسن من منهج الله.", "irab": "صبغة: مفعول مطلق لفعل محذوف، من: اسم استفهام مبتدأ، عابدون: خبر." },
    { "id": 139, "text": "قُلْ أَتُحَاجُّونَنَا فِي اللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ وَنَحْنُ لَهُ مُخْلِصُونَ", "tafsir": "الرد على مجادلة أهل الكتاب؛ فالله رب الجميع، وكل أمة تجازى بعملها الخاص.", "irab": "أتحاجوننا: همزة استفهام وفعل ومفعول به، أعمالنا: مبتدأ مؤخر، مخلصون: خبر." },
    { "id": 140, "text": "أَمْ تَقُولُونَ إِنَّ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطَ كَانُوا هُودًا أَوْ نَصَارَىٰ", "tafsir": "إنكار ادعاء أهل الكتاب بأن الأنبياء السابقين كانوا على أديانهم المحرفة.", "irab": "إن: حرف ناسخ، إبراهيم: اسمها، كانوا: كان واسمها، هوداً: خبر كان." }
    { "id": 141, "text": "تِلْكَ أُمَّةٌ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ ۖ وَلَا تُسْأَلُونَ عَمَّا كَانُوا يَعْمَلُونَ", "tafsir": "تأكيد أن كل أمة مسؤولة عن عملها، ولا يغني عمل الآباء عن الأبناء شيئاً.", "irab": "تلك: مبتدأ، أمة: خبر، لها: خبر مقدم، ما: مبتدأ مؤخر." },
    { "id": 142, "text": "۞ سَيَقُولُ السُّفَهَاءُ مِنَ النَّاسِ مَا وَلَّاهُمْ عَن قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا", "tafsir": "بداية الحديث عن تحويل القبلة والرد على اعتراض الجهلة من اليهود والمشركين.", "irab": "السفهاء: فاعل، ما: اسم استفهام مبتدأ، ولاهم: جملة الخبر." },
    { "id": 143, "text": "وَكَذَٰلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِّتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا", "tafsir": "تشريف الأمة الإسلامية بالعدل والخيرية لتكون شاهدة على الأمم يوم القيامة.", "irab": "جعلناكم: فعل وفاعل ومفعول به، وسطاً: نعت، شهداء: خبر تكون." },
    { "id": 144, "text": "قَدْ نَرَىٰ تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ ۖ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا ۚ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ", "tafsir": "استجابة الله لرغبة النبي ﷺ بتحويل القبلة من بيت المقدس إلى الكعبة.", "irab": "نرى: فعل مضارع، وجهك: مضاف إليه، شطر: ظرف مكان." },
    { "id": 145, "text": "وَلَئِنْ أَتَيْتَ الَّذِينَ أُوتُوا الْكِتَابَ بِكُلِّ آيَةٍ مَّا تَبِعُوا قِبْلَتَكَ ۚ وَمَا أَنتَ بِتَابِعٍ قِبْلَتَهُمْ", "tafsir": "بيان عناد أهل الكتاب وأنهم لن يتبعوا قبلة المسلمين مهما كانت الأدلة.", "irab": "الذين: مفعول به، آية: اسم مجرور، قبلتك: مفعول به." },
    { "id": 146, "text": "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَعْرِفُونَهُ كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ ۖ وَإِنَّ فَرِيقًا مِّنْهُمْ لَيَكْتُمُونَ الْحَقَّ", "tafsir": "علماء أهل الكتاب يعرفون صدق النبي ﷺ وتغيير القبلة كما يعرفون أبناءهم.", "irab": "يعرفونه: فعل وفاعل ومفعول به، الحق: مفعول به." },
    { "id": 147, "text": "الْحَقُّ مِن رَّبِّكَ ۖ فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ", "tafsir": "تأكيد أن ما جاء من الوحي هو الحق الذي لا شك فيه، والنهي عن التردد.", "irab": "الحق: مبتدأ، من ربك: خبر، لا: ناهية، تكونن: مضارع مبني." },
    { "id": 148, "text": "وَلِكُلٍّ وِجْهَةٌ هُهوُ مُوَلِّيهَا ۖ فَاسْتَبِقُوا الْخَيْرَاتِ ۚ أَيْنَ مَا تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعًا", "tafsir": "لكل أمة قبلة، والمهم هو المسارعة في الطاعات لأن المرجع لله وحده.", "irab": "لكل: خبر مقدم، وجهة: مبتدأ مؤخر، الله: فاعل يأتِ." },
    { "id": 149, "text": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۖ وَإِنَّهُ لَلْحَقُّ مِن رَّبِّكَ", "tafsir": "تأكيد وجوب التوجه للكعبة عند الخروج للسفر أو أي مكان.", "irab": "ولّ: فعل أمر، وجهك: مفعول به، المسجد: مضاف إليه." },
    { "id": 150, "text": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۚ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ", "tafsir": "تكرار الأمر بالقبلة لقطع حجة المعاندين وإتمام النعمة على المؤمنين.", "irab": "كنتم: كان واسمها، وجوهكم: مفعول به، شطره: ظرف." },
    { "id": 151, "text": "كَمَا أَرْسَلْنَا فِيكُمْ رَسُولًا مِّنكُمْ يَتْلُو عَلَيْكُمْ آيَاتِنَا وَيُزَكِّيكُمْ وَيُعَلِّمُكُمُ الْكِتَابَ وَالْحِكْمَةَ", "tafsir": "تذكير بمنة الله بإرسال النبي ﷺ لتعليم الناس وتطهير نفوسهم.", "irab": "رسولاً: مفعول به، يتلو: فعل مضارع، آياتنا: مفعول به." },
    { "id": 152, "text": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ", "tafsir": "الأمر بذكر الله بالقلب واللسان، وشكره على نعمه، والنهي عن الجحود.", "irab": "اذكروني: فعل أمر وفاعل ومفعول به، أذكركم: جواب الطلب." },
    { "id": 153, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ", "tafsir": "إرشاد المؤمنين لطلب العون من الله بالصبر على البلاء وأداء الصلاة.", "irab": "استعينوا: فعل أمر، بالصبر: جار ومجرور، الله: اسم إن." },
    { "id": 154, "text": "وَلَا تَقُولُوا لِمَن يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ ۚ بَلْ أَحْيَاءٌ وَلَٰكِن لَّا تَشْعُرُونَ", "tafsir": "الشهداء أحياء عند ربهم حياة برزخية لا يدركها الأحياء في الدنيا.", "irab": "لا: ناهية، أموات: خبر لمبتدأ محذوف تقديره (هم)." },
    { "id": 155, "text": "وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ", "tafsir": "سنة الله في اختبار المؤمنين بمختلف أنواع الابتلاءات لتمحيصهم.", "irab": "نبلونكم: مضارع مبني، الصابرين: مفعول به منصوب بالياء." },
    { "id": 156, "text": "الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ", "tafsir": "صفة الصابرين هي التسليم لله والاعتراف بأنه المالك والمرجع.", "irab": "أصابتهم: فعل ومفعول به، مصيبة: فاعل، إنا: إن واسمها." },
    { "id": 157, "text": "أُولَٰئِكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ ۖ وَأُولَٰئِكَ هُمُ الْمُهْتَدُونَ", "tafsir": "جزاء الصابرين عند الله: الثناء والرحمة والهداية لطريق الحق.", "irab": "صلوات: مبتدأ مؤخر، ربهم: مضاف إليه، المهتدون: خبر." },
    { "id": 158, "text": "۞ إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّهِ ۖ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ", "tafsir": "بيان أن السعي بين الصفا والمروة من معالم دين الله وشعائر الحج والعمرة.", "irab": "الصفا: اسم إن، شعائر: اسم مجرور، من: اسم شرط." },
    { "id": 159, "text": "إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنزَلْنَا مِنَ الْبَيِّنَاتِ وَالْهُدَىٰ مِن بَعْدِ مَا بَيَّنَّاهُ لِلنَّاسِ", "tafsir": "وعيد شديد لمن يخفي العلم والهدى الذي أنزله الله في الكتب السماوية.", "irab": "الذين: اسم إن، يكتمون: صلة الموصول، البينات: مفعول به." },
    { "id": 160, "text": "إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَبَيَّنُوا فَأُولَٰئِكَ أَتُوبُ عَلَيْهِمْ ۚ وَأَنَا التَّوَّابُ الرَّحِيمُ", "tafsir": "فتح باب التوبة لمن كتم الحق بشرط الإصلاح والبيان لما أخفاه.", "irab": "تابوا: فعل وفاعل، أولئك: مبتدأ، أنا: مبتدأ، التواب: خبر." }
    { "id": 161, "text": "إِنَّ الَّذِينَ كَفَرُوا وَمَاتُوا وَهُمْ كُفَّارٌ أُولَٰئِكَ عَلَيْهِمْ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ", "tafsir": "من أصر على كفره حتى الموت استحق اللعنة والطرد من رحمة الله من الجميع.", "irab": "الذين: اسم إن، كفروا: صلة الموصول، وهم كفار: جملة حالية." },
    { "id": 162, "text": "خَالِدِينَ فِيهَا ۖ لَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ يُنظَرُونَ", "tafsir": "بقاء الكفار في اللعنة والعذاب أبداً دون تخفيف أو إمهال.", "irab": "خالدين: حال، العذاب: نائب فاعل، ينظرون: مضارع مبني للمجهول." },
    { "id": 163, "text": "وَإِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ ۖ لَّا إِلَٰهَ إِلَّا هُوَ الرَّحْمَنُ الرَّحِيمُ", "tafsir": "تأكيد وحدانية الله المطلقة، المتفرد بالرحمة الواسعة لكل خلقه.", "irab": "إلهكم: مبتدأ، واحد: خبر، هو: بدل من الضمير المستتر." },
    { "id": 164, "text": "إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنفَعُ النَّاسَ", "tafsir": "الأدلة الكونية الظاهرة على وجود الخالق وقدرته وحكمته في تدبير الكون.", "irab": "في خلق: خبر إن مقدم، آيات: اسم إن مؤخر، الناس: مفعول به." },
    { "id": 165, "text": "وَمِنَ النَّاسِ مَن يَتَّخِذُ مِن دُونِ اللَّهِ أَندَادًا يُحِبُّونَهُمْ كَحُبِّ اللَّهِ ۖ وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِّلَّهِ", "tafsir": "ذم المشركين الذين يسوون غير الله به في المحبة، وتأكيد أن المؤمنين يخلصون حبهم لله.", "irab": "من الناس: خبر مقدم، أنداداً: مفعول به، حباً: تمييز." },
    { "id": 166, "text": "إِذْ تَبَرَّأَ الَّذِينَ اتُّبِعُوا مِنَ الَّذِينَ اتَّبَعُوا وَرَأَوُا الْعَذَابَ وَتَقَطَّعَتْ بِهِمُ الْأَسْبَابُ", "tafsir": "تبرؤ القادة من أتباعهم يوم القيامة عند رؤية العذاب وانقطاع كل صلاتهم.", "irab": "تتبرأ: فعل، الذين: فاعل، العذاب: مفعول به." },
    { "id": 167, "text": "وَقَالَ الَّذِينَ اتَّبَعُوا لَوْ أَنَّ لَنَا كَرَّةً فَنَتَبَرَّأَ مِنْهُمْ كَمَا تَبَرَّءُوا مِنَّا", "tafsir": "ندم الأتباع وتمنيهم العودة للدنيا ليتبرأوا من متبوعيهم كما فعلوا بهم.", "irab": "لو: حرف تمنٍ، كرة: اسم أن مؤخر، نتبرأ: مضارع منصوب." },
    { "id": 168, "text": "يَا أَيُّهَا النَّاسُ كُلُوا مِمَّا فِي الْأَرْضِ حَلَالًا طَيِّبًا وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ ۚ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ", "tafsir": "إباحة الطيبات من الرزق والتحذير من مكائد الشيطان في التحريم والتحليل.", "irab": "كلوا: فعل أمر، حلالاً: حال، الشيطان: مضاف إليه." },
    { "id": 169, "text": "إِنَّمَا يَأْمُرُكُم بِالسُّوءِ وَالْفَحْشَاءِ وَأَن تَقُولُوا عَلَى اللَّهِ مَا لَا تَعْلَمُونَ", "tafsir": "أهداف الشيطان: دفع العباد للذنوب القبيحة والقول على الله بغير علم.", "irab": "يأمركم: فعل ومفعول به، أن تقولوا: مصدر مؤول." },
    { "id": 170, "text": "وَإِذَا قِيلَ لَهُمُ اتَّبِعُوا مَا أَنزَلَ اللَّهُ قَالُوا بَلْ نَتَّبِعُ مَا أَلْفَيْنَا عَلَيْهِ آبَاءَنَا", "tafsir": "عناد الكفار وتقليدهم الأعمى لآبائهم ورفضهم لاتباع الوحي الإلهي.", "irab": "قيل: مبني للمجهول، نتبع: مضارع، آباءنا: مفعول به." },
    { "id": 171, "text": "وَمَثَلُ الَّذِينَ كَفَرُوا كَمَثَلِ الَّذِي يَنْعِقُ بِمَا لَا يَسْمَعُ إِلَّا دُعَاءً وَنِدَاءً ۚ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ", "tafsir": "مثل الكفار في دعائهم كمثل الغنم التي تسمع صوت الراعي ولا تفقه معناه.", "irab": "مثل: مبتدأ، الذي: مضاف إليه، صم: خبر لمبتدأ محذوف." },
    { "id": 172, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُوا لِلَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ", "tafsir": "الأمر بالتمتع بالرزق الحلال وشكر الله عليه كشرط للعبادة الحقة.", "irab": "الذين: فاعل، طيبات: اسم مجرور، إياه: مفعول به مقدم." },
    { "id": 173, "text": "إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنزِيرِ وَمَا أُهِلَّ بِهِ لِغَيْرِ اللَّهِ", "tafsir": "بيان المحرمات من اللحوم، والرخصة في أكلها للمضطر لإنقاذ حياته.", "irab": "حرم: فعل، الميتة: مفعول به، لغير الله: جار ومجرور." },
    { "id": 174, "text": "إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنزَلَ اللَّهُ مِنَ الْكِتَابِ وَيَشْتَرُونَ بِهِ ثَمَنًا قَلِيلًا ۙ أُولَٰئِكَ مَا يَأْكُلُونَ فِي بُطُونِهِمْ إِلَّا النَّارَ", "tafsir": "وعيد من يخفون الحق لأجل الدنيا؛ فإن ما يجمعونه هو نار تحرقهم.", "irab": "أنزل الله: صلة الموصول، ثمناً: مفعول به، النار: مفعول به." },
    { "id": 175, "text": "أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ وَالْعَذَابَ بِالْمَغْفِرَةِ ۚ فَمَا أَصْبَرَهُمْ عَلَى النَّارِ", "tafsir": "هؤلاء استبدلوا الهداية بالضلال والمغفرة بالعذاب، فما أجرأهم على فعل ما يدخلهم النار.", "irab": "اشتروا: فعل وفاعل، الضلالة: مفعول به، ما أصبرهم: فعل تعجب." },
    { "id": 176, "text": "ذَٰلِكَ بِأَنَّ اللَّهَ نَزَّلَ الْكِتَابَ بِالْحَقِّ ۗ وَإِنَّ الَّذِينَ اخْتَلَفُوا فِي الْكِتَابِ لَفِي شِقَاقٍ بَعِيدٍ", "tafsir": "الله أنزل القرآن ثابتاً بالحق، ومن جادوا فيه هم في نزاع عميق.", "irab": "نزل: فعل، الكتاب: مفعول به، الذين: اسم إن." },
    { "id": 177, "text": "۞ لَّيْسَ الْبِرَّ أَن تُوَلُّوا وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَٰكِنَّ الْبِرَّ مَنْ آمَنَ بِاللَّهِ", "tafsir": "البر الحقيقي ليس مجرد المظاهر بل الإيمان الصادق والعمل الصالح والعطاء والوفاء والصبر.", "irab": "ليس: فعل ناقص، البر: اسمها، وجوهكم: مفعول به." },
    { "id": 178, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ القِصَاصُ فِي الْقَتْلَى ۖ الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ", "tafsir": "فرض العدل في القصاص بين الناس، مع الترغيب في العفو والتسامح.", "irab": "كتب: مبني للمجهول، القصاص: نائب فاعل، القتلى: اسم مجرور." },
    { "id": 179, "text": "وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ يَا أُولِي الْأَلْبَابِ لَعَلَّكُمْ تَتَّقُونَ", "tafsir": "في تطبيق شرع الله وحكم القصاص حفظ لأرواح الناس ومنع للقتل.", "irab": "لكم: خبر مقدم، حياة: مبتدأ مؤخر، يا أولي: نداء." },
    { "id": 180, "text": "كُتِبَ عَلَيْكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ إِن تَرَكَ خَيْرًا الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالْأَقْرَبِينَ", "tafsir": "مشروعية الوصية بالمال للأهل عند الموت بالمعروف.", "irab": "الموت: فاعل، الوصية: نائب فاعل، للوالدين: جار ومجرور." }
    { "id": 181, "text": "فَمَن بَدَّلَهُ بَعْدَمَا سَمِعَهُ فَإِنَّمَا إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ", "tafsir": "الإثم يقع على من يغير الوصية بعد علمها، والله مطلع على فعلهم.", "irab": "من: اسم شرط مبتدأ، إثمه: مبتدأ ثانٍ، الله: اسم إن." },
    { "id": 182, "text": "فَمَنْ خَافَ مِن مُّوصٍ جَنَفًا أَوْ إِثْمًا فَأَصْلَحَ بَيْنَهُمْ فَلَا إِثْمَ عَلَيْهِ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "جواز التدخل للإصلاح إذا كانت الوصية فيها ميل عن الحق أو ظلم.", "irab": "خاف: فعل ماض، جنفاً: مفعول به، إثم: اسم لا النافية." },
    { "id": 183, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ", "tafsir": "فرض الصيام على المؤمنين كما فُرض على الأمم السابقة لتحقيق التقوى.", "irab": "كتب: فعل مبني للمجهول، الصيام: نائب فاعل، لعلكم: لعل واسمها." },
    { "id": 184, "text": "أَيَّامًا مَّعْدُودَاتٍ ۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ عَلَىٰ سَفَرٍ فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ", "tafsir": "أحكام الرخصة في الإفطار للمريض والمسافر ووجوب القضاء.", "irab": "أياماً: ظرف زمان، مريضاً: اسم كان، فعدة: مبتدأ لخبر محذوف." },
    { "id": 185, "text": "شَهْرُ رَمَضَانَ الَّذِي أُنزِلَ فِيهِ الْقُرْآنُ هُدًى لِّلنَّاسِ وَبَيِّنَاتٍ مِّنَ الْهُدَىٰ وَالْفُرْقَانِ", "tafsir": "فضل شهر رمضان بنزول القرآن، والأمر بصيامه وإكمال العدة.", "irab": "شهر: مبتدأ، الذي: نعت، القرآن: نائب فاعل، هدى: حال." },
    { "id": 186, "text": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ", "tafsir": "بشارة بقرب الله من عباده واستجابته لدعائهم، وحثهم على الاستجابة له.", "irab": "إني: إن واسمها، قريب: خبر إن، أجيب: فعل مضارع." },
    { "id": 187, "text": "أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَىٰ نِسَائِكُمْ ۚ هُنَّ لِبَاسٌ لَّكُمْ وَأَنتُمْ لِبَاسٌ لَّهُنَّ", "tafsir": "إباحة الجماع والأكل والشرب في ليالي رمضان حتى طلوع الفجر.", "irab": "أحل: فعل مبني للمجهول، الرفث: نائب فاعل، هن: مبتدأ." },
    { "id": 188, "text": "وَلَا تَأْكُلُوا أَمْوَالَكُم بَيْنَكُم بِالْبَاطِلِ وَتُدْلُوا بِهَا إِلَى الْحُكَّامِ لِتَأْكُلُوا فَرِيقًا مِّنْ أَمْوَالِ النَّاسِ", "tafsir": "النهي عن أكل أموال الناس بالظلم أو الرشوة أو الخصومات الباطلة.", "irab": "لا: ناهية، تأكلوا: مضارع مجزوم، أموالكم: مفعول به." },
    { "id": 189, "text": "يَسْأَلُونَكَ عَنِ الْأَهِلَّةِ ۖ قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ وَالْحَجِّ ۗ وَلَيْسَ الْبِرُّ بِأَن تَأْتُوا الْبُيُوتَ مِن ظُهُورِهَا", "tafsir": "الحكمة من الأهلة لمعرفة الزمن، وتصحيح مفاهيم خاطئة عن البر.", "irab": "الأهلة: اسم مجرور، هي: مبتدأ، مواقيت: خبر، البيوت: مفعول به." },
    { "id": 190, "text": "وَقَاتِلُوا فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ وَلَا تَعْتَدُوا ۚ إِنَّ اللَّهَ لَا يُحِبُّ الْمُعْتَدِينَ", "tafsir": "الأمر بقتال المعتدين في سبيل الله والنهي عن تجاوز الحدود والظلم.", "irab": "قاتلوا: فعل أمر، الذين: مفعول به، المعتدين: مفعول به." },
    { "id": 191, "text": "وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأَخْرِجُوهُم مِّنْ حَيْثُ أَخْرَجُوكُمْ ۚ وَالْفِتْنَةُ أَشَدُّ مِنَ الْقَتْلِ", "tafsir": "مشروعية الدفاع عن النفس ومقابلة الاعتداء بمثله، وتأكيد خطر الفتنة.", "irab": "اقتلوهم: فعل وأمر ومفعول به، الفتنة: مبتدأ، أشد: خبر." },
    { "id": 192, "text": "فَإِنِ انتَهَوْا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "إذا توقف الكفار عن قتالكم وعادوا للحق، فإن الله يقبل توبتهم.", "irab": "إن: شرطية، انتهوا: فعل الشرط، الله: اسم إن، غفور: خبرها." },
    { "id": 193, "text": "وَقَاتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ لِلَّهِ ۖ فَإِنِ انتَهَوْا فَلَا عُدْوَانَ إِلَّا عَلَى الظَّالِمِينَ", "tafsir": "القتال لمنع الفتنة وإقامة الدين، والعدل في الكف عمن انتهى.", "irab": "تكون: فعل مضارع، فتنة: فاعل، عدوان: اسم لا." },
    { "id": 194, "text": "الشَّهْرُ الْحَرَامُ بِالشَّهْرِ الْحَرَامِ وَالْحُرُمَاتُ قِصَاصٌ ۚ فَمَنِ اعْتَدَىٰ عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ مَا اعْتَدَىٰ عَلَيْكُمْ", "tafsir": "مقابلة الاعتداء بالمثل حتى في الأشهر الحرم، مع الأمر بتقوى الله.", "irab": "الشهر: مبتدأ، الحرام: نعت، فمن: اسم شرط مبتدأ." },
    { "id": 195, "text": "وَأَنفِقُوا فِي سَبِيلِ اللَّهِ وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ ۛ وَأَحْسِنُوا ۛ إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ", "tafsir": "حث على الإنفاق في سبيل الله والتحذير من ترك الجهاد والنفقة، والأمر بالإحسان.", "irab": "أنفقوا: فعل أمر، بأيديكم: جار ومجرور، المحسنين: مفعول به." },
    { "id": 196, "text": "وَأَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلَّهِ ۚ فَإِنْ أُحْصِرْتُمْ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ", "tafsir": "أحكام إتمام الحج والعمرة، وفدية من منع من الإكمال.", "irab": "أتموا: فعل أمر، الحج: مفعول به، الهدي: اسم مجرور." },
    { "id": 197, "text": "الْحَجُّ أَشْهُرٌ مَّعْلُومَاتٌ ۚ فَمَن فَرَضَ فِيهِنَّ الْحَجَّ فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِي الْحَجِّ", "tafsir": "بيان وقت الحج وآدابه بترك اللغو والخصام والمعاصي.", "irab": "الحج: مبتدأ، أشهر: خبر، لا: نافية للجنس." },
    { "id": 198, "text": "لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُوا فَضْلًا مِّن رَّبِّكُمْ ۚ فَإِذَا أَفَضْتُم مِّنْ عَرَفَاتٍ فَاذْكُرُوا اللَّهَ عِندَ الْمَشْعَرِ الْحَرَامِ", "tafsir": "إباحة التجارة في الحج، والأمر بذكر الله عند الانصراف من عرفات.", "irab": "جناح: اسم ليس مؤخر، عرفات: اسم مجرور." },
    { "id": 199, "text": "ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ وَاسْتَغْفِرُوا اللَّهَ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "الأمر بالانصراف مع الناس وطلب المغفرة من الله.", "irab": "أفيضوا: فعل أمر، الناس: فاعل، الله: مفعول به." },
    { "id": 200, "text": "فَإِذَا قَضَيْتُم مَّنَاسِكَكُمْ فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدَّ ذِكْرًا", "tafsir": "حث الحجاج على كثرة ذكر الله بعد تمام الحج بدلاً من التفاخر بالآباء.", "irab": "قضيتم: فعل وفاعل، مناسككم: مفعول به، ذكراً: تمييز." 
      { "id": 201, "text": "وَمِنْهُم مَّن يَقُولُ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ", "tafsir": "دعاء المؤمنين الجامع لخيري الدنيا والآخرة والوقاية من عذاب جهنم.", "irab": "آتنا: فعل دعاء ومفعول به، حسنة: مفعول ثانٍ، النار: مضاف إليه." },
    { "id": 202, "text": "أُولَٰئِكَ لَهُمْ نَصِيبٌ مِّمَّا كَسَبُوا ۚ وَاللَّهُ سَرِيعُ الْحِسَابِ", "tafsir": "هؤلاء لهم ثواب عظيم عند الله جزاء ما عملوا من خير وصالحات.", "irab": "أولئك: مبتدأ، نصيب: مبتدأ ثانٍ مؤخر، الله: مبتدأ، سريع: خبر." },
    { "id": 203, "text": "۞ وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَّعْدُودَاتٍ ۚ فَمَن تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ", "tafsir": "الأمر بذكر الله في أيام التشريق بمنا، وأحكام التعجل والتأخر للمحرم.", "irab": "اذكروا: فعل أمر، أيام: اسم مجرور، من: اسم شرط مبتدأ." },
    { "id": 204, "text": "وَمِنَ النَّاسِ مَن يُعْجِبُكَ قَوْلُهُ فِي الْحَيَاةِ الدُّنْيَا وَيُشْهِدُ اللَّهَ عَلَىٰ مَا فِي قَلْبِهِ", "tafsir": "صفة المنافق الذي يحسن كلامه ويخفي شره وعداءه للإسلام.", "irab": "يعجبك: فعل ومفعول به، قوله: فاعل، الله: مفعول به." },
    { "id": 205, "text": "وَإِذَا تَوَلَّىٰ سَعَىٰ فِي الْأَرْضِ لِيُفْسِدَ فِيهَا وَيُهْلِكَ الْحَرْثَ وَالنَّسْلَ", "tafsir": "المنافق إذا تمكن في الأرض أفسد فيها بالظلم وتخريب معايش الناس.", "irab": "تولى: فعل ماض، يفسد: مضارع منصوب، الحرث: مفعول به." },
    { "id": 206, "text": "وَإِذَا قِيلَ لَهُ اتَّقِ اللَّهَ أَخَذَتْهُ الْعِزَّةُ بِالْإِثْمِ ۚ فَحَسْبُهُ جَهَنَّمُ ۚ وَلَبِئْسَ الْمِهَادُ", "tafsir": "كبر المنافق ورفضه للنصيحة، وجزاؤه نار جهنم وبئس المستقر.", "irab": "اتق: فعل أمر، الله: مفعول به، جهنم: فاعل حسبه، المهاد: فاعل بئس." },
    { "id": 207, "text": "وَمِنَ النَّاسِ مَن يَشْرِي نَفْسَهُ ابْتِغَاءَ مَرْضَاتِ اللَّهِ ۗ وَاللَّهُ رَءُوفٌ بِالْعِبَادِ", "tafsir": "صفة المؤمن الصادق الذي يبيع نفسه لله طلباً لرضاه، والله رحيم بخلقه.", "irab": "من الناس: خبر مقدم، من: مبتدأ مؤخر، ابتغاء: مفعول لأجله." },
    { "id": 208, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا ادْخُلُوا فِي السِّلْمِ كَافَّةً وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ", "tafsir": "الأمر بالدخول في جميع أحكام الإسلام والتحذير من مكايد الشيطان.", "irab": "الذين: نداء، ادخلوا: فعل أمر، كافة: حال، لا: ناهية." },
    { "id": 209, "text": "فَإِن زَلَلْتُم مِّن بَعْدِ مَا جَاءَتْكُمُ الْبَيِّنَاتُ فَاعْلَمُوا أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ", "tafsir": "التحذير من الانحراف عن الحق بعد معرفته، فالله غالب ومنتقم وحكيم.", "irab": "زللتم: فعل وفاعل، الله: اسم أن، عزيز: خبر أن." },
    { "id": 210, "text": "هَلْ يَنظُرُونَ إِلَّا أَن يَأْتِيَهُمُ اللَّهُ فِي ظُلَلٍ مِّنَ الْغَمَامِ وَالْمَلَائِكَةُ", "tafsير": "تهديد الكفار بانتظار يوم القيامة وأهواله وفصل القضاء بينهم.", "irab": "ينظرون: مضارع مرفوع بثبوت النون، الله: فاعل يأتيهم." },
    { "id": 211, "text": "سَلْ بَنِي إِسْرَائِيلَ كَمْ آتَيْنَاهُم مِّنْ آيَةٍ بَيِّنَةٍ ۗ وَمَن يُبَدِّلْ نِعْمَةَ اللَّهِ مِن بَعْدِ مَا جَاءَتْهُ", "tafsir": "سؤال بني إسرائيل عن المعجزات التي رأوها وعقوبة من جحد نعم الله.", "irab": "سل: فعل أمر، بني: مفعول به، من: اسم شرط، نعمة: مفعول به." },
    { "id": 212, "text": "زُيِّنَ لِلَّذِينَ كَفَرُوا الْحَيَاةُ الدُّنْيَا وَيَسْخَرُونَ مِنَ الَّذِينَ آمَنُوا", "tafsir": "افتتان الكفار بالدنيا وسخريتهم من المؤمنين، والمؤمنون فوقهم يوم القيامة.", "irab": "زين: فعل مبني للمجهول، الحياة: نائب فاعل، الدنيا: نعت." },
    { "id": 213, "text": "كَانَ النَّاسُ أُمَّةً وَاحِدَةً فَبَعَثَ اللَّهُ النَّبِيِّينَ مُبَشِّرِينَ وَمُنذِرِينَ", "tafsir": "أصل الناس التوحيد، ثم اختلفوا فأرسل الله الرسل لبيان الحق.", "irab": "الناس: اسم كان، أمة: خبر كان، مبشرين: حال منصوب بالياء." },
    { "id": 214, "text": "أَمْ حَسِبْتُمْ أَن تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ الَّذِينَ خَلَوْا مِن قَبْلِكُم", "tafsir": "تنبيه المؤمنين أن طريق الجنة محفوف بالابتلاءات كما حدث للسابقين.", "irab": "تدخلوا: مضارع منصوب، الجنة: مفعول به، الذين: مضاف إليه." },
    { "id": 215, "text": "يَسْأَلُونَكَ مَاذَا يُنفِقُونَ ۖ قُلْ مَا أَنفَقْتُم مِّنْ خَيْرٍ فَلِلْوَالِدَيْنِ وَالْأَقْرَبِينَ", "tafsir": "بيان مصارف النفقة المستحبة: الوالدان والأقربون واليتامى والمساكين.", "irab": "ماذا: اسم استفهام، أنفقتم: فعل وفاعل، للوالدين: جار ومجرور." },
    { "id": 216, "text": "كُتِبَ عَلَيْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَّكُمْ ۖ وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ", "tafsir": "فرض الجهاد والحكمة في أن الله يعلم عواقب الأمور وأنتم لا تعلمون.", "irab": "كتب: فعل، القتال: نائب فاعل، خير: خبر المبتدأ (هو)." },
    { "id": 217, "text": "يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيهِ ۖ قُلْ قِتَالٌ فِيهِ كَبِيرٌ", "tafsir": "حكم القتال في الأشهر الحرم، وتوضيح أن الصد عن سبيل الله أعظم إثماً.", "irab": "الشهر: اسم مجرور، قتال: خبر، كبير: نعت مرفوع." },
    { "id": 218, "text": "إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ أُولَٰئِكَ يَرْجُونَ رَحْمَتَ اللَّهِ", "tafsir": "بشارة للمهاجرين والمجاهدين بأنهم يستحقون رحمة الله ومغفرته.", "irab": "الذين: اسم إن، أولئك: مبتدأ، يرجون: فعل مضارع خبر." },
    { "id": 219, "text": "يَسْأَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ ۖ قُلْ فِيهِمَا إِثْمٌ كَبِيرٌ وَمَنَافِعُ لِلنَّاسِ", "tafsir": "بداية تحريم الخمر والقمار ببيان ضررهما الأكبر من نفعهما.", "irab": "إثم: مبتدأ مؤخر، كبير: نعت، الناس: اسم مجرور." },
    { "id": 220, "text": "فِي الدُّنْيَا وَالْآخِرَةِ ۗ وَيَسْأَلُونَكَ عَنِ الْيَتَامَىٰ ۖ قُلْ إِصْلَاحٌ لَّهُمْ خَيْرٌ", "tafsir": "حث على رعاية اليتامى وإصلاح شؤونهم والتعاون معهم كإخوة في الدين.", "irab": "إصلاح: مبتدأ، خير: خبر، اليتامى: اسم مجرور." }   
     { "id": 221, "text": "وَلَا تَنكِحُوا الْمُشْرِكَاتِ حَتَّىٰ يُؤْمِنَّ ۚ وَلَأَمَةٌ مُّؤْمِنَةٌ خَيْرٌ مِّن مُّشْرِكَةٍ", "tafsir": "النهي عن زواج المشركات حتى يسلمن، وتفضيل المؤمنة وإن كانت أمة على المشركة.", "irab": "لا: ناهية، تنكحوا: مضارع مجزوم، أمة: مبتدأ، خير: خبر." },
    { "id": 222, "text": "وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ ۖ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ", "tafsir": "أحكام الطهارة من الحيض والنهي عن جماع النساء حتى يطهرن.", "irab": "أذى: خبر، اعتزلوا: فعل أمر، النساء: مفعول به." },
    { "id": 223, "text": "نِسَاؤُكُمْ حَرْثٌ لَّكُمْ فَأْتُوا حَرْثَكُمْ أَنَّىٰ شِئْتُمْ ۖ وَقَدِّمُوا لِأَنفُسِكُمْ", "tafsir": "إباحة الاستمتاع بالزوجة في القبل بأي هيئة، والحث على ذكر الله عند الوقاع.", "irab": "نساؤكم: مبتدأ، حرث: خبر، قدموا: فعل أمر." },
    { "id": 224, "text": "وَلَا تَجْعَلُوا اللَّهَ عُرْضَةً لِّأَيْمَانِكُمْ أَن تَبَرُّوا وَتَتَّقُوا", "tafsir": "النهي عن جعل الحلف بالله مانعاً من فعل الخير والإصلاح بين الناس.", "irab": "لا: ناهية، الله: مفعول به أول، عرضة: مفعول به ثانٍ." },
    { "id": 225, "text": "لَّا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَٰكِن يُؤَاخِذُكُم بِمَا كَسَبَتْ قُلُوبُكُمْ", "tafsir": "الله لا يحاسب على اليمين التي تجري على اللسان بغير قصد، بل على ما قُصد بالقلب.", "irab": "الله: فاعل، اللغو: اسم مجرور، قلوبكم: فاعل." },
    { "id": 226, "text": "لِّلَّذِينَ يُؤْلُونَ مِن نِّسَائِهِمْ تَرَبُّصُ أَرْبَعَةِ أَشْهُرٍ ۖ فَإِن فَاءُوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "أحكام الإيلاء (الحلف على ترك الجماع) وإمهال الحالف أربعة أشهر.", "irab": "تربص: مبتدأ مؤخر، أشهر: مضاف إليه، الله: اسم إن." },
    { "id": 227, "text": "وَإِنْ عَزَمُوا الطَّلَاقَ فَإِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ", "tafsir": "إذا اختار الزوج الطلاق بعد انتهاء المدة، فالله سميع لقوله عليم بنيته.", "irab": "إن: شرطية، عزموا: فعل الشرط، سميع: خبر إن." },
    { "id": 228, "text": "وَالْمُطَلَّقَاتُ يَتَرَبَّصْنَ بِأَنفُسِهِنَّ ثَلَاثَةَ قُرُوءٍ ۚ وَلَا يَحِلُّ لَهُنَّ أَن يَكْتُمْنَ", "tafsir": "عدة المطلقة هي ثلاث حيضات، والنهي عن إخفاء الحمل أو الحيض.", "irab": "المطلقات: مبتدأ، يتربصن: جملة الخبر، قروء: مضاف إليه." },
    { "id": 229, "text": "الطَّلَاقُ مَرَّتَانِ ۖ فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ", "tafsir": "الطلاق الذي يحق فيه الرجعة مرتان، وبعدهما إما رجعة بالمعروف أو طلاق نهائي.", "irab": "الطلاق: مبتدأ، مرتان: خبر مرفوع بالألف، إمساك: مبتدأ لخبر محذوف." },
    { "id": 230, "text": "فَإِن طَلَّقَهَا فَلَا تَحِلُّ لَهُ مِن بَعْدُ حَتَّىٰ تَنكِحَ زَوْجًا غَيْرَهُ", "tafsir": "إذا طلقها الثالثة فلا تحل له حتى تتزوج غيره زواجاً شرعياً ثم يفارقها.", "irab": "طلقها: فعل وفاعل ومفعول، تحل: مضارع مرفوع، زوجاً: مفعول به." },
    { "id": 231, "text": "وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ سَرِّحُوهُنَّ بِمَعْرُوفٍ", "tafsir": "الأمر بحسن المعاملة عند الرجعة أو الفراق، والنهي عن المضارة في النكاح.", "irab": "أمسكوهن: فعل أمر، معروف: اسم مجرور، حدود الله: مفعول به." },
    { "id": 232, "text": "وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلَا تَعْضُلُوهُنَّ أَن يَنكِحْنَ أَزْوَاجَهُنَّ", "tafsir": "النهي عن منع المطلقة من العودة لزوجها الأول إذا تراضيا بالمعروف.", "irab": "لا: ناهية، تعضلوهن: مضارع مجزوم، أزواجهن: مفعول به." },
    { "id": 233, "text": "وَالْوَالِدَاتُ يُرْضِعْنَ أَوْلَادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ ۖ لِمَنْ أَرَادَ أَن يُتِمَّ الرَّضَاعَةَ", "tafsir": "مدة الرضاعة الكاملة سنتان، وبيان أحكام نفقة المرضعة وتشاور الأبوين.", "irab": "الوالدات: مبتدأ، يرضعن: جملة الخبر، حولين: ظرف زمان منصوب بالياء." },
    { "id": 234, "text": "وَالَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَاجًا يَتَرَبَّصْنَ بِأَنفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا", "tafsir": "عدة المرأة المتوفى عنها زوجها هي أربعة أشهر وعشرة أيام.", "irab": "الذين: مبتدأ، يذرون: فعل، أزواجاً: مفعول به، عشراً: معطوف." },
    { "id": 235, "text": "وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُم بِهِ مِنْ خِطْبَةِ النِّسَاءِ أَوْ أَكْنَنتُمْ فِي أَنفُسِكُمْ", "tafsir": "جواز التلميح بخطبة المعتدة دون التصريح، والنهي عن عقد النكاح حتى تنتهي العدة.", "irab": "جناح: اسم لا، خطبة: مضاف إليه، الصدور: مضاف إليه." },
    { "id": 236, "text": "لَّا جُنَاحَ عَلَيْكُمْ إِن طَلَّقْتُمُ النِّسَاءَ مَا لَمْ تَمَسُّوهُنَّ أَوْ تَفْرِضُوا لَهُنَّ فَرِيضَةً", "tafsir": "جواز الطلاق قبل المساس أو تحديد المهر، ووجوب المتعة للمطلقة حينها.", "irab": "تمسوهن: مضارع مجزوم، فريضة: مفعول به، الموسع: اسم مجرور." },
    { "id": 237, "text": "وَإِن طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ وَقَدْ فَرَضْتُمْ لَهُنَّ فَرِيضَةً فَنِصْفُ مَا فَرَضْتُمْ", "tafsir": "إذا وقع الطلاق قبل المساس وكان المهر محدداً، فللمرأة نصف المهر إلا أن تعفو.", "irab": "نصف: مبتدأ، ما: مضاف إليه، الصلاة: مضاف إليه." },
    { "id": 238, "text": "حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَىٰ وَقُومُوا لِلَّهِ قَانِتِينَ", "tafsir": "الأمر بالمحافظة على جميع الصلوات وخص الصلاة الوسطى (العصر)، والخشوع فيها.", "irab": "حافظوا: فعل أمر، الصلوات: اسم مجرور، الوسطى: نعت، قانتين: حال." },
    { "id": 239, "text": "فَإِنْ خِفْتُمْ فَرِجَالًا أَوْ رُكْبَانًا ۖ فَإِذَا أَمِنتُمْ فَاذْكُرُوا اللَّهَ", "tafsir": "جواز صلاة الخوف مشاة أو ركباناً عند الضرورة، والعودة للصلاة الطبيعية عند الأمن.", "irab": "خفتم: فعل وفاعل، رجالاً: حال، اذكروا: فعل أمر." },
    { "id": 240, "text": "وَالَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لِّأَزْوَاجِهِم مَّتَاعًا إِلَى الْحَوْلِ", "tafsir": "كانت الوصية قديماً للمتوفى عنها زوجها بالسكن والنفقة حولاً كاملاً قبل نسخها.", "irab": "وصية: مفعول مطلق، الحول: اسم مجرور، معروف: اسم مجرور." }
    { "id": 241, "text": "وَلِلْمُطَلَّقَاتِ مَتَاعٌ بِالْمَعْرُوفِ ۖ حَقًّا عَلَى الْمُتَّقِينَ", "tafsir": "وجوب إعطاء المطلقة مبلغاً من المال (متعة) يجبر خاطرها ويكون بالمعروف.", "irab": "للمطلقات: خبر مقدم، متاع: مبتدأ مؤخر، حقاً: مفعول مطلق." },
    { "id": 242, "text": "كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَعْقِلُونَ", "tafsir": "هذا البيان الواضح لأحكام الأسرة من الله لكي تفهموا وتعملوا بها.", "irab": "يبين: فعل، الله: فاعل، آياته: مفعول به، لعلكم: لعل واسمها." },
    { "id": 243, "text": "۞ أَلَمْ تَرَ إِلَى الَّذِينَ خَرَجُوا مِن دِيَارِهِمْ وَهُمْ أُلُوفٌ حَذَرَ الْمَوْتِ", "tafsir": "قصة قوم فروا من الموت فأماتهم الله ثم أحياهم ليعلموا أن الحذر لا ينجي من القدر.", "irab": "ألم: الهمزة للاستفهام ولم جازمة، الذين: اسم مجرور، وهم ألوف: جملة حالية." },
    { "id": 244, "text": "وَقَاتِلُوا فِي سَبِيلِ اللَّهِ وَاعْلَمُوا أَنَّ اللَّهَ سَمِيعٌ عَلِيمٌ", "tafsir": "الأمر بالجهاد في سبيل الله وتذكير بعلم الله بكل شيء.", "irab": "قاتلوا: فعل أمر، الله: اسم أن، سميع: خبر أن." },
    { "id": 245, "text": "مَّن ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ أَضْعَافًا كَثِيرَةً", "tafsir": "حث على الإنفاق في سبيل الله ووعد بمضاعفة الأجر أضعافاً كثيرة.", "irab": "من: مبتدأ، يقرض: صلة الموصول، قرضاً: مفعول مطلق، فيضاعفه: منصوب بالسببية." },
    { "id": 246, "text": "أَلَمْ تَرَ إِلَى الْمَلَإِ مِن بَنِي إِسْرَائِيلَ مِن بَعْدِ مُوسَىٰ إِذْ قَالُوا لِنَبِيٍّ لَّهُمُ ابْعَثْ لَنَا مَلِكًا", "tafsir": "طلب بني إسرائيل من نبيهم تعيين ملك ليقاتلوا معه، واختبار الله لصدقهم.", "irab": "الملأ: اسم مجرور، ابعث: فعل أمر، ملكاً: مفعول به." },
    { "id": 247, "text": "وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ اللَّهَ قَدْ بَعَثَ لَكُمْ طَالُوتَ مَلِكًا", "tafsir": "اختيار طالوت ملكاً عليهم لزيادة علمه وقوة جسمه رغم قلة ماله.", "irab": "نبيهم: فاعل، طالوت: مفعول به أول، ملكاً: حال أو مفعول ثانٍ." },
    { "id": 248, "text": "وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ آيَةَ مُلْكِهِ أَن يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِّن رَّبِّكُمْ", "tafsir": "علامة صدق ملك طالوت هي عودة التابوت الذي سلب منهم تحمله الملائكة.", "irab": "آية: اسم إن، التابوت: فاعل يأتيك، فيه سكينة: جملة حالية." },
    { "id": 249, "text": "فَلَمَّا فَصَلَ طَالُوتُ بِالْجُنُودِ قَالَ إِنَّ اللَّهَ مُبْتَلِيكُم بِنَهَرٍ", "tafsir": "اختبار الجيش بالنهي عن الشرب من النهر إلا غرفة واحدة لفرز الصابرين.", "irab": "طالوت: فاعل، الله: اسم إن، مبتليكم: خبر إن، بنهر: جار ومجرور." },
    { "id": 250, "text": "وَلَمَّا بَرَزُوا لِجَالُوتَ وَجُنُودِهِ قَالُوا رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا", "tafsir": "دعاء المؤمنين عند مواجهة العدو بالصبر والثبات والنصر.", "irab": "برزوا: فعل وفاعل، جالوت: اسم مجرور، صبراً: مفعول به." },
    { "id": 251, "text": "فَهَزَمُوهُم بِإِذْنِ اللَّهِ وَقَتَلَ دَاوُودُ جَالُوتَ وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ", "tafsir": "نصر القلة المؤمنة وقتل داود لملك الكفر جالوت، وبيان سنة التدافع.", "irab": "هزموهم: فعل وفاعل ومفعول، داوود: فاعل، جالوت: مفعول به." },
    { "id": 252, "text": "تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۚ وَإِنَّكَ لَمِنَ الْمُرْسَلِينَ", "tafsir": "هذه القصص هي وحي الله الصادق للنبي ﷺ وتأكيد لنبوته.", "irab": "تلك: مبتدأ، آيات: خبر، نتلوها: جملة حالية، إنك: إن واسمها." },
    { "id": 253, "text": "تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۘ مِّنْهُم مَّن كَلَّمَ اللَّهُ", "tafsir": "تفاضل الرسل في الدرجات والمهام، ووقوع الاختلاف بين الناس بعدهم.", "irab": "تلك: مبتدأ، الرسل: بدل، فضلنا: جملة الخبر، الله: فاعل كلم." },
    { "id": 254, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَنفِقُوا مِمَّا رَزَقْنَاكُم مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ لَّا بَيْعٌ فِيهِ", "tafsir": "الحث على الصدقة قبل يوم القيامة حيث لا تنفع تجارة ولا شفاعة إلا بإذن الله.", "irab": "أنفقوا: فعل أمر، يوم: فاعل يأت، بيع: مبتدأ." },
    { "id": 255, "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ", "tafsir": "آية الكرسي: أعظم آية في القرآن تصف عظمة الله وقدرته وإحاطته بكل شيء.", "irab": "الله: مبتدأ، لا إله إلا هو: جملة الخبر، الحي: خبر ثانٍ، سنة: فاعل." },
    { "id": 256, "text": "لَا إِكْرَاهَ فِي الدِّينِ ۖ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَن يَكْفُرْ بِالطَّاغُوتِ", "tafsir": "حرية الدين لوضوح الحق، ومن تمسك بالعروة الوثقى (التوحيد) فقد نجا.", "irab": "إكراه: اسم لا، الرشد: فاعل، من: اسم شرط مبتدأ." },
    { "id": 257, "text": "اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُم مِّنَ الظُّلُمَاتِ إِلَى النُّورِ", "tafsir": "الله ناصر المؤمنين وهاديهم، والكفار أولياؤهم الشياطين يضلونهم.", "irab": "الله: مبتدأ، ولي: خبر، الذين: مضاف إليه، يخرجهم: جملة الخبر الثاني." },
    { "id": 258, "text": "أَلَمْ تَرَ إِلَى الَّذِي حَاجَّ إِبْرَاهِيمَ فِي رَبِّهِ أَنْ آتَاهُ اللَّهُ الْمُلْكَ", "tafsir": "قصة النمرود ومجادلته لإبراهيم في الخالق، فبهت الكافر أمام حجة إبراهيم.", "irab": "الذي: اسم مجرور، إبراهيم: مفعول به، الله: فاعل آتى، فبهت الكافر: فعل وفاعل." },
    { "id": 259, "text": "أَوْ كَالَّذِي مَرَّ عَلَىٰ قَرْيَةٍ وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحْيِي هَٰذِهِ اللَّهُ", "tafsir": "قصة عزير الذي أماته الله مائة عام ثم أحياه ليريه قدرته على البعث.", "irab": "قرية: اسم مجرور، خاوية: خبر للمبتدأ (هي)، مائة عام: ظرف زمان." },
    { "id": 260, "text": "وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَىٰ ۖ قَالَ أَوَلَمْ تُؤْمِن ۖ قَالَ بَلَىٰ", "tafsir": "طلب إبراهيم رؤية كيفية الإحياء ليطمئن قلبه، ومعجزة الطيور الأربعة.", "irab": "أرني: فعل دعاء ومفعول به، الموتى: مفعول به، طيراً: مفعول به." }
    { "id": 261, "text": "مَّثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ", "tafsir": "مضاعفة أجر الإنفاق في سبيل الله من سبعمائة ضعف إلى ما يشاء الله.", "irab": "مثل: مبتدأ، الذين: مضاف إليه، سبع: مفعول به، سنابل: مضاف إليه." },
    { "id": 262, "text": "الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ ثُمَّ لَا يُتْبِعُونَ مَا أَنفَقُوا مَنًّا وَلَا أَذًى", "tafsir": "شرط قبول الصدقة هو الإخلاص وعدم التفاخر بها أو إيذاء الفقير.", "irab": "الذين: مبتدأ، أموالهم: مفعول به، منّاً: مفعول به ثانٍ أو حال." },
    { "id": 263, "text": "قَوْلٌ مَّعْرُوفٌ وَمَغْفِرَةٌ خَيْرٌ مِّن صَدَقَةٍ يَتْبَعُهَا أَذًى ۗ وَاللَّهُ غَنِيٌّ حَلِيمٌ", "tafsir": "الكلمة الطيبة والصفح خير عند الله من صدقة يصاحبها تجريح.", "irab": "قول: مبتدأ، معروف: نعت، خير: خبر، الله: مبتدأ." },
    { "id": 264, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُبْطِلُوا صَدَقَاتِكُم بِالْمَنِّ وَالْأَذَىٰ كَالَّذِي يُنفِقُ مَالَهُ رِئَاءَ النَّاسِ", "tafsir": "التحذير من إبطال أجر الصدقة بالرياء والمنّ، فذلك كمن يزرع فوق صخر صلد.", "irab": "لا: ناهية، تبطلوا: مضارع مجزوم، رئاء: مفعول لأجله، الناس: مضاف إليه." },
    { "id": 265, "text": "وَمَثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمُ ابْتِغَاءَ مَرْضَاتِ اللَّهِ وَتَثْبِيتًا مِّنْ أَنفُسِهِمْ كَمَثَلِ جَنَّةٍ بِرَبْوَةٍ", "tafsir": "مثل المنفق المخلص كمثل بستان عالٍ مثمر يضاعف إنتاجه مهما كانت الظروف.", "irab": "ابتغاء: مفعول لأجله، جنة: اسم مجرور، ربوة: اسم مجرور." },
    { "id": 266, "text": "أَيَوَدُّ أَحَدُكُمْ أَن تَكُونَ لَهُ جَنَّةٌ مِّن نَّخِيلٍ وَأَعْنَابٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ", "tafsir": "مثل من ينفق رئاءً كمن ضاع بستانه في وقت شدة حاجته إليه وهو كبير في السن.", "irab": "جنة: اسم تكون مؤخر، الأنهار: فاعل، أعصار: فاعل." },
    { "id": 267, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَنفِقُوا مِن طَيِّبَاتِ مَا كَسَبْتُمْ وَمِمَّا أَخْرَجْنَا لَكُم مِّنَ الْأَرْضِ", "tafsir": "الأمر بالإنفاق من الرزق الطيب الحلال والابتعاد عن الرديء من المال.", "irab": "أنفقوا: فعل أمر، طيبات: اسم مجرور، الأرض: اسم مجرور." },
    { "id": 268, "text": "الشَّيْطَانُ يَعِدُكُمُ الْفَقْرَ وَيَأْمُرُكُم بِالْفَحْشَاءِ ۖ وَاللَّهُ يَعِدُكُم مَّغْفِرَةً مِّنْهُ وَفَضْلًا", "tafsir": "الشيطان يخوفكم من الفقر ليمنعكم من الصدقة، والله يعدكم بالخلف والرزق.", "irab": "الشيطان: مبتدأ، الفقر: مفعول به ثانٍ، الله: مبتدأ، مغفرة: مفعول به ثانٍ." },
    { "id": 269, "text": "يُؤْتِي الْحِكْمَةَ مَن يَشَاءُ ۚ وَمَن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا", "tafsir": "الحكمة هي العلم النافع والعمل الصالح، وهي أعظم عطاء يمنحه الله لعبده.", "irab": "من: مفعول به أول، الحكمة: مفعول به ثانٍ، خيراً: مفعول به ثانٍ." },
    { "id": 270, "text": "وَمَا أَنفَقْتُم مِّن نَّفَقَةٍ أَوْ نَذَرْتُم مِّن نَّذْرٍ فَإِنَّ اللَّهَ يَعْلَمُهُ", "tafsir": "كل ما يخرجه الإنسان من مال أو يلتزم به من نذر، فالله عليم به وسيجازيه عليه.", "irab": "ما: اسم شرط مبتدأ، نفقة: اسم مجرور، يعلمه: جملة خبر إن." },
    { "id": 271, "text": "إِن تُبْدُوا الصَّدَقَاتِ فَنِعِمَّا هِيَ ۖ وَإِن تُخْفُوهَا وَتُؤْتُوهَا الْفُقَرَاءَ فَهُوَ خَيْرٌ لَّكُمْ", "tafsir": "جواز إظهار الصدقة، لكن إخفاءها وإعطاءها للفقراء سراً أفضل وأطهر للقلب.", "irab": "تبدوا: فعل الشرط، هي: فاعل، تخفوها: فعل الشرط، هو خير: جملة جواب الشرط." },
    { "id": 272, "text": "۞ لَّيْسَ عَلَيْكَ هُدَاهُمْ وَلَٰكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ ۗ وَمَا تُنفِقُوا مِنْ خَيْرٍ فَلِأَنفُسِكُمْ", "tafsir": "الهداية بيد الله وحده، والنفقة الحلال يعود نفعها وثوابها على المنفق نفسه.", "irab": "ليس: فعل ناقص، هداهم: اسم ليس مؤخر، الله: اسم لكن، من: مفعول به." },
    { "id": 273, "text": "لِلْفُقَرَاءِ الَّذِينَ أُحْصِرُوا فِي سَبِيلِ اللَّهِ لَا يَسْتَطِيعُونَ ضَرْبًا فِي الْأَرْضِ", "tafsir": "الأولوية في الصدقة للمتعففين الذين منعهم الجهاد أو الحاجة عن السعي للرزق.", "irab": "الفقراء: اسم مجرور، الذين: نعت، سيماهم: اسم مجرور، إلحافاً: حال." },
    { "id": 274, "text": "الَّذِينَ يُنفِقُونَ أَمْوَالَهُم بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلَانِيَةً فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ", "tafsir": "وعد بالثواب العظيم والأمان من الخوف والحزن للمنفقين في كل وقت وحال.", "irab": "الذين: مبتدأ، سراً: حال، أجرهم: مبتدأ مؤخر، عند: ظرف." },
    { "id": 275, "text": "الَّذِينَ يَأْكُلُونَ الرِّبَا لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ الَّذِي يَتَخَبَّطُهُ الشَّيْطَانُ مِنَ الْمَسِّ", "tafsir": "تحريم الربا ووصف حال آكل الربا يوم القيامة كالمجنون المصروع.", "irab": "الربا: مفعول به، الشيطان: فاعل، البيع: اسم كأن." },
    { "id": 276, "text": "يَمْحَقُ اللَّهُ الرِّبَا وَيُرْبِي الصَّدَقَاتِ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ", "tafsir": "الله يذهب بركة مال الربا ويزيد ويبارك في مال الصدقات.", "irab": "يمحق: فعل مضارع، الله: فاعل، الربا: مفعول به، الصدقات: مفعول به منصوب بالكسرة." },
    { "id": 277, "text": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ", "tafsir": "تأكيد فوز المؤمنين المقيمين للصلاة والمؤدين للزكاة بالأجر والأمن.", "irab": "الذين: اسم إن، أقاموا: فعل وفاعل، الصلاة: مفعول به، أجرهم: مبتدأ." },
    { "id": 278, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَذَرُوا مَا بَقِيَ مِنَ الرِّبَا إِن كُنتُم مُّؤْمِنِينَ", "tafsir": "الأمر بترك بقايا المعاملات الربوية كدليل على صدق الإيمان والتقوى.", "irab": "اتقوا: فعل أمر، الله: مفعول به، ذروا: فعل أمر، ما: مفعول به." },
    { "id": 279, "text": "فَإِن لَّمْ تَفْعَلُوا فَأْذَنُوا بِحَرْبٍ مِّنَ اللَّهِ وَرَسُولِهِ ۖ وَإِن تُبْتُمْ فَلَكُمْ رُءُوسُ أَمْوَالِكُمْ", "tafsir": "وعيد شديد للمصرين على الربا بحرب من الله، وجواز استرداد رأس المال فقط عند التوبة.", "irab": "لم تفعلوا: مضارع مجزوم، بحرب: اسم مجرور، رؤوس: مبتدأ مؤخر." },
    { "id": 280, "text": "وَإِن كَانَ ذُو عُسْرَةٍ فَنَظِرَةٌ إِلَىٰ مَيْسَرَةٍ ۚ وَأَن تَصَدَّقُوا خَيْرٌ لَّكُمْ", "tafsir": "وجوب إمهال المدين المعسر، والحث على التنازل عن الدين كصدقة.", "irab": "ذو: فاعل، عسرة: مضاف إليه، نظرة: مبتدأ لخبر محذوف، تصدقوا: مبتدأ." },
    { "id": 281, "text": "وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ ۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ", "tafsir": "تذكير بيوم القيامة والوقوف بين يدي الله حيث يوفى كل إنسان جزاء عمله دون ظلم.", "irab": "يوماً: مفعول به، ترجعون: مضارع مبني للمجهول، نفس: مضاف إليه، يظلمون: مضارع مبني للمجهول." },
    { "id": 282, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَدَايَنتُم بِدَيْنٍ إِلَىٰ أَجَلٍ مُّسَمًّى فَاكْتُبُوهُ", "tafsir": "آية الدين: أطول آية في القرآن توضح أحكام توثيق الديون والإشهاد عليها لضمان الحقوق.", "irab": "تداينتم: فعل وفاعل، أجل: اسم مجرور، اكتبوه: فعل أمر وفاعل ومفعول." },
    { "id": 283, "text": "وَإِن كُنتُمْ عَلَىٰ سَفَرٍ وَلَمْ تَجِدُوا كَاتِبًا فَرِهَانٌ مَّقْبُوضَةٌ", "tafsir": "أحكام الرهن في السفر لتوثيق الدين عند فقدان الكاتب، ووجوب أداء الأمانة.", "irab": "تجدوا: مضارع مجزوم، كاتباً: مفعول به، رهان: مبتدأ لخبر محذوف." },
    { "id": 284, "text": "لِّلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِن تُبْدُوا مَا فِي أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ اللَّهُ", "tafsir": "ملك الله للكون وعلمه بما تخفيه الصدور ومحاسبته للعباد بعدله ورحمته.", "irab": "لله: خبر مقدم، ما: مبتدأ مؤخر، يحاسبكم: جواب الشرط، الله: فاعل." },
    { "id": 285, "text": "آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ", "tafsir": "إعلان إيمان الرسول والمؤمنين بجميع أركان الإيمان والسمع والطاعة لله.", "irab": "آمن: فعل ماض، الرسول: فاعل، كل: مبتدأ، آمن: جملة الخبر." },
    { "id": 286, "text": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ", "tafsir": "رحمة الله بعدم تكليف العباد فوق طاقتهم، ودعاء المؤمنين بالمغفرة والعفو والنصر.", "irab": "لا: نافية، الله: فاعل، نفساً: مفعول به أول، وسعها: مفعول به ثانٍ." }
   ] 
    },
    { "id": 3, "name": "آل عمران", "verses": [    { "id": 1, "text": "الم", "tafsir": "حروف مقطعة للإعجاز الإلهي، الله أعلم بمراده بها.", "irab": "حروف مبنية لا محل لها من الإعراب." },
    { "id": 2, "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ", "tafsir": "الله هو المعبود وحده بحق، المتصف بالحياة الكاملة والقائم بتدبير خلقه.", "irab": "الله: مبتدأ، لا إله إلا هو: جملة الخبر، الحي: خبر ثانٍ." },
    { "id": 3, "text": "نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ التَّوْرَاةَ وَالْإِنجِيلَ", "tafsir": "أنزل الله القرآن بالصدق، موافقاً لما سبقه من الكتب، وأنزل التوراة والإنجيل.", "irab": "نزل: فعل، الكتاب: مفعول به، مصدقاً: حال منصوب." },
    { "id": 4, "text": "مِن قَبْلُ هُدًى لِّلنَّاسِ وَأَنزَلَ الْفُرْقَانَ ۗ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ", "tafsir": "كانت الكتب السابقة هداية، والقرآن هو المفرق بين الحق والباطل.", "irab": "من قبل: ظرف زمان، الذين: اسم إن، عذاب: مبتدأ مؤخر." },
    { "id": 5, "text": "إِنَّ اللَّهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ", "tafsir": "علم الله محيط بكل شيء، فلا يغيب عنه ذرة في الكون.", "irab": "إن: حرف ناسخ، الله: اسمها، شيء: فاعل مرفوع." },
    { "id": 6, "text": "هُوَ الَّذِي يُصَوِّرُكُمْ فِي الْأَرْحَامِ كَيْفَ يَشَاءُ ۚ لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ", "tafsir": "الله هو الذي يخلقكم في أرحام أمهاتكم على الهيئة التي يختارها.", "irab": "هو: مبتدأ، الذي: خبر، يصوركم: فعل ومفعول به، كيف: اسم استفهام." },
    { "id": 7, "text": "هُوَ الَّذِي أَنزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُّحْكَمَاتٌ هُنَّ أُمُّ الْكِتَابِ وَأُخَرُ مُتَشَابِهَاتٌ", "tafsir": "القرآن فيه آيات واضحة (محكمات) وآيات تحتاج لتفسير (متشابهات).", "irab": "آيات: مبتدأ، محكمات: نعت، هن: مبتدأ، أم: خبر." },
    { "id": 8, "text": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ", "tafsir": "دعاء الراسخين في العلم بالثبات على الهداية وطلب الرحمة.", "irab": "لا: ناهية (للدعاء)، تزغ: مضارع مجزوم، قلوبنا: مفعول به." },
    { "id": 9, "text": "رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ", "tafsir": "الإيمان بيوم القيامة حيث يجمع الله الخلق للحساب كما وعد.", "irab": "جامع: خبر إن، الناس: مضاف إليه، الميعاد: مفعول به." },
    { "id": 10, "text": "إِنَّ الَّذِينَ كَفَرُوا لَن تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلَا أَوْلَادُهُم مِّنَ اللَّهِ شَيْئًا", "tafsir": "أموال الكفار وأولادهم لن تحميهم من عذاب الله يوم القيامة.", "irab": "الذين: اسم إن، أموالهم: فاعل تغني، شيئاً: مفعول به ثانٍ." },
    { "id": 11, "text": "كَدَأْبِ آلِ فِرْعَوْنَ وَالَّذِينَ مِن قَبْلِهِمْ ۚ كَذَّبُوا بِآيَاتِنَا فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ", "tafsir": "حال الكفار كحال آل فرعون الذين كذبوا وعوقبوا بذنوبهم.", "irab": "آل: مضاف إليه، الذين: معطوف، الله: فاعل، بذنوبهم: جار ومجرور." },
    { "id": 12, "text": "قُل لِّلَّذِينَ كَفَرُوا سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَىٰ جَهَنَّمَ ۚ وَبِئْسَ الْمِهَادُ", "tafsir": "وعد الله بهزيمة الكفار في الدنيا وحشرهم في نار جهنم في الآخرة.", "irab": "تغلبون: مضارع مبني للمجهول، جهنم: اسم مجرور بالفتحة." },
    { "id": 13, "text": "قَدْ كَانَ لَكُمْ آيَةٌ فِي فِئَتَيْنِ الْتَقَتَا ۖ فِئَةٌ تُقَاتِلُ فِي سَبِيلِ اللَّهِ وَأُخْرَىٰ كَافِرَةٌ", "tafsir": "عبرة في غزوة بدر بنصر القلة المؤمنة على الكثرة الكافرة.", "irab": "آية: اسم كان مؤخر، فئة: مبتدأ، كافرة: نعت." },
    { "id": 14, "text": "زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوَاتِ مِنَ النِّسَاءِ وَالْبَنِينَ وَالْقَنَاطِيرِ الْمُقَنطَرَةِ مِنَ الذَّهَبِ", "tafsir": "بيان فتن الدنيا ومتاعها الزائل من أموال وأولاد.", "irab": "زين: مبني للمجهول، حب: نائب فاعل، الشهوات: مضاف إليه." },
    { "id": 15, "text": "قُلْ أَؤُنَبِّئُكُم بِخَيْرٍ مِّن ذَٰلِكُمْ ۚ لِلَّذِينَ اتَّقَوْا عِندَ رَبِّهِمْ جَنَّاتٌ", "tafsir": "النعيم الباقي للمتقين في الجنات خير من كل متاع الدنيا.", "irab": "أؤنبئكم: استفهام وفعل، جنات: مبتدأ مؤخر." },
    { "id": 16, "text": "الَّذِينَ يَقُولُونَ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ", "tafsir": "صفات المتقين: التوسل لله بإيمانهم لطلب المغفرة والنجاة.", "irab": "آمنا: فعل وفاعل، ذنوبنا: مفعول به، قنا: فعل أمر (دعاء)." },
    { "id": 17, "text": "الصَّابِرِينَ وَالصَّادِقِينَ وَالْقَانِتِينَ وَالْمُنفِقِينَ وَالْمُسْتَغْفِرِينَ بِالْأَسْحَارِ", "tafsir": "مزيد من صفات المتقين: الصبر والصدق والقنوت والإنفاق والاستغفار بالليل.", "irab": "الصابرين: نعت مجرور بالياء (أو مفعول به لفعل محذوف)." },
    { "id": 18, "text": "شَهِدَ اللَّهُ أَنَّهُ لَا إِلَٰهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ قَائِمًا بِالْقِسْطِ", "tafsir": "أعظم شهادة بالتوحيد من الله وملائكته وأهل العلم بالعدل.", "irab": "شهد: فعل، الله: فاعل، قائماً: حال منصوبة." },
    { "id": 19, "text": "إِنَّ الدِّينَ عِندَ اللَّهِ الْإِسْلَامُ ۗ وَمَا اخْتَلَفَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءَهُمُ الْعِلْمُ", "tafsir": "الدين المقبول عند الله هو الإسلام، واختلاف أهل الكتاب سببه البغي.", "irab": "الدين: اسم إن، الإسلام: خبر إن، الذين: فاعل." },
    { "id": 20, "text": "فَإِنْ حَاجُّوكَ فَقُلْ أَسْلَمْتُ وَجْهِيَ لِلَّهِ وَمَنِ اتَّبَعَنِ ۗ وَقُل لِّلَّذِينَ أُوتُوا الْكِتَابَ", "tafsir": "الرد على المجادلين بالتمسك بالإسلام ودعوتهم للدخول فيه.", "irab": "حاجوك: فعل وفاعل ومفعول، وجهي: مفعول به." },
    { "id": 21, "text": "إِنَّ الَّذِينَ يَكْفُرُونَ بِآيَاتِ اللَّهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ", "tafsir": "وعيد شديد لمن يجحدون بالآيات ويقتلون الأنبياء بغير وجه حق.", "irab": "الذين: اسم إن، النبيين: مفعول به منصوب بالياء." },
    { "id": 22, "text": "أُولَٰئِكَ الَّذِينَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ وَمَا لَهُم مِّن نَّاصِرِينَ", "tafsir": "هؤلاء بطلت أعمالهم ولن يجدوا من ينصرهم من عذاب الله.", "irab": "أولئك: مبتدأ، الذين: خبر، أعمالهم: فاعل حبطت." },
    { "id": 23, "text": "أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِّنَ الْكِتَابِ يُدْعَوْنَ إِلَىٰ كِتَابِ اللَّهِ لِيَحْكُمَ بَيْنَهُمْ", "tafsir": "إعراض بعض أهل الكتاب عن حكم الله الموجود في كتبهم.", "irab": "الذين: اسم مجرور، نصيباً: مفعول به، الله: مضاف إليه." },
    { "id": 24, "text": "ذَٰلِكَ بِأَنَّهُمْ قَالُوا لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَاتٍ ۖ وَغَرَّهُمْ فِي دِينِهِم مَّا كَانُوا يَفْتَرُونَ", "tafsir": "اغترارهم بأكاذيبهم بأن النار لن تمسهم إلا قليلاً.", "irab": "أياماً: ظرف زمان، ما: اسم موصول فاعل غرهم." },
    { "id": 25, "text": "فَكَيْفَ إِذَا جَمَعْنَاهُمْ لِيَوْمٍ لَّا رَيْبَ فِيهِ وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا كَسَبَتْ", "tafsir": "حالهم العظيم يوم يجمعهم الله للحساب ويوفى كلٌ عمله.", "irab": "كيف: اسم استفهام، نفس: مضاف إليه، ما: مفعول به." }
] },
    { "id": 4, "name": "النساء", "verses": [] },
    { "id": 5, "name": "المائدة", "verses": [] },
    { "id": 6, "name": "الأنعام", "verses": [] },
    { "id": 7, "name": "الأعراف", "verses": [] },
    { "id": 8, "name": "الأنفال", "verses": [] },
    { "id": 9, "name": "التوبة", "verses": [] },
    { "id": 10, "name": "يونس", "verses": [] },
    { "id": 11, "name": "هود", "verses": [] },
    { "id": 12, "name": "يوسف", "verses": [] },
    { "id": 13, "name": "الرعد", "verses": [] },
    { "id": 14, "name": "إبراهيم", "verses": [] },
    { "id": 15, "name": "الحجر", "verses": [] },
    { "id": 16, "name": "النحل", "verses": [] },
    { "id": 17, "name": "الإسراء", "verses": [] },
    { "id": 18, "name": "الكهف", "verses": [] },
    { "id": 19, "name": "مريم", "verses": [] },
    { "id": 20, "name": "طه", "verses": [] },
    { "id": 21, "name": "الأنبياء", "verses": [] },
    { "id": 22, "name": "الحج", "verses": [] },
    { "id": 23, "name": "المؤمنون", "verses": [] },
    { "id": 24, "name": "النور", "verses": [] },
    { "id": 25, "name": "الفرقان", "verses": [] },
    { "id": 26, "name": "الشعراء", "verses": [] },
    { "id": 27, "name": "النمل", "verses": [] },
    { "id": 28, "name": "القصص", "verses": [] },
    { "id": 29, "name": "العنكبوت", "verses": [] },
    { "id": 30, "name": "الروم", "verses": [] },
    { "id": 31, "name": "لقمان", "verses": [] },
    { "id": 32, "name": "السجدة", "verses": [] },
    { "id": 33, "name": "الأحزاب", "verses": [] },
    { "id": 34, "name": "سبأ", "verses": [] },
    { "id": 35, "name": "فاطر", "verses": [] },
    { "id": 36, "name": "يس", "verses": [] },
    { "id": 37, "name": "الصافات", "verses": [] },
    { "id": 38, "name": "ص", "verses": [] },
    { "id": 39, "name": "الزمر", "verses": [] },
    { "id": 40, "name": "غافر", "verses": [] },
    { "id": 41, "name": "فصلت", "verses": [] },
    { "id": 42, "name": "الشورى", "verses": [] },
    { "id": 43, "name": "الزخرف", "verses": [] },
    { "id": 44, "name": "الدخان", "verses": [] },
    { "id": 45, "name": "الجاثية", "verses": [] },
    { "id": 46, "name": "الأحقاف", "verses": [] },
    { "id": 47, "name": "محمد", "verses": [] },
    { "id": 48, "name": "الفتح", "verses": [] },
    { "id": 49, "name": "الحجرات", "verses": [] },
    { "id": 50, "name": "ق", "verses": [] },
    { "id": 51, "name": "الذاريات", "verses": [] },
    { "id": 52, "name": "الطور", "verses": [] },
    { "id": 53, "name": "النجم", "verses": [] },
    { "id": 54, "name": "القمر", "verses": [] },
    { "id": 55, "name": "الرحمن", "verses": [] },
    { "id": 56, "name": "الواقعة", "verses": [] },
    { "id": 57, "name": "الحديد", "verses": [] },
    { "id": 58, "name": "المجادلة", "verses": [] },
    { "id": 59, "name": "الحشر", "verses": [] },
    { "id": 60, "name": "الممتحنة", "verses": [] },
    { "id": 61, "name": "الصف", "verses": [] },
    { "id": 62, "name": "الجمعة", "verses": [] },
    { "id": 63, "name": "المنافقون", "verses": [] },
    { "id": 64, "name": "التغابن", "verses": [] },
    { "id": 65, "name": "الطلاق", "verses": [] },
    { "id": 66, "name": "التحريم", "verses": [] },
    { "id": 67, "name": "الملك", "verses": [] },
    { "id": 68, "name": "القلم", "verses": [] },
    { "id": 69, "name": "الحاقة", "verses": [] },
    { "id": 70, "name": "المعارج", "verses": [] },
    { "id": 71, "name": "نوح", "verses": [] },
    { "id": 72, "name": "الجن", "verses": [] },
    { "id": 73, "name": "المزمل", "verses": [] },
    { "id": 74, "name": "المدثر", "verses": [] },
    { "id": 75, "name": "القيامة", "verses": [] },
    { "id": 76, "name": "الإنسان", "verses": [] },
    { "id": 77, "name": "المرسلات", "verses": [] },
    { "id": 78, "name": "النبأ", "verses": [] },
    { "id": 79, "name": "النازعات", "verses": [] },
    { "id": 80, "name": "عبس", "verses": [] },
    { "id": 81, "name": "التكوير", "verses": [] },
    { "id": 82, "name": "الانفطار", "verses": [] },
    { "id": 83, "name": "المطففين", "verses": [] },
    { "id": 84, "name": "الانشقاق", "verses": [] },
    { "id": 85, "name": "البروج", "verses": [] },
    { "id": 86, "name": "الطارق", "verses": [] },
    { "id": 87, "name": "الأعلى", "verses": [] },
    { "id": 88, "name": "الغاشية", "verses": [] },
    { "id": 89, "name": "الفجر", "verses": [] },
    { "id": 90, "name": "البلد", "verses": [] },
    { "id": 91, "name": "الشمس", "verses": [] },
    { "id": 92, "name": "الليل", "verses": [] },
    { "id": 93, "name": "الضحى", "verses": [] },
    { "id": 94, "name": "الشرح", "verses": [] },
    { "id": 95, "name": "التين", "verses": [] },
    { "id": 96, "name": "العلق", "verses": [] },
    { "id": 97, "name": "القدر", "verses": [] },
    { "id": 98, "name": "البينة", "verses": [] },
    { "id": 99, "name": "الزلزلة", "verses": [] },
    { "id": 100, "name": "العاديات", "verses": [] },
    { "id": 101, "name": "القارعة", "verses": [] },
    { "id": 102, "name": "التكاثر", "verses": [] },
    { "id": 103, "name": "العصر", "verses": [] },
    { "id": 104, "name": "الهمزة", "verses": [] },
    { "id": 105, "name": "الفيل", "verses": [] },
    { "id": 106, "name": "قريش", "verses": [] },
    { "id": 107, "name": "الماعون", "verses": [] },
    { "id": 108, "name": "الكوثر", "verses": [] },
    { "id": 109, "name": "الكافرون", "verses": [] },
    { "id": 110, "name": "النصر", "verses": [] },
    { "id": 111, "name": "المسد", "verses": [] },
    { "id": 112, "name": "الإخلاص", "verses": [] },
    { "id": 113, "name": "الفلق", "verses": [] },
    { "id": 114, "name": "الناس", "verses": [] }
  ]
}
