{
  "surahs": [
    {
      "id": 1,
      "name": "الفاتحة",
      "verses": [
        { "id": 1, "text": "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ", "tafsir": "أبدأ قراءتي مستعيناً بالله المعبود بحق، واسع الرحمة.", "irab": "الباء: حرف جر، اسم: اسم مجرور، الله: لفظ الجلالة مضاف إليه." },
        { "id": 2, "text": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ", "tafsir": "الثناء والحمد لله وحده، خالق كل شيء ومالكه ومدبره.", "irab": "الحمد: مبتدأ مرفوع، لله: جار ومجرور متعلقان بمحذوف خبر." },
        { "id": 3, "text": "الرَّحْمَنِ الرَّحِيمِ", "tafsir": "صاحب الرحمة الواسعة التي وسعت كل شيء.", "irab": "نعت للفظ الجلالة (الله) مجرور." },
        { "id": 4, "text": "مَالِكِ يَوْمِ الدِّينِ", "tafsir": "هو وحده سبحانه المتصرف في يوم الجزاء والحساب.", "irab": "مالك: نعت ثالث، يوم: مضاف إليه، الدين: مضاف إليه ثانٍ." },
        { "id": 5, "text": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ", "tafsir": "نخصك وحدك بالعبادة، ونطلب منك وحدك العون.", "irab": "إياك: ضمير منفصل مبني في محل نصب مفعول به مقدم." },
        { "id": 6, "text": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ", "tafsir": "وفقنا وأرشدنا وثبتنا على الطريق الموصل للجنة.", "irab": "اهدنا: فعل أمر (للدعاء)، نا: مفعول به، الصراط: مفعول به ثانٍ." },
        { "id": 7, "text": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ", "tafsir": "طريق الذين هديتهم من الأنبياء، لا طريق المغضوب عليهم ولا الضالين.", "irab": "صراط: بدل من الأول، الذين: اسم موصول مضاف إليه." }
      ]
    },
    {
      "id": 2,
      "name": "البقرة",
      "verses": [
        { "id": 1, "text": "الم", "tafsir": "حروف مقطعة للإعجاز الإلهي.", "irab": "حروف مبنية لا محل لها." },
        { "id": 2, "text": "ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ", "tafsir": "هذا القرآن حق لا شك فيه، يرشد المتقين.", "irab": "ذلك: مبتدأ، الكتاب: بدل." }
        { "id": 3, "text": "الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ", "tafsir": "المؤمنون بالخفاء والمقيمون للصلاة والمنفقون مما أعطاهم الله.", "irab": "الذين: نعت للمتقين، يؤمنون: فعل مضارع مرفوع." },
    { "id": 4, "text": "وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ", "tafsir": "المصدقون بالوحي السماوي كله وباليوم الآخر يقيناً.", "irab": "الذين: معطوف، هم: مبتدأ، يوقنون: خبر." },
    { "id": 5, "text": "أُولَٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ", "tafsir": "هؤلاء على نور من خالقهم وهم الفائزون بالنجاة.", "irab": "أولئك: مبتدأ، على هدى: خبر، المفلحون: خبر ثانٍ." },
    { "id": 6, "text": "إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ", "tafsir": "الجاحدون لا تنفعهم الموعظة لعنادهم وإصرارهم على الباطل.", "irab": "إن: حرف ناسخ، الذين: اسمها، لا يؤمنون: جملة حالية." },
    { "id": 7, "text": "خَتَمَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰ أَبْصَارِهِمْ غِشَاوَةٌ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ", "tafsir": "طبع الله على قلوبهم وحجب سمعهم وأبصارهم عن رؤية الحق.", "irab": "ختم: فعل، الله: فاعل، غشاوة: مبتدأ مؤخر." },
    { "id": 8, "text": "وَمِنَ النَّاسِ مَن يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ وَمَا هُم بِمُؤْمِنِينَ", "tafsir": "بداية ذكر المنافقين الذين يدعون الإيمان ظاهراً فقط.", "irab": "من الناس: خبر مقدم، من: مبتدأ مؤخر." },
    { "id": 9, "text": "يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلَّا أَنفُسَهُمْ وَمَا يَشْعُرُونَ", "tafsir": "يظنون أنهم يخدعون الله والمؤمنين والحقيقة أنهم يخدعون أنفسهم.", "irab": "يخادعون: فعل، الله: مفعول به، أنفسهم: مفعول به." },
    { "id": 10, "text": "فِي قُلُوبِهِم مَّرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ", "tafsir": "قلوبهم مريضة بالشك فزادهم الله ضلالاً ولهم عقاب أليم.", "irab": "في قلوبهم: خبر، مرض: مبتدأ، مرضاً: مفعول به ثانٍ." },
    { "id": 11, "text": "وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ", "tafsir": "إذا نُهوا عن الفساد ادعوا كذباً أنهم أهل الإصلاح.", "irab": "إذا: ظرفية، نحن: مبتدأ، مصلحون: خبر." },
    { "id": 12, "text": "أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ وَلَٰكِن لَّا يَشْعُرُونَ", "tafsir": "تأكيد من الله أنهم هم المفسدون الحقيقيون لخراب ضمائرهم.", "irab": "ألا: استفتاحية، إنهم: حرف ناسخ، المفسدون: خبر." },
    { "id": 13, "text": "وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاسُ قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاءُ", "tafsir": "يحتقرون المؤمنين ويصفونهم بالسفه تكبراً وتعالياً.", "irab": "أنؤمن: الهمزة للاستفهام، السفهاء: فاعل." },
    { "id": 14, "text": "وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَوْا إِلَىٰ شَيَاطِينِهِمْ قَالُوا إِنَّا مَعَكُمْ", "tafsir": "يتلونون حسب من يجالسون؛ إيمان أمام المسلمين وكفر مع رفقائهم.", "irab": "لقوا: فعل، الذين: مفعول به، إنا: إن واسمها." },
    { "id": 15, "text": "اللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ", "tafsir": "الله يجازيهم على استهزائهم بتركهم يتمادون في ضلالهم.", "irab": "الله: مبتدأ، يستهزئ: جملة الخبر، يعمهون: حال." },
    { "id": 16, "text": "أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ فَمَا رَبِحَت تِّجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ", "tafsir": "استبدلوا الكفر بالإيمان فخسروا صفقتهم في الدنيا والآخرة.", "irab": "أولئك: مبتدأ، الذين: خبر، الضلالة: مفعول به." },
    { "id": 17, "text": "مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ ذَهَبَ اللَّهُ بِنُورِهِمْ", "tafsir": "مثلهم كمن أضاء ناراً ثم انطفأت فبقي في الظلمة والحيرة.", "irab": "مثلهم: مبتدأ، كمثل: خبر، ناراً: مفعول به." },
    { "id": 18, "text": "صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ", "tafsir": "صم عن الحق، بكم عن النطق به، عمي عن رؤيته فلا عودة لهم.", "irab": "صم: خبر لمبتدأ محذوف تقديره (هم)." },
    { "id": 19, "text": "أَوْ كَصَيِّبٍ مِّنَ السَّمَاءِ فِيهِ ظُلُمَاتٌ وَرَعْدٌ وَبَرْقٌ", "tafsir": "مثل آخر للمنافقين في شدة حيرتهم وخوفهم من هيبة الوحي.", "irab": "أو: حرف عطف، كصيب: جار ومجرور." },
    { "id": 20, "text": "يَكَادُ الْبَرْقُ يَخْطَفُ أَبْصَارَهُمْ ۖ كُلَّمَا أَضَاءَ لَهُم مَّشَوْا فِيهِ", "tafsir": "يتحركون عند مصلحتهم ويتوقفون عند الشدائد.", "irab": "يكاد: فعل مقاربة، البرق: اسمها، أبصارهم: مفعول به." },
    { "id": 21, "text": "يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ", "tafsir": "دعوة البشر لتوحيد الله وعبادته وحده ليصلوا للتقوى.", "irab": "يا: نداء، اعبدوا: فعل أمر، ربكم: مفعول به." },
    { "id": 22, "text": "الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنزَلَ مِنَ السَّمَاءِ مَاءً", "tafsir": "الله مهد الأرض وأنزل المطر لرزق العباد وصلاح حالهم.", "irab": "الذي: نعت، الأرض: مفعول به أول، فراشاً: مفعول به ثانٍ." },
    { "id": 23, "text": "وَإِن كُنتُمْ فِي رَيْبٍ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا بِسُورَةٍ مِّن مِّثْلِهِ", "tafsir": "تحدي المشركين أن يأتوا بسورة تشبه القرآن إن شكوا فيه.", "irab": "إن: شرطية، فأتوا: جواب الشرط، بسورة: جار ومجرور." },
    { "id": 24, "text": "فَإِن لَّمْ تَفْعَلُوا وَلَن تَفْعَلُوا فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ", "tafsir": "بما أن عجزكم مؤكد، فاحذروا نار جهنم المعدة للكافرين.", "irab": "فاتقوا: فعل أمر، النار: مفعول به، وقودها: مبتدأ." },
    { "id": 25, "text": "وَبَشِّرِ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ", "tafsir": "بشارة للمؤمنين الصالحين بالنعيم الخالد في الجنات.", "irab": "بشر: فعل أمر، الذين: مفعول به، جنات: اسم أن منصوب." }
    { "id": 26, "text": "۞ إِنَّ اللَّهَ لَا يَسْتَحْيِي أَن يَضْرِبَ مَثَلًا مَّا بَعُوضَةً فَمَا فَوْقَهَا", "tafsir": "الله يضرب الأمثال بكل شيء لبيان الحق وتثبيت المؤمنين.", "irab": "إن: حرف ناسخ، الله: اسمها، مثلاً: مفعول به." },
    { "id": 27, "text": "الَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ", "tafsir": "صفات الخاسرين الذين يفسدون في الأرض ويخلفون العهود.", "irab": "الذين: نعت، ينقضون: فعل وفاعل، عهد: مفعول به." },
    { "id": 28, "text": "كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ۖ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ", "tafsir": "تعجب من الكفر رغم شهود الخلق والإحياء والموت والبعث.", "irab": "كيف: اسم استفهام، تكفرون: فعل مضارع." },
    { "id": 29, "text": "هُوَ الَّذِي خَلَقَ لَكُم مَّا فِي الْأَرْضِ جَمِيعًا ثُمَّ اسْتَوَىٰ إِلَى السَّمَاءِ", "tafsir": "الله سخر الأرض وما فيها للبشر وأتقن خلق السموات السبع.", "irab": "هو: مبتدأ، الذي: خبر، خلق: فعل ماض." },
    { "id": 30, "text": "وَإِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً", "tafsir": "قرار الله بخلق آدم واستخلافه في الأرض وإخبار الملائكة بذلك.", "irab": "إني: إن واسمها، جاعل: خبر إن، خليفة: مفعول به." },
    { "id": 31, "text": "وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَى الْمَلَائِكَةِ", "tafsir": "تشريف آدم بالعلم بأسماء كل شيء لإظهار فضله.", "irab": "علم: فعل، آدم: مفعول أول، الأسماء: مفعول ثانٍ." },
    { "id": 32, "text": "قَالُوا سُبْحَانَكَ لَا عِلْمَ لَنَا إِلَّا مَا عَلَّمْتَنَا ۖ إِنَّكَ أَنتَ الْعَلِيمُ الْحَكِيمُ", "tafsir": "اعتراف الملائكة بفضل الله وأن العلم كله لله وحده.", "irab": "سبحانك: مفعول مطلق، إنك: إن واسمها." },
    { "id": 33, "text": "قَالَ يَا آدَمُ أَنبِئْهُم بِأَسْمَائِهِمْ ۖ فَلَمَّا أَنبَأَهُم بِأَسْمَائِهِمْ", "tafsir": "آدم عليه السلام يخبر الملائكة بالأسماء بأمر ربه.", "irab": "يا آدم: منادى، أنبئهم: فعل أمر ومفعول به." },
    { "id": 34, "text": "وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ أَبَىٰ وَاسْتَكْبَرَ", "tafsir": "أمر السجود لآدم تكريماً له، ورفض إبليس استكباراً وكفراً.", "irab": "اسجدوا: فعل أمر، إبليس: مستثنى منصوب." },
    { "id": 35, "text": "وَقُلْنَا يَا آدَمُ اسْكُنْ أَنتَ وَزَوْجُكَ الْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا", "tafsir": "إباحة الجنة لآدم وزوجته والتحذير من شجرة واحدة.", "irab": "اسكن: فعل أمر، الجنة: مفعول به." },
    { "id": 36, "text": "فأزَلَّهُمَا الشَّيْطَانُ عَنْهَا فَأَخْرَجَهُمَا مِمَّا كَانَا فِيهِ", "tafsir": "وسوسة إبليس لهما وخروجهما من النعيم إلى الأرض.", "irab": "أزلهما: فعل ماض، الشيطان: فاعل." },
    { "id": 37, "text": "فَتَلَقَّىٰ آدَمُ مِن رَّبِّهِ كَلِمَاتٍ فَتَابَ عَلَيْهِ ۚ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ", "tafsir": "توبة آدم واستغفاره وقبول الله لتوبته برحمته.", "irab": "تلقى: فعل، آدم: فاعل، كلمات: مفعول به." },
    { "id": 38, "text": "قُلْنَا اهْبِطُوا مِنْهَا جَمِيعًا ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّي هُدًى", "tafsir": "الأمر بالنزول للأرض مع وعد بالهدى لمن يتبع الرسل.", "irab": "اهبطوا: فعل أمر، هدى: فاعل." },
    { "id": 39, "text": "وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ", "tafsir": "مصير المكذبين بالوحي هو الخلود في عذاب جهنم.", "irab": "أولئك: مبتدأ، أصحاب: خبر." },
    { "id": 40, "text": "يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَوْفُوا بِعَهْدِي", "tafsir": "تذكير بني إسرائيل بنعم الله والأمر بالوفاء بالعهد.", "irab": "يا بني: منادى، اذكروا: فعل أمر." },
    { "id": 41, "text": "وَآمِنُوا بِمَا أَنزَلْتُ مُصَدِّقًا لِّمَا مَعَكُمْ وَلَا تَكُونُوا أَوَّلَ كَافِرٍ بِهِ", "tafsir": "دعوتهم للإيمان بالقرآن المصدق للتوراة وعدم جحده.", "irab": "آمنوا: فعل أمر، مصدقاً: حال منصوب." },
    { "id": 42, "text": "وَلَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُوا الْحَقَّ وَأَنتُمْ تَعْلَمُونَ", "tafsir": "النهي عن خلط الحق بالباطل وكتمان العلم الصحيح.", "irab": "لا تلبسوا: ناهية ومضارع مجزوم." },
    { "id": 43, "text": "وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَارْكَعُوا مَعَ الرَّاكِعِينَ", "tafsir": "الأمر بالصلاة والزكاة والعبادة الجماعية.", "irab": "أقيموا: فعل أمر، الصلاة: مفعول به." },
    { "id": 44, "text": "أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ الْكِتَابَ", "tafsir": "توبيخ من يأمر بالخير ولا يفعله رغم علمه بالكتاب.", "irab": "أتأمرون: همزة استفهام، الناس: مفعول به." },
    { "id": 45, "text": "وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ", "tafsir": "الصبر والصلاة وسيلة لتحمل مشاق الحياة والتكاليف.", "irab": "استعينوا: فعل أمر، كبيرة: خبر إن." },
    { "id": 46, "text": "الَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ", "tafsir": "صفات الخاشعين المؤمنين بلقاء الله والبعث.", "irab": "الذين: نعت، أنهم: أن واسمها." },
    { "id": 47, "text": "يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَنِّي فَضَّلْتُكُمْ", "tafsir": "تذكيرهم بنعم الله وتفضيلهم على عالمي زمانهم.", "irab": "أني: أن واسمها، فضلتكم: جملة الخبر." },
    { "id": 48, "text": "وَاتَّقُوا يَوْمًا لَّا تَجْزِي نَفْسٌ عَن نَّفْسٍ شَيْئًا وَلَا يُقْبَلُ مِنْهَا شَفَاعَةٌ", "tafsir": "الحذر من يوم القيامة حيث لا تنفع وساطة ولا فداء.", "irab": "اتقوا: فعل أمر، يوماً: مفعول به." },
    { "id": 49, "text": "وَإِذْ نَجَّيْنَاكُم مِّنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ", "tafsir": "تذكيرهم بنعمة النجاة من ظلم فرعون وقتله للأبناء.", "irab": "نجيناكم: فعل وفاعل ومفعول به." },
    { "id": 50, "text": "وَإِذْ فَرَقْنَا بِكُمُ الْبَحْرَ فَأَنجَيْنَاكُمْ وَأَغْرَقْنَا آلَ فِرْعَوْنَ", "tafsir": "معجزة شق البحر ونجاة بني إسرائيل وهلاك عدوهم.", "irab": "فرقنا: فعل وفاعل، البحر: مفعول به." }
     { "id": 51, "text": "وَإِذْ وَاعَدْنَا مُوسَىٰ أَرْبَعِينَ لَيْلَةً ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِن بَعْدِهِ وَأَنتُمْ ظَالِمُونَ", "tafsir": "عبادة بني إسرائيل للعجل في غيبة موسى عليه السلام وتلقيه للتوراة.", "irab": "واعدنا: فعل وفاعل، موسى: مفعول به، العجل: مفعول به ثانٍ." },
    { "id": 52, "text": "ثُمَّ عَفَوْنَا عَنكُم مِّن بَعْدِ ذَٰلِكَ لَعَلَّكُمْ تَشْكُرُونَ", "tafsir": "عفو الله عن جريمة الشرك لعلهم يشكرون فضله ورحمته.", "irab": "عفونا: فعل وفاعل، لعلكم: لعل واسمها، تشكرون: مضارع." },
    { "id": 53, "text": "وَإِذْ آتَيْنَا مُوسَى الْكِتَابَ وَالْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُونَ", "tafsir": "إنزال التوراة لتكون منهجاً يفرق بين الحق والباطل للهداية.", "irab": "آتينا: فعل وفاعل، الكتاب: مفعول به، الفرقان: معطوف." },
    { "id": 54, "text": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِاتِّخَاذِكُمُ الْعِجْلَ", "tafsir": "أمر موسى لقومه بالتوبة من الشرك بتطهير أنفسهم وقتل المذنبين.", "irab": "ظلمتم: فعل وفاعل، أنفسكم: مفعول به." },
    { "id": 55, "text": "وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَن نُّؤْمِنَ لَكَ حَتَّىٰ نَرَى اللَّهَ جَهْرَةً فَأَخَذَتْكُمُ الصَّاعِقَةُ", "tafsir": "طلبهم رؤية الله عياناً تعنتاً فأخذتهم الصاعقة عقاباً لهم.", "irab": "لن: حرف ناصب، نؤمن: مضارع منصوب، جهرة: حال." },
    { "id": 56, "text": "ثُمَّ بَعَثْنَاكُم مِّن بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ", "tafsir": "إحياء الله لهم بعد الصاعقة ليعتبروا ويشكروا نعمة الحياة.", "irab": "بعثناكم: فعل وفاعل ومفعول به، موتكم: اسم مجرور." },
    { "id": 57, "text": "وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ وَأَنزَلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَىٰ ۖ كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ", "tafsir": "توفير الظل والرزق الطيب (المن والسلوى) لبني إسرائيل في التيه.", "irab": "الغمام: مفعول به، المن: مفعول به، السلوى: معطوف." },
    { "id": 58, "text": "وَإِذْ قُلْنَا ادْخُلُوا هَٰذِهِ الْقَرْيَةَ فَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا", "tafsir": "الأمر بدخول بيت المقدس بتواضع وطلب المغفرة (حطة).", "irab": "ادخلوا: فعل أمر، القرية: مفعول به، رغداً: حال." },
    { "id": 59, "text": "فَبَدَّلَ الَّذِينَ ظَلَمُوا قَوْلًا غَيْرَ الَّذِي قِيلَ لَهُمْ فَأَنزَلْنَا عَلَى الَّذِينَ ظَلَمُوا رِجْزًا", "tafsir": "تغييرهم لأمر الله استهزاءً فاستحقوا العذاب من السماء.", "irab": "الذين: فاعل، قولاً: مفعول به، رجزاً: مفعول به ثانٍ." },
    { "id": 60, "text": "۞ وَإِذِ اسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِ فَقُلْنَا اضْرِب بِّعَصَاكَ الْحَجَرَ ۖ فَانفَجَرَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا", "tafsir": "معجزة انفجار ١٢ عيناً من الحجر لسقيا قبائل بني إسرائيل.", "irab": "استسقى: فعل، موسى: فاعل، عيناً: تمييز منصوب." },
    { "id": 61, "text": "وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنبِتُ الْأَرْضُ", "tafsir": "مللهم من نعم الله وطلبهم لأطعمة الأرض الأدنى (بقلها وقثائها وفومها).", "irab": "لن: ناصب، نصبر: مضارع منصوب، طعام: اسم مجرور." },
    { "id": 62, "text": "إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالنَّصَارَىٰ وَالصَّابِئِينَ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ", "tafsir": "وعد الله بالأجر لكل من آمن وعمل صالحاً قبل بعثة النبي ﷺ.", "irab": "إن: حرف ناسخ، الذين: اسم إن، من آمن: خبر إن." },
    { "id": 63, "text": "وَإِذْ أَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّورَ خُذُوا مَا آتَيْنَاكُم بِقُوَّةٍ", "tafsir": "أخذ العهد ورفع جبل الطور فوقهم ترهيباً ليلتزموا بالميثاق.", "irab": "أخذنا: فعل وفاعل، ميثاقكم: مفعول به، الطور: مفعول به." },
    { "id": 64, "text": "ثُمَّ تَوَلَّيْتُم مِّن بَعْدِ ذَٰلِكا ۖ فَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَكُنتُم مِّنَ الْخَاسِرِينَ", "tafsir": "إعراضهم عن الميثاق ولولا رحمة الله لهلكوا بخطاياهم.", "irab": "توليتم: فعل وفاعل، فضل: مبتدأ لخبر محذوف." },
    { "id": 65, "text": "وَلَقَدْ عَلِمْتُمُ الَّذِينَ اعْتَدَوْا مِنكُمْ فِي السَّبْتِ فَقُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِينَ", "tafsir": "عقاب المعتدين في يوم السبت بمسخهم قردة منبوذين.", "irab": "الذين: مفعول به، قردة: خبر كـان منصوب." },
    { "id": 66, "text": "فَجَعَلْنَاهَا نَكَالًا لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِّلْمُتَّقِينَ", "tafsir": "جعل هذه العقوبة عبرة لمن حضرها ومن جاء بعدها.", "irab": "جعلناها: فعل وفاعل ومفعول به أول، نكالاً: مفعول ثانٍ." },
    { "id": 67, "text": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ إِنَّ اللَّهَ يَأْمُرُكُمْ أَن تَذْبَحُوا بَقَرَةً", "tafsir": "بداية قصة البقرة وكشف القاتل المجهول بأمر الله.", "irab": "يأمركم: فعل ومفعول به، أن تذبحوا: مصدر مؤول." },
    { "id": 68, "text": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ ۚ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَلَا بِكْرٌ", "tafsir": "تشديدهم على أنفسهم بالسؤال عن عمر البقرة (لا كبيرة ولا صغيرة).", "irab": "ادع: فعل أمر، بقرة: خبر إنَّ، لا فارض: نعت." },
    { "id": 69, "text": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا ۚ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ صَفْرَاءُ فَاقِعٌ لَّوْنُهَا", "tafsir": "سؤالهم عن لونها فجاء الرد بأنها صفراء شديدة الصفرة.", "irab": "ما: اسم استفهام مبتدأ، لونها: خبر، صفراء: نعت." },
    { "id": 70, "text": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ إِنَّ الْبَقَرَ تَشَابَهَ عَلَيْنَا", "tafsir": "مزيد من التعنت والجدال بأن البقر قد التبس عليهم.", "irab": "إن: حرف ناسخ، البقر: اسمها، تشابه: فعل ماض." },
    { "id": 71, "text": "قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لَّا ذَلُولٌ تُثِيرُ الْأَرْضَ وَلَا تَسْقِي الْحَرْثَ مُسَلَّمَةٌ", "tafsir": "وصف البقرة بأنها لا تعمل في حرث ولا سقي وسليمة تماماً.", "irab": "ذلول: نعت، تثير: فعل مضارع، الأرض: مفعول به." },
    { "id": 72, "text": "وَإِذْ قَتَلْتُمْ نَفْسًا فَادَّارَأْتُمْ فِيهَا ۖ وَاللَّهُ مُخْرِجٌ مَّا كُنتُمْ تَكْتُمُونَ", "tafsir": "وقوع جريمة قتل وتدافع التهم والله مظهر للحقيقة.", "irab": "قتلتم: فعل وفاعل، نفساً: مفعول به، الله: مبتدأ." },
    { "id": 73, "text": "فَقُلْنَا اضْرِبُوهُ بِبَعْضِهَا ۚ كَذَٰلِكَ يُحْيِي اللَّهُ الْمَوْتَىٰ وَيُرِيكُمْ آيَاتِهِ", "tafsir": "إحياء المقتول بجزء من البقرة ليخبر بقاتله كآية على البعث.", "irab": "اضربوه: فعل وفاعل ومفعول به، يحيي: مضارع." },
    { "id": 74, "text": "ثُمَّ قَسَتْ قُلُوبُكُم مِّن بَعْدِ ذَٰلِكَ فَهِيَ كَالْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةً", "tafsir": "شدة قلوب بني إسرائيل التي فاقت صلابة الحجر في القسوة.", "irab": "قست: فعل، قلوبكم: فاعل، كالحجارة: جار ومجرور." },
    { "id": 75, "text": "۞ أَفَتَطْمَعُونَ أَن يُؤْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ", "tafsir": "استبعاد إيمان اليهود الذين اعتادوا تحريف كلام الله عمداً.", "irab": "أن يؤمنوا: مصدر مؤول، فريق: اسم كـان." }
    { "id": 76, "text": "وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَا بَعْضُهُمْ إِلَىٰ بَعْضٍ قَالُوا أَتُحَدِّثُونَهُم بِمَا فَتَحَ اللَّهُ عَلَيْكُمْ لِيُحَاجُّوكُم بِهِ عِندَ رَبِّكُمْ ۚ أَفَلَا تَعْقِلُونَ", "tafsir": "نفاق اليهود بإظهار الإيمان أمام المسلمين ولوم بعضهم لبعض على إفشاء أسرار التوراة.", "irab": "لقوا: فعل وفاعل، الذين: مفعول به، آمنا: فعل وفاعل." },
    { "id": 77, "text": "أَوَلَا يَعْلَمُونَ أَنَّ اللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ", "tafsir": "تذكير للمنافقين بأن الله مطلع على خفايا نفوسهم وما يجهرون به.", "irab": "أن: حرف ناسخ، الله: اسمها، يعلم: جملة الخبر." },
    { "id": 78, "text": "وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ الْكِتَابَ إِلَّا أَمَانِيَّ وَإِنْ هُمْ إِلَّا يَظُنُّونَ", "tafsir": "فئة جاهلة من أهل الكتاب تتبع الأوهام والأكاذيب والظنون دون علم.", "irab": "أميّون: مبتدأ مؤخر، الكتاب: مفعول به." },
    { "id": 79, "text": "فَوَيْلٌ لِّلَّذِينَ يَكْتُبُونَ الْكِتَابَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هَٰذَا مِنْ عِندِ اللَّهِ لِيَشْتَرُوا بِهِ ثَمَنًا قَلِيلًا ۖ فَوَيْلٌ لَّهُم مِّمَّا كَتَبَتْ أَيْدِيهِمْ وَوَيْلٌ لَّهُم مِّمَّا يَكْسِبُونَ", "tafsir": "وعيد شديد لمن يحرفون الكتب السماوية بأيديهم لأجل مكاسب مادية زائلة.", "irab": "ويل: مبتدأ، للذين: خبر، يكتبون: صلة الموصول." },
    { "id": 80, "text": "وَقَالُوا لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَةً ۚ قُلْ أَتَّخَذْتُمْ عِندَ اللَّهِ عَهْدًا فَلَن يُخْلِفَ اللَّهُ عَهْدَهُ ۖ أَمْ تَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ", "tafsir": "ادعاؤهم الباطل بأن عذابهم سيكون قصيراً جداً، وتكذيب الله لهم لقولهم بغير علم.", "irab": "لن: ناصب، تمسنا: مضارع منصوب، النار: فاعل." },
    { "id": 81, "text": "بَلَىٰ مَن كَسَبَ سَيِّئَةً وَأَحَاطَتْ بِهِ خَطِيئَتُهُ فَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ", "tafsir": "الحقيقة أن من غرق في الذنوب والكفر حتى أحاطت به فمصيره الخلود في النار.", "irab": "من: اسم شرط مبتدأ، أصحاب: خبر." },
    { "id": 82, "text": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ ۖ هُمْ فِيهَا خَالِدُونَ", "tafsir": "المؤمنون الصالحون هم أهل الجنة الباقون فيها أبداً جزاء إيمانهم.", "irab": "الذين: مبتدأ، الجنة: مضاف إليه." },
    { "id": 83, "text": "وَإِذْ أَخَذْنَا مِيثَاقَ بَنِي إِسْرَائِيلَ لَا تَعْبُدُونَ إِلَّا اللَّهَ وَبِالْوَالِدَيْنِ إِحْسَانًا وَذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَقُولُوا لِلنَّاسِ حُسْنًا وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ ثُمَّ تَوَلَّيْتُمْ إِلَّا قَلِيلًا مِّنكُمْ وَأَنتُم مُّعْرِضُونَ", "tafsir": "ميثاق بني إسرائيل: التوحيد، بر الوالدين، والإحسان للضعفاء، والقول الحسن.", "irab": "أخذنا: فعل وفاعل، ميثاق: مفعول به." },
    { "id": 84, "text": "وَإِذْ أَخَذْنَا مِيثَاقَكُمْ لَا تَسْفِكُونَ دِمَاءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَارِكُمْ ثُمَّ أَقْرَرْتُمْ وَأَنتُمْ تَشْهَدُونَ", "tafsir": "العهد على منع القتل والتهجير القسري، وقد أقروا بذلك وشهدوا عليه.", "irab": "لا: نافيه، تسفكون: مضارع مرفوع بثبوت النون." },
    { "id": 85, "text": "ثُمَّ أَنتُمْ هَٰؤُلَاءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَارِهِمْ تَظَاهَرُونَ عَلَيْهِم بِالْإِثْمِ وَالْعُدْوَانِ", "tafsir": "توبيخهم على نقض الميثاق بقتل إخوانهم والتحالف مع الأعداء بالظلم.", "irab": "تقتلون: فعل وفاعل، أنفسكم: مفعول به." },
    { "id": 86, "text": "أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ ۖ فَلَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ يُنصَرُونَ", "tafsir": "تفضيلهم الدنيا الزائلة على الآخرة الباقية فاستحقوا عذاباً لا يخفف.", "irab": "اشتروا: فعل وفاعل، العذاب: نائب فاعل." },
    { "id": 87, "text": "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ وَقَفَّيْنَا مِن بَعْدِهِ بِالرُّسُلِ ۖ وَآتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنَاتِ وَأَيَّدْنَاهُ بِرُوحِ الْقُدُسِ", "tafsir": "تتابع الرسل وتأييد عيسى بالمعجزات، واستكبار اليهود بقتل الرسل وتكذيبهم.", "irab": "آتينا: فعل وفاعل، موسى: مفعول به أول." },
    { "id": 88, "text": "وَقَالُوا قُلُوبُنَا غُلْفٌ ۚ بَل لَّعَنَهُمُ اللَّهُ بِكُفْرِهِمْ فَقَلِيلًا مَّا يُؤْمِنُونَ", "tafsir": "ادعاؤهم أن قلوبهم مغطاة لا تفقه، والحقيقة أن الله طردهم لكفرهم.", "irab": "قلوبنا: مبتدأ، غلف: خبر." },
    { "id": 89, "text": "وَلَمَّا جَاءَهُمْ كِتَابٌ مِّنْ عِندِ اللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ وَكَانُوا مِن قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا فَلَمَّا جَاءَهُم مَّا عَرَفُوا كَفَرُوا بِهِ", "tafsir": "جحودهم بالقرآن رغم علمهم بصدقه وأنه يحقق ما في كتبهم التي استفتحوا بها.", "irab": "كتاب: فاعل، مصدق: نعت." },
    { "id": 90, "text": "بِئْسَمَا اشْتَرَوْا بِهِ أَنفُسَهُمْ أَن يَكْفُرُوا بِمَا أَنزَلَ اللَّهُ بَغْيًا أَن يُنَزِّلَ اللَّهُ مِن فَضْلِهِ عَلَىٰ مَن يَشَاءُ مِنْ عِبَادِهِ", "tafsir": "بيعهم لأنفسهم للكفر حسداً لأن الوحي نزل على محمد ﷺ من فضل الله.", "irab": "بئس: فعل ذم، بغياً: مفعول لأجله." },
    { "id": 91, "text": "وَإِذَا قِيلَ لَهُمْ آمِنُوا بِمَا أَنزَلَ اللَّهُ قَالُوا نُؤْمِنُ بِمَا أُنزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَاءَهُ وَهُوَ الْحَقُّ مُصَدِّقًا لِّمَا مَعَهُمْ", "tafsir": "رفضهم الإيمان بالقرآن بدعوى الاكتفاء بما أنزل عليهم رغم ثبوت صدق القرآن.", "irab": "نؤمن: فعل مضارع، هو: مبتدأ، الحق: خبر." },
    { "id": 92, "text": "وَلَقَدْ جَاءَكُم مُّوسَىٰ بِالْبَيِّنَاتِ ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِن بَعْدِهِ وَأَنتُمْ ظَالِمُونَ", "tafsir": "تذكير بعبادتهم للعجل رغم رؤيتهم لمعجزات موسى الواضحة الدلالة.", "irab": "موسى: فاعل، العجل: مفعول به." },
    { "id": 93, "text": "وَإِذْ أَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّورَ خُذُوا مَا آتَيْنَاكُم بِقُوَّةٍ وَاسْمَعُوا ۖ قَالُوا سَمِعْنَا وَعَصَيْنَا", "tafsir": "إعلانهم المعصية بعد سماع الميثاق، وتشرب قلوبهم حب العجل بسبب الكفر.", "irab": "خذوا: فعل أمر، عصينا: فعل وفاعل." },
    { "id": 94, "text": "قُلْ إِن كَانَتْ لَكُمُ الدَّارُ الْآخِرَةُ عِندَ اللَّهِ خَالِصَةً مِّن دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِن كُنتُمْ صَادِقِينَ", "tafsir": "تحدي اليهود بتمني الموت إن كانوا فعلاً هم أهل الجنة وحدهم كما يدعون.", "irab": "الدار: اسم كانت، الموت: مفعول به." },
    { "id": 95, "text": "وَلَن يَتَمَنَّوْهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۗ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ", "tafsir": "لن يطلبوا الموت لعلمهم بسوء أعمالهم وخوفهم من الحساب والجزاء.", "irab": "لن: ناصب، أيديهم: فاعل." },
    { "id": 96, "text": "وَلَتَجِدَنَّهُمْ أَحْرَصَ النَّاسُ عَلَىٰ حَيَاةٍ وَمِنَ الَّذِينَ أَشْرَكُوا ۚ يَوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ أَلْفَ سَنَةٍ وَمَا هُوَ بِمُزَحْزِحِهِ مِنَ الْعَذَابِ أَن يُعَمَّرَ ۗ وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ", "tafsir": "حرصهم الشديد على الدنيا وخوفهم من الموت لعلمهم بسوء المصير.", "irab": "أحرص: مفعول به ثانٍ، الله: مبتدأ، بصير: خبر." },
    { "id": 97, "text": "قُلْ مَن كَانَ عَدُوًّا لِّجِبْرِيلَ فَإِنَّهُ نَزَّلَهُ عَلَىٰ قَلْبِكَ بِإِذْنِ اللَّهِ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَهُدًى وَبُشْرَىٰ لِلْمُؤْمِنِينَ", "tafsir": "الرد على من عادى جبريل، وتأكيد أنه نزل بالقرآن هدى وبشرى بأمر الله.", "irab": "جبريل: اسم مجرور، مصدقاً: حال." },
    { "id": 98, "text": "مَن كَانَ عَدُوًّا لِّلَّهِ وَمَلَائِكَتِهِ وَرُسُلِهِ وَجِبْرِيلَ وَمِيكَالَ فَإِنَّ اللَّهَ عَدُوٌّ لِّلْكَافِرِينَ", "tafsir": "وعيد الله لمن يعادي ملائكته ورسله، فمن عاداهم فقد عادى الله.", "irab": "عدواً: خبر كان، الله: اسم إن." },
    { "id": 99, "text": "وَلَقَدْ أَنزَلْنَا إِلَيْكَ آيَاتٍ بَيِّنَاتٍ ۖ وَمَا يَكْفُرُ بِهَا إِلَّا الْفَاسِقُونَ", "tafsir": "وضوح الآيات القرآنية، وأنه لا يجحدها إلا الخارجون عن الطاعة.", "irab": "آيات: مفعول به منصوب، الفاسقون: فاعل." },
    { "id": 100, "text": "أَوَكُلَّمَا عَاهَدُوا عَهْدًا نَّبَذَهُ فَرِيقٌ مِّنْهُم ۚ بَلْ أَكْثَرُهُمْ لَا يُؤْمِنُونَ", "tafsir": "نقضهم المتكرر للعهود وعدم إيمان أكثرهم بصدق المواثيق.", "irab": "عهداً: مفعول به، فريق: فاعل." }    { "id": 101, "text": "وَلَمَّا جَاءَهُمْ رَسُولٌ مِّنْ عِندِ اللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ نَبَذَ فَرِيقٌ مِّنَ الَّذِينَ أُوتُوا الْكِتَابَ كِتَابَ اللَّهِ وَرَاءَ ظُهُورِهِمْ كَأَنَّهُمْ لَا يَعْلَمُونَ", "tafsir": "إعراض علماء أهل الكتاب عن القرآن ونبذه رغم علمهم بصدقه وأنه يوافق ما عندهم.", "irab": "رسول: فاعل، مصدق: نعت، فريق: فاعل، كتاب الله: مفعول به." },
    { "id": 102, "text": "وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَىٰ مُلْكِ سُلَيْمَانَ ۖ وَمَا كَفَرَ سُلَيْمَانُ وَلَٰكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ", "tafsir": "قصة السحر في عهد سليمان وتبرئة الله له، وبيان أن الشياطين هم من علموا الناس السحر والفتنة.", "irab": "الشياطين: فاعل، السحر: مفعول به ثانٍ، هاروت: بدل." },
    { "id": 103, "text": "وَلَوْ أَنَّهُمْ آمَنُوا وَاتَّقَوْا لَمَثُوبَةٌ مِّنْ عِندِ اللَّهِ خَيْرٌ ۖ لَّوْ كَانُوا يَعْلَمُونَ", "tafsir": "لو أنهم اتبعوا الإيمان والتقوى لكان ثواب الله لهم خيراً من السحر الذي اتبعوه.", "irab": "آمنوا: فعل وفاعل، مثوبة: مبتدأ، خير: خبر." },
    { "id": 104, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقُولُوا رَاعِنَا وَقُولُوا انظُرْنَا وَاسْمَعُوا ۗ وَلِلْكَافِرِينَ عَذَابٌ أَلِيمٌ", "tafsir": "أدب خطاب النبي ﷺ واجتناب الألفاظ التي يحتملها السب (مثل راعنا) واستبدالها بـ (انظرنا).", "irab": "لا: ناهية، تقولوا: مضارع مجزوم، انظرنا: فعل أمر." },
    { "id": 105, "text": "مَّا يَوَدُّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَلَا الْمُشْرِكِينَ أَن يُنَزَّلَ عَلَيْكُم مِّنْ خَيْرٍ مِّن رَّبِّكُمْ", "tafsir": "حسد الكفار والمشركين للمسلمين وتمنيهم عدم نزول الوحي والخير عليهم.", "irab": "الذين: فاعل، أن ينزل: مصدر مؤول فاعل يود." },
    { "id": 106, "text": "۞ مَا نَنسَخْ مِنْ آيةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍ مِّنْهَا أَوْ مِثْلِهَا ۗ أَلَمْ تَعْلَمْ أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ", "tafsir": "حكمة النسخ في الآيات والأحكام وتبديلها بما هو أنفع للعباد بقدرة الله.", "irab": "ما: اسم شرط، ننسخ: فعل الشرط، نأتِ: جواب الشرط." },
    { "id": 107, "text": "أَلَمْ تَعْلَمْ أَنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ", "tafsir": "تأكيد ملك الله المطلق للكون وتصرفه فيه، وأنه لا ولي ولا ناصر للعباد سواه.", "irab": "ألم تعلم: استفهام ونفي، ملك: مبتدأ، ولي: مبتدأ مؤخر." },
    { "id": 108, "text": "أَمْ تُرِيدُونَ أَن تَسْأَلُوا رَسُولَكُمْ كَمَا سُئِلَ مُوسَىٰ مِن قَبْلُ ۗ وَمَن يَتَبَدَّلِ الْكُفْرَ بِالْإِيمَانِ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ", "tafsir": "النهي عن كثرة السؤال والتعنت مع الرسول ﷺ كما فعل بنو إسرائيل مع موسى.", "irab": "أن تسألوا: مفعول به، موسى: نائب فاعل، السبيل: مضاف إليه." },
    { "id": 109, "text": "وَدَّ كَثِيرٌ مِّن أَهْلِ الْكِتَابِ لَوْ يَرُدُّونَكُم مِّن بَعْدِ إِيمَانِكُمْ كُفَّارًا حَسَدًا مِّنْ عِندِ أَنفُسِهِم", "tafsir": "رغبة أهل الكتاب في رد المسلمين للكفر حسداً، والأمر بالعفو عنهم حتى يأتي أمر الله.", "irab": "ود: فعل، كثير: فاعل، كفاراً: حال، حسداً: مفعول لأجله." },
    { "id": 110, "text": "وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ ۚ وَمَا تُقَدِّمُوا لِأَنفُسِكُم مِّنْ خَيْرٍ تَجِدُوهُ عِندَ اللَّهِ", "tafsir": "الأمر بالعبادة والعمل الصالح الذي يجد العبد ثوابه مدخراً عند ربه.", "irab": "أقيموا: فعل أمر، ما: اسم شرط، تجدوه: جواب الشرط." },
    { "id": 111, "text": "وَقَالُوا لَن يَدْخُلَ الْجَنَّةَ إِلَّا مَن كَانَ هُودًا أَوْ نَصَارَىٰ ۗ تِلْكَ أَمَانِيُّهُمْ ۗ قُلْ هَاتُوا بُرْهَانَكُمْ", "tafsir": "ادعاؤهم الباطل بأن الجنة حكر عليهم، والمطالبة بالدليل الصادق على ذلك.", "irab": "يدخل: مضارع منصوب، الجنة: مفعول به، برهانكم: مفعول به." },
    { "id": 112, "text": "بَلَىٰ مَنْ أَسْلَمَ وَجْهَهُ لِلَّهِ وَهُوَ مُحْسِنٌ فَلَهُ أَجْرُهُ عِندَ رَبِّهِ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ", "tafsir": "شرط النجاة والجنة: الإخلاص لله (إسلام الوجه) واتباع السنة (الإحسان).", "irab": "من: اسم شرط، وجهه: مفعول به، أجره: مبتدأ مؤخر." },
    { "id": 113, "text": "وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَىٰ عَلَىٰ شَيْءٍ وَقَالَتِ النَّصَارَىٰ لَيْسَتِ الْيَهُودُ عَلَىٰ شَيْءٍ", "tafsir": "تبادل الاتهامات بين أهل الكتاب رغم قراءتهم للكتب السماوية، والله يحكم بينهم.", "irab": "اليهود: فاعل، النصارى: اسم ليس، شيء: اسم مجرور." },
    { "id": 114, "text": "وَمَنْ أَظْلَمُ مِمَّن مَّنَعَ مَسَاجِدَ اللَّهِ أَن يُذْكَرَ فِيهَا اسْمُهُ وَسَعَىٰ فِي خَرَابِهَا", "tafsir": "أشد الناس ظلماً هم من يمنعون الصلاة في المساجد ويسعون لخرابها الحسي والمعنوي.", "irab": "من: مبتدأ، أظلم: خبر، مساجد: مفعول به." },
    { "id": 115, "text": "وَلِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ ۚ فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ ۚ إِنَّ اللَّهَ وَاسِعٌ عَلِيمٌ", "tafsir": "الأرض كلها ملك لله، والقبلة حيثما أمر الله فثمة وجهه الكريم.", "irab": "لله: خبر مقدم، المشرق: مبتدأ، أينما: اسم شرط." },
    { "id": 116, "text": "وَقَالُوا اتَّخَذَ اللَّهُ وَلَدًا ۗ سُبْحَانَهُ ۖ بَل لَّهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ كُلٌّ لَّهُ قَانِتُونَ", "tafsir": "تنزيه الله عن اتخاذ الولد، وتأكيد ملكه وخضوع كل الكائنات له.", "irab": "اتخذ: فعل، ولداً: مفعول به، سبحانه: مفعول مطلق." },
    { "id": 117, "text": "بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ ۖ وَإِذَا قضَىٰ أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُن فَيَكُونُ", "tafsir": "خالق الكون ومبدعه على غير مثال سابق، وأمره نافذ بكلمة (كن).", "irab": "بديع: خبر لمبتدأ محذوف، أمراً: مفعول به، يكون: مضارع." },
    { "id": 118, "text": "وَقَالَ الَّذِينَ لَا يَعْلَمُونَ لَوْلَا يُكَلِّمُنَا اللَّهُ أَوْ تَأْتِينَا آيةٌ", "tafsir": "طلبات الجهلة برؤية معجزات خاصة أو سماع كلام الله مباشرة كما فعل من قبلهم.", "irab": "الذين: فاعل، يكلمنا: فعل، الله: فاعل، آية: فاعل." },
    { "id": 119, "text": "إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا ۖ وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ", "tafsir": "مهمة الرسول ﷺ هي التبشير بالجنة والإنذار من النار بالصدق والحق.", "irab": "أرسلناك: فعل وفاعل ومفعول به، بشيراً: حال." },
    { "id": 120, "text": "وَلَن تَرْضَىٰ عَنكَ الْيَهُودُ وَلَا النَّصَارَىٰ حَتَّىٰ تَتَّبِعَ مِلَّتَهُمْ", "tafsir": "تنبيه للرسول ﷺ بأن أهل الكتاب لن يرضوا عنه حتى يترك دينه ويتبع أهواءهم.", "irab": "لن: ناصب، ترضى: مضارع منصوب، اليهود: فاعل." }
    { "id": 121, "text": "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَتْلُونَهُ حَقَّ تِلَاوَتِهِ أُولَٰئِكَ يُؤْمِنُونَ بِهِ ۗ وَمَن يَكْفُرْ بِهِ فَأُولَٰئِكَ هُمُ الْخَاسِرُونَ", "tafsir": "الذين يقرأون كتبهم بصدق ويتبعون ما فيها يؤمنون بالقرآن، ومن جحد به فقد خسر نفسه.", "irab": "الذين: مبتدأ، يتلونه: جملة حالية، أولئك: مبتدأ ثانٍ، الخاسرون: خبر." },
    { "id": 122, "text": "يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَنِّي فَضَّلْتُكُمْ عَلَى الْعَالَمِينَ", "tafsir": "تكرار التذكير لبني إسرائيل بنعم الله وتفضيلهم على عالمي زمانهم لإقامة الحجة.", "irab": "يا بني: منادى، اذكروا: فعل أمر، نعمتي: مفعول به." },
    { "id": 123, "text": "وَاتَّقُوا يَوْمًا لَّا تَجْزِي نَفْسٌ عَن نَّفْسٍ شَيْئًا وَلَا يُقْبَلُ مِنْهَا عَدْلٌ وَلَا تَنفَعُهَا شَفَاعَةٌ وَلَا هُمْ يُنصَرُونَ", "tafsir": "التحذير من أهوال يوم القيامة حيث لا تنفع فدية ولا وساطة ولا ناصر من دون الله.", "irab": "اتقوا: فعل أمر، يوماً: مفعول به، نفس: فاعل، عدل: نائب فاعل." },
    { "id": 124, "text": "۞ وَإِذِ ابْتَلَىٰ إِبْرَاهِيمَ رَبُّهُ بِكَلِمَاتٍ فَأَتَمَّهُنَّ ۖ قَالَ إِنِّي جَاعِلُكَ لِلنَّاسِ إِمَامًا", "tafsir": "اختبار الله لإبراهيم عليه السلام بالأوامر فأتمها، فجعله الله قدوة وإماماً للناس.", "irab": "ابتلى: فعل ماض، إبراهيم: مفعول به مقدم، ربه: فاعل مؤخر، إماماً: مفعول به ثانٍ." },
    { "id": 125, "text": "وَإِذْ جَعَلْنَا الْبَيْتَ مَثَابَةً لِّلنَّاسِ وَأَمْنًا وَاتَّخِذُوا مِن مَّقَامِ إِبْرَاهِيمَ مُصَلًّى", "tafsir": "جعل الكعبة مرجعاً للناس وأمناً، والأمر باتخاذ مكان وقوف إبراهيم مكاناً للصلاة.", "irab": "جعلنا: فعل وفاعل، البيت: مفعول به أول، مثابة: مفعول به ثانٍ." },
    { "id": 126, "text": "وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَٰذَا بَلَدًا آمِنًا وَارْزُقْ أَهْلَهُ مِنَ الثَّمَرَاتِ مَنْ آمَنَ مِنْهُم بِاللَّهِ", "tafsir": "دعاء إبراهيم لمكة بالأمن والرزق الطيب للمؤمنين خاصة.", "irab": "اجعل: فعل أمر، هذا: مفعول به أول، بلداً: مفعول به ثانٍ، آمناً: نعت." },
    { "id": 127, "text": "وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ", "tafsir": "بناء الكعبة بيد إبراهيم وإسماعيل عليهما السلام ودعاؤهما لله بالقبول.", "irab": "يرفع: فعل مضارع، إبراهيم: فاعل، القواعد: مفعول به، إسماعيل: معطوف." },
    { "id": 128, "text": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا", "tafsir": "دعاء بالثبات على الإسلام وطلب معرفة شعائر الحج والتوبة من التقصير.", "irab": "اجعلنا: فعل ومفعول به، مسلمين: مفعول به ثانٍ، مناسكنا: مفعول به." },
    { "id": 129, "text": "رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِكَ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُزَكِّيهِمْ", "tafsir": "دعاء إبراهيم ببعثة النبي محمد ﷺ في أهل مكة لتعليمهم وتطهير نفوسهم.", "irab": "ابعث: فعل أمر، رسولاً: مفعول به، آياتك: مفعول به، يزكيهم: مضارع." },
    { "id": 130, "text": "وَمَن يَرْغَبُ عَن مِّلَّةِ إِبْرَاهِيمَ إِلَّا مَن سَفِهَ نَفْسَهُ ۚ وَلَقَدِ اصْطَفَيْنَاهُ فِي الدُّنْيَا", "tafsir": "لا يترك دين إبراهيم (التوحيد) إلا الجاهل الأحمق، فإبراهيم مختار ومصطفى عند الله.", "irab": "من: اسم استفهام، ملة: اسم مجرور، نفسه: مفعول به، اصطفيناه: فعل وفاعل ومفعول به." },
    { "id": 131, "text": "إِذْ قَالَ لَهُ رَبُّهُ أَسْلِمْ ۖ قَالَ أَسْلَمْتُ لِرَبِّ الْعَالَمِينَ", "tafsir": "سرعة استجابة إبراهيم لأمر ربه بالانقياد والتوحيد لله خالق كل شيء.", "irab": "قال: فعل ماض، له: جار ومجرور، أسلم: فعل أمر، أسلمت: فعل وفاعل." },
    { "id": 132, "text": "وَوَصَّىٰ بِهَا إِبْرَاهِيمُ بَنِيهِ وَيَعْقُوبُ يَا بَنِيَّ إِنَّ اللَّهَ اصْطَفَىٰ لَكُمُ الدِّينَ فَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ", "tafsir": "وصية إبراهيم ويعقوب لأبنائهما بالتمسك بالإسلام والثبات عليه حتى الموت.", "irab": "وصى: فعل ماض، بنيه: مفعول به، الله: اسم إن، مسلمون: خبر المبتدأ." },
    { "id": 133, "text": "أَمْ كُنتُمْ شُهَدَاءَ إِذْ حَضَرَ يَعْقُوبَ الْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِن بَعْدِي", "tafsir": "سؤال يعقوب لأبنائه عند موته ليتطمن على توحيدهم لله، فأكدوا اتباعهم لدين آبائهم.", "irab": "كنتم: كان واسمها، شهداء: خبرها، يعقوب: مفعول به مقدم، الموت: فاعل مؤخر." },
    { "id": 134, "text": "تِلْكَ أُمَّةٌ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ ۖ وَلَا تُسْأَلُونَ عَمَّا كَانُوا يَعْمَلُونَ", "tafsir": "كل أمة تجازى بعملها، ولن تنفعكم أنسابكم السابقة دون عمل صالح منكم.", "irab": "تلك: مبتدأ، أمة: خبر، خلت: فعل ماض، كسبت: فعل وفاعل." },
    { "id": 135, "text": "وَقَالُوا كُونُوا هُودًا أَوْ نَصَارَىٰ تَهْتَدُوا ۗ قُلْ بَلْ مِلَّةَ إِبْرَاهِيمَ حنيفًا ۖ وَمَا كَانَ مِنَ الْمُشْرِكِينَ", "tafsir": "دعوة أهل الكتاب لاتباع أديانهم، والرد بوجوب اتباع ملة إبراهيم الموحدة لله.", "irab": "كونوا: فعل أمر ناقص، هوداً: خبرها، تهتدوا: جواب الطلب، حنيفاً: حال." },
    { "id": 136, "text": "قُولُوا آمَنَّا بِاللَّهِ وَمَا أُنزِلَ إِلَيْنَا وَمَا أُنزِلَ إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ", "tafsir": "إعلان الإيمان بجميع الأنبياء وما أنزل الله عليهم من وحي دون تفرقة بينهم.", "irab": "قولوا: فعل أمر، آمنا: فعل وفاعل، الله: اسم مجرور، أنزل: فعل مبني للمجهول." },
    { "id": 137, "text": "فَإِنْ آمَنُوا بِمِثْلِ مَا آمَنتُم بِهِ فَقَدِ اهْتَدَوا ۖ وَّإِن تَوَلَّوْا فَإِنَّمَا هُمْ فِي شِقَاقٍ ۖ فَسَيَكْفِيكَهُمُ اللَّهُ", "tafsir": "الهداية في الإيمان كما آمن الصحابة، ومن أعرض فهو في عداء، والله كافيك شرهم.", "irab": "آمنوا: فعل ماض، اهتدوا: جواب الشرط، هم: مبتدأ، الله: فاعل يكفي." },
    { "id": 138, "text": "صِبْغَةَ اللَّهِ ۖ وَمَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً ۖ وَنحنُ لَهُ عَابِدُونَ", "tafsir": "دين الله هو الفطرة والصبغة الحقيقية للروح، ولا أحسن من منهج الله.", "irab": "صبغة: مفعول مطلق لفعل محذوف، من: اسم استفهام مبتدأ، عابدون: خبر." },
    { "id": 139, "text": "قُلْ أَتُحَاجُّونَنَا فِي اللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ وَنَحْنُ لَهُ مُخْلِصُونَ", "tafsir": "الرد على مجادلة أهل الكتاب؛ فالله رب الجميع، وكل أمة تجازى بعملها الخاص.", "irab": "أتحاجوننا: همزة استفهام وفعل ومفعول به، أعمالنا: مبتدأ مؤخر، مخلصون: خبر." },
    { "id": 140, "text": "أَمْ تَقُولُونَ إِنَّ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطَ كَانُوا هُودًا أَوْ نَصَارَىٰ", "tafsir": "إنكار ادعاء أهل الكتاب بأن الأنبياء السابقين كانوا على أديانهم المحرفة.", "irab": "إن: حرف ناسخ، إبراهيم: اسمها، كانوا: كان واسمها، هوداً: خبر كان." }
    { "id": 141, "text": "تِلْكَ أُمَّةٌ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ ۖ وَلَا تُسْأَلُونَ عَمَّا كَانُوا يَعْمَلُونَ", "tafsir": "تأكيد أن كل أمة مسؤولة عن عملها، ولا يغني عمل الآباء عن الأبناء شيئاً.", "irab": "تلك: مبتدأ، أمة: خبر، لها: خبر مقدم، ما: مبتدأ مؤخر." },
    { "id": 142, "text": "۞ سَيَقُولُ السُّفَهَاءُ مِنَ النَّاسِ مَا وَلَّاهُمْ عَن قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا", "tafsir": "بداية الحديث عن تحويل القبلة والرد على اعتراض الجهلة من اليهود والمشركين.", "irab": "السفهاء: فاعل، ما: اسم استفهام مبتدأ، ولاهم: جملة الخبر." },
    { "id": 143, "text": "وَكَذَٰلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِّتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا", "tafsir": "تشريف الأمة الإسلامية بالعدل والخيرية لتكون شاهدة على الأمم يوم القيامة.", "irab": "جعلناكم: فعل وفاعل ومفعول به، وسطاً: نعت، شهداء: خبر تكون." },
    { "id": 144, "text": "قَدْ نَرَىٰ تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ ۖ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا ۚ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ", "tafsir": "استجابة الله لرغبة النبي ﷺ بتحويل القبلة من بيت المقدس إلى الكعبة.", "irab": "نرى: فعل مضارع، وجهك: مضاف إليه، شطر: ظرف مكان." },
    { "id": 145, "text": "وَلَئِنْ أَتَيْتَ الَّذِينَ أُوتُوا الْكِتَابَ بِكُلِّ آيَةٍ مَّا تَبِعُوا قِبْلَتَكَ ۚ وَمَا أَنتَ بِتَابِعٍ قِبْلَتَهُمْ", "tafsir": "بيان عناد أهل الكتاب وأنهم لن يتبعوا قبلة المسلمين مهما كانت الأدلة.", "irab": "الذين: مفعول به، آية: اسم مجرور، قبلتك: مفعول به." },
    { "id": 146, "text": "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَعْرِفُونَهُ كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ ۖ وَإِنَّ فَرِيقًا مِّنْهُمْ لَيَكْتُمُونَ الْحَقَّ", "tafsir": "علماء أهل الكتاب يعرفون صدق النبي ﷺ وتغيير القبلة كما يعرفون أبناءهم.", "irab": "يعرفونه: فعل وفاعل ومفعول به، الحق: مفعول به." },
    { "id": 147, "text": "الْحَقُّ مِن رَّبِّكَ ۖ فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ", "tafsir": "تأكيد أن ما جاء من الوحي هو الحق الذي لا شك فيه، والنهي عن التردد.", "irab": "الحق: مبتدأ، من ربك: خبر، لا: ناهية، تكونن: مضارع مبني." },
    { "id": 148, "text": "وَلِكُلٍّ وِجْهَةٌ هُهوُ مُوَلِّيهَا ۖ فَاسْتَبِقُوا الْخَيْرَاتِ ۚ أَيْنَ مَا تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعًا", "tafsir": "لكل أمة قبلة، والمهم هو المسارعة في الطاعات لأن المرجع لله وحده.", "irab": "لكل: خبر مقدم، وجهة: مبتدأ مؤخر، الله: فاعل يأتِ." },
    { "id": 149, "text": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۖ وَإِنَّهُ لَلْحَقُّ مِن رَّبِّكَ", "tafsir": "تأكيد وجوب التوجه للكعبة عند الخروج للسفر أو أي مكان.", "irab": "ولّ: فعل أمر، وجهك: مفعول به، المسجد: مضاف إليه." },
    { "id": 150, "text": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۚ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ", "tafsir": "تكرار الأمر بالقبلة لقطع حجة المعاندين وإتمام النعمة على المؤمنين.", "irab": "كنتم: كان واسمها، وجوهكم: مفعول به، شطره: ظرف." },
    { "id": 151, "text": "كَمَا أَرْسَلْنَا فِيكُمْ رَسُولًا مِّنكُمْ يَتْلُو عَلَيْكُمْ آيَاتِنَا وَيُزَكِّيكُمْ وَيُعَلِّمُكُمُ الْكِتَابَ وَالْحِكْمَةَ", "tafsir": "تذكير بمنة الله بإرسال النبي ﷺ لتعليم الناس وتطهير نفوسهم.", "irab": "رسولاً: مفعول به، يتلو: فعل مضارع، آياتنا: مفعول به." },
    { "id": 152, "text": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ", "tafsir": "الأمر بذكر الله بالقلب واللسان، وشكره على نعمه، والنهي عن الجحود.", "irab": "اذكروني: فعل أمر وفاعل ومفعول به، أذكركم: جواب الطلب." },
    { "id": 153, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ", "tafsir": "إرشاد المؤمنين لطلب العون من الله بالصبر على البلاء وأداء الصلاة.", "irab": "استعينوا: فعل أمر، بالصبر: جار ومجرور، الله: اسم إن." },
    { "id": 154, "text": "وَلَا تَقُولُوا لِمَن يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ ۚ بَلْ أَحْيَاءٌ وَلَٰكِن لَّا تَشْعُرُونَ", "tafsir": "الشهداء أحياء عند ربهم حياة برزخية لا يدركها الأحياء في الدنيا.", "irab": "لا: ناهية، أموات: خبر لمبتدأ محذوف تقديره (هم)." },
    { "id": 155, "text": "وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ", "tafsir": "سنة الله في اختبار المؤمنين بمختلف أنواع الابتلاءات لتمحيصهم.", "irab": "نبلونكم: مضارع مبني، الصابرين: مفعول به منصوب بالياء." },
    { "id": 156, "text": "الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ", "tafsir": "صفة الصابرين هي التسليم لله والاعتراف بأنه المالك والمرجع.", "irab": "أصابتهم: فعل ومفعول به، مصيبة: فاعل، إنا: إن واسمها." },
    { "id": 157, "text": "أُولَٰئِكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ ۖ وَأُولَٰئِكَ هُمُ الْمُهْتَدُونَ", "tafsir": "جزاء الصابرين عند الله: الثناء والرحمة والهداية لطريق الحق.", "irab": "صلوات: مبتدأ مؤخر، ربهم: مضاف إليه، المهتدون: خبر." },
    { "id": 158, "text": "۞ إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّهِ ۖ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ", "tafsir": "بيان أن السعي بين الصفا والمروة من معالم دين الله وشعائر الحج والعمرة.", "irab": "الصفا: اسم إن، شعائر: اسم مجرور، من: اسم شرط." },
    { "id": 159, "text": "إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنزَلْنَا مِنَ الْبَيِّنَاتِ وَالْهُدَىٰ مِن بَعْدِ مَا بَيَّنَّاهُ لِلنَّاسِ", "tafsir": "وعيد شديد لمن يخفي العلم والهدى الذي أنزله الله في الكتب السماوية.", "irab": "الذين: اسم إن، يكتمون: صلة الموصول، البينات: مفعول به." },
    { "id": 160, "text": "إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَبَيَّنُوا فَأُولَٰئِكَ أَتُوبُ عَلَيْهِمْ ۚ وَأَنَا التَّوَّابُ الرَّحِيمُ", "tafsir": "فتح باب التوبة لمن كتم الحق بشرط الإصلاح والبيان لما أخفاه.", "irab": "تابوا: فعل وفاعل، أولئك: مبتدأ، أنا: مبتدأ، التواب: خبر." }
    { "id": 161, "text": "إِنَّ الَّذِينَ كَفَرُوا وَمَاتُوا وَهُمْ كُفَّارٌ أُولَٰئِكَ عَلَيْهِمْ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ", "tafsir": "من أصر على كفره حتى الموت استحق اللعنة والطرد من رحمة الله من الجميع.", "irab": "الذين: اسم إن، كفروا: صلة الموصول، وهم كفار: جملة حالية." },
    { "id": 162, "text": "خَالِدِينَ فِيهَا ۖ لَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ يُنظَرُونَ", "tafsir": "بقاء الكفار في اللعنة والعذاب أبداً دون تخفيف أو إمهال.", "irab": "خالدين: حال، العذاب: نائب فاعل، ينظرون: مضارع مبني للمجهول." },
    { "id": 163, "text": "وَإِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ ۖ لَّا إِلَٰهَ إِلَّا هُوَ الرَّحْمَنُ الرَّحِيمُ", "tafsir": "تأكيد وحدانية الله المطلقة، المتفرد بالرحمة الواسعة لكل خلقه.", "irab": "إلهكم: مبتدأ، واحد: خبر، هو: بدل من الضمير المستتر." },
    { "id": 164, "text": "إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنفَعُ النَّاسَ", "tafsir": "الأدلة الكونية الظاهرة على وجود الخالق وقدرته وحكمته في تدبير الكون.", "irab": "في خلق: خبر إن مقدم، آيات: اسم إن مؤخر، الناس: مفعول به." },
    { "id": 165, "text": "وَمِنَ النَّاسِ مَن يَتَّخِذُ مِن دُونِ اللَّهِ أَندَادًا يُحِبُّونَهُمْ كَحُبِّ اللَّهِ ۖ وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِّلَّهِ", "tafsir": "ذم المشركين الذين يسوون غير الله به في المحبة، وتأكيد أن المؤمنين يخلصون حبهم لله.", "irab": "من الناس: خبر مقدم، أنداداً: مفعول به، حباً: تمييز." },
    { "id": 166, "text": "إِذْ تَبَرَّأَ الَّذِينَ اتُّبِعُوا مِنَ الَّذِينَ اتَّبَعُوا وَرَأَوُا الْعَذَابَ وَتَقَطَّعَتْ بِهِمُ الْأَسْبَابُ", "tafsir": "تبرؤ القادة من أتباعهم يوم القيامة عند رؤية العذاب وانقطاع كل صلاتهم.", "irab": "تتبرأ: فعل، الذين: فاعل، العذاب: مفعول به." },
    { "id": 167, "text": "وَقَالَ الَّذِينَ اتَّبَعُوا لَوْ أَنَّ لَنَا كَرَّةً فَنَتَبَرَّأَ مِنْهُمْ كَمَا تَبَرَّءُوا مِنَّا", "tafsir": "ندم الأتباع وتمنيهم العودة للدنيا ليتبرأوا من متبوعيهم كما فعلوا بهم.", "irab": "لو: حرف تمنٍ، كرة: اسم أن مؤخر، نتبرأ: مضارع منصوب." },
    { "id": 168, "text": "يَا أَيُّهَا النَّاسُ كُلُوا مِمَّا فِي الْأَرْضِ حَلَالًا طَيِّبًا وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ ۚ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ", "tafsir": "إباحة الطيبات من الرزق والتحذير من مكائد الشيطان في التحريم والتحليل.", "irab": "كلوا: فعل أمر، حلالاً: حال، الشيطان: مضاف إليه." },
    { "id": 169, "text": "إِنَّمَا يَأْمُرُكُم بِالسُّوءِ وَالْفَحْشَاءِ وَأَن تَقُولُوا عَلَى اللَّهِ مَا لَا تَعْلَمُونَ", "tafsir": "أهداف الشيطان: دفع العباد للذنوب القبيحة والقول على الله بغير علم.", "irab": "يأمركم: فعل ومفعول به، أن تقولوا: مصدر مؤول." },
    { "id": 170, "text": "وَإِذَا قِيلَ لَهُمُ اتَّبِعُوا مَا أَنزَلَ اللَّهُ قَالُوا بَلْ نَتَّبِعُ مَا أَلْفَيْنَا عَلَيْهِ آبَاءَنَا", "tafsir": "عناد الكفار وتقليدهم الأعمى لآبائهم ورفضهم لاتباع الوحي الإلهي.", "irab": "قيل: مبني للمجهول، نتبع: مضارع، آباءنا: مفعول به." },
    { "id": 171, "text": "وَمَثَلُ الَّذِينَ كَفَرُوا كَمَثَلِ الَّذِي يَنْعِقُ بِمَا لَا يَسْمَعُ إِلَّا دُعَاءً وَنِدَاءً ۚ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ", "tafsir": "مثل الكفار في دعائهم كمثل الغنم التي تسمع صوت الراعي ولا تفقه معناه.", "irab": "مثل: مبتدأ، الذي: مضاف إليه، صم: خبر لمبتدأ محذوف." },
    { "id": 172, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُوا لِلَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ", "tafsir": "الأمر بالتمتع بالرزق الحلال وشكر الله عليه كشرط للعبادة الحقة.", "irab": "الذين: فاعل، طيبات: اسم مجرور، إياه: مفعول به مقدم." },
    { "id": 173, "text": "إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنزِيرِ وَمَا أُهِلَّ بِهِ لِغَيْرِ اللَّهِ", "tafsir": "بيان المحرمات من اللحوم، والرخصة في أكلها للمضطر لإنقاذ حياته.", "irab": "حرم: فعل، الميتة: مفعول به، لغير الله: جار ومجرور." },
    { "id": 174, "text": "إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنزَلَ اللَّهُ مِنَ الْكِتَابِ وَيَشْتَرُونَ بِهِ ثَمَنًا قَلِيلًا ۙ أُولَٰئِكَ مَا يَأْكُلُونَ فِي بُطُونِهِمْ إِلَّا النَّارَ", "tafsir": "وعيد من يخفون الحق لأجل الدنيا؛ فإن ما يجمعونه هو نار تحرقهم.", "irab": "أنزل الله: صلة الموصول، ثمناً: مفعول به، النار: مفعول به." },
    { "id": 175, "text": "أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ وَالْعَذَابَ بِالْمَغْفِرَةِ ۚ فَمَا أَصْبَرَهُمْ عَلَى النَّارِ", "tafsir": "هؤلاء استبدلوا الهداية بالضلال والمغفرة بالعذاب، فما أجرأهم على فعل ما يدخلهم النار.", "irab": "اشتروا: فعل وفاعل، الضلالة: مفعول به، ما أصبرهم: فعل تعجب." },
    { "id": 176, "text": "ذَٰلِكَ بِأَنَّ اللَّهَ نَزَّلَ الْكِتَابَ بِالْحَقِّ ۗ وَإِنَّ الَّذِينَ اخْتَلَفُوا فِي الْكِتَابِ لَفِي شِقَاقٍ بَعِيدٍ", "tafsir": "الله أنزل القرآن ثابتاً بالحق، ومن جادوا فيه هم في نزاع عميق.", "irab": "نزل: فعل، الكتاب: مفعول به، الذين: اسم إن." },
    { "id": 177, "text": "۞ لَّيْسَ الْبِرَّ أَن تُوَلُّوا وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَٰكِنَّ الْبِرَّ مَنْ آمَنَ بِاللَّهِ", "tafsir": "البر الحقيقي ليس مجرد المظاهر بل الإيمان الصادق والعمل الصالح والعطاء والوفاء والصبر.", "irab": "ليس: فعل ناقص، البر: اسمها، وجوهكم: مفعول به." },
    { "id": 178, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ القِصَاصُ فِي الْقَتْلَى ۖ الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ", "tafsir": "فرض العدل في القصاص بين الناس، مع الترغيب في العفو والتسامح.", "irab": "كتب: مبني للمجهول، القصاص: نائب فاعل، القتلى: اسم مجرور." },
    { "id": 179, "text": "وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ يَا أُولِي الْأَلْبَابِ لَعَلَّكُمْ تَتَّقُونَ", "tafsir": "في تطبيق شرع الله وحكم القصاص حفظ لأرواح الناس ومنع للقتل.", "irab": "لكم: خبر مقدم، حياة: مبتدأ مؤخر، يا أولي: نداء." },
    { "id": 180, "text": "كُتِبَ عَلَيْكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ إِن تَرَكَ خَيْرًا الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالْأَقْرَبِينَ", "tafsir": "مشروعية الوصية بالمال للأهل عند الموت بالمعروف.", "irab": "الموت: فاعل، الوصية: نائب فاعل، للوالدين: جار ومجرور." }
    { "id": 181, "text": "فَمَن بَدَّلَهُ بَعْدَمَا سَمِعَهُ فَإِنَّمَا إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ", "tafsir": "الإثم يقع على من يغير الوصية بعد علمها، والله مطلع على فعلهم.", "irab": "من: اسم شرط مبتدأ، إثمه: مبتدأ ثانٍ، الله: اسم إن." },
    { "id": 182, "text": "فَمَنْ خَافَ مِن مُّوصٍ جَنَفًا أَوْ إِثْمًا فَأَصْلَحَ بَيْنَهُمْ فَلَا إِثْمَ عَلَيْهِ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "جواز التدخل للإصلاح إذا كانت الوصية فيها ميل عن الحق أو ظلم.", "irab": "خاف: فعل ماض، جنفاً: مفعول به، إثم: اسم لا النافية." },
    { "id": 183, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ", "tafsir": "فرض الصيام على المؤمنين كما فُرض على الأمم السابقة لتحقيق التقوى.", "irab": "كتب: فعل مبني للمجهول، الصيام: نائب فاعل، لعلكم: لعل واسمها." },
    { "id": 184, "text": "أَيَّامًا مَّعْدُودَاتٍ ۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ عَلَىٰ سَفَرٍ فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ", "tafsir": "أحكام الرخصة في الإفطار للمريض والمسافر ووجوب القضاء.", "irab": "أياماً: ظرف زمان، مريضاً: اسم كان، فعدة: مبتدأ لخبر محذوف." },
    { "id": 185, "text": "شَهْرُ رَمَضَانَ الَّذِي أُنزِلَ فِيهِ الْقُرْآنُ هُدًى لِّلنَّاسِ وَبَيِّنَاتٍ مِّنَ الْهُدَىٰ وَالْفُرْقَانِ", "tafsir": "فضل شهر رمضان بنزول القرآن، والأمر بصيامه وإكمال العدة.", "irab": "شهر: مبتدأ، الذي: نعت، القرآن: نائب فاعل، هدى: حال." },
    { "id": 186, "text": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ", "tafsir": "بشارة بقرب الله من عباده واستجابته لدعائهم، وحثهم على الاستجابة له.", "irab": "إني: إن واسمها، قريب: خبر إن، أجيب: فعل مضارع." },
    { "id": 187, "text": "أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَىٰ نِسَائِكُمْ ۚ هُنَّ لِبَاسٌ لَّكُمْ وَأَنتُمْ لِبَاسٌ لَّهُنَّ", "tafsir": "إباحة الجماع والأكل والشرب في ليالي رمضان حتى طلوع الفجر.", "irab": "أحل: فعل مبني للمجهول، الرفث: نائب فاعل، هن: مبتدأ." },
    { "id": 188, "text": "وَلَا تَأْكُلُوا أَمْوَالَكُم بَيْنَكُم بِالْبَاطِلِ وَتُدْلُوا بِهَا إِلَى الْحُكَّامِ لِتَأْكُلُوا فَرِيقًا مِّنْ أَمْوَالِ النَّاسِ", "tafsir": "النهي عن أكل أموال الناس بالظلم أو الرشوة أو الخصومات الباطلة.", "irab": "لا: ناهية، تأكلوا: مضارع مجزوم، أموالكم: مفعول به." },
    { "id": 189, "text": "يَسْأَلُونَكَ عَنِ الْأَهِلَّةِ ۖ قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ وَالْحَجِّ ۗ وَلَيْسَ الْبِرُّ بِأَن تَأْتُوا الْبُيُوتَ مِن ظُهُورِهَا", "tafsir": "الحكمة من الأهلة لمعرفة الزمن، وتصحيح مفاهيم خاطئة عن البر.", "irab": "الأهلة: اسم مجرور، هي: مبتدأ، مواقيت: خبر، البيوت: مفعول به." },
    { "id": 190, "text": "وَقَاتِلُوا فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ وَلَا تَعْتَدُوا ۚ إِنَّ اللَّهَ لَا يُحِبُّ الْمُعْتَدِينَ", "tafsir": "الأمر بقتال المعتدين في سبيل الله والنهي عن تجاوز الحدود والظلم.", "irab": "قاتلوا: فعل أمر، الذين: مفعول به، المعتدين: مفعول به." },
    { "id": 191, "text": "وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأَخْرِجُوهُم مِّنْ حَيْثُ أَخْرَجُوكُمْ ۚ وَالْفِتْنَةُ أَشَدُّ مِنَ الْقَتْلِ", "tafsir": "مشروعية الدفاع عن النفس ومقابلة الاعتداء بمثله، وتأكيد خطر الفتنة.", "irab": "اقتلوهم: فعل وأمر ومفعول به، الفتنة: مبتدأ، أشد: خبر." },
    { "id": 192, "text": "فَإِنِ انتَهَوْا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "إذا توقف الكفار عن قتالكم وعادوا للحق، فإن الله يقبل توبتهم.", "irab": "إن: شرطية، انتهوا: فعل الشرط، الله: اسم إن، غفور: خبرها." },
    { "id": 193, "text": "وَقَاتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ لِلَّهِ ۖ فَإِنِ انتَهَوْا فَلَا عُدْوَانَ إِلَّا عَلَى الظَّالِمِينَ", "tafsir": "القتال لمنع الفتنة وإقامة الدين، والعدل في الكف عمن انتهى.", "irab": "تكون: فعل مضارع، فتنة: فاعل، عدوان: اسم لا." },
    { "id": 194, "text": "الشَّهْرُ الْحَرَامُ بِالشَّهْرِ الْحَرَامِ وَالْحُرُمَاتُ قِصَاصٌ ۚ فَمَنِ اعْتَدَىٰ عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ مَا اعْتَدَىٰ عَلَيْكُمْ", "tafsir": "مقابلة الاعتداء بالمثل حتى في الأشهر الحرم، مع الأمر بتقوى الله.", "irab": "الشهر: مبتدأ، الحرام: نعت، فمن: اسم شرط مبتدأ." },
    { "id": 195, "text": "وَأَنفِقُوا فِي سَبِيلِ اللَّهِ وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ ۛ وَأَحْسِنُوا ۛ إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ", "tafsir": "حث على الإنفاق في سبيل الله والتحذير من ترك الجهاد والنفقة، والأمر بالإحسان.", "irab": "أنفقوا: فعل أمر، بأيديكم: جار ومجرور، المحسنين: مفعول به." },
    { "id": 196, "text": "وَأَتِمُّوا الْحَجَّ وَالْعُمْرَةَ لِلَّهِ ۚ فَإِنْ أُحْصِرْتُمْ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ", "tafsir": "أحكام إتمام الحج والعمرة، وفدية من منع من الإكمال.", "irab": "أتموا: فعل أمر، الحج: مفعول به، الهدي: اسم مجرور." },
    { "id": 197, "text": "الْحَجُّ أَشْهُرٌ مَّعْلُومَاتٌ ۚ فَمَن فَرَضَ فِيهِنَّ الْحَجَّ فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِي الْحَجِّ", "tafsir": "بيان وقت الحج وآدابه بترك اللغو والخصام والمعاصي.", "irab": "الحج: مبتدأ، أشهر: خبر، لا: نافية للجنس." },
    { "id": 198, "text": "لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُوا فَضْلًا مِّن رَّبِّكُمْ ۚ فَإِذَا أَفَضْتُم مِّنْ عَرَفَاتٍ فَاذْكُرُوا اللَّهَ عِندَ الْمَشْعَرِ الْحَرَامِ", "tafsir": "إباحة التجارة في الحج، والأمر بذكر الله عند الانصراف من عرفات.", "irab": "جناح: اسم ليس مؤخر، عرفات: اسم مجرور." },
    { "id": 199, "text": "ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ وَاسْتَغْفِرُوا اللَّهَ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "الأمر بالانصراف مع الناس وطلب المغفرة من الله.", "irab": "أفيضوا: فعل أمر، الناس: فاعل، الله: مفعول به." },
    { "id": 200, "text": "فَإِذَا قَضَيْتُم مَّنَاسِكَكُمْ فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدَّ ذِكْرًا", "tafsir": "حث الحجاج على كثرة ذكر الله بعد تمام الحج بدلاً من التفاخر بالآباء.", "irab": "قضيتم: فعل وفاعل، مناسككم: مفعول به، ذكراً: تمييز." 
      { "id": 201, "text": "وَمِنْهُم مَّن يَقُولُ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ", "tafsir": "دعاء المؤمنين الجامع لخيري الدنيا والآخرة والوقاية من عذاب جهنم.", "irab": "آتنا: فعل دعاء ومفعول به، حسنة: مفعول ثانٍ، النار: مضاف إليه." },
    { "id": 202, "text": "أُولَٰئِكَ لَهُمْ نَصِيبٌ مِّمَّا كَسَبُوا ۚ وَاللَّهُ سَرِيعُ الْحِسَابِ", "tafsir": "هؤلاء لهم ثواب عظيم عند الله جزاء ما عملوا من خير وصالحات.", "irab": "أولئك: مبتدأ، نصيب: مبتدأ ثانٍ مؤخر، الله: مبتدأ، سريع: خبر." },
    { "id": 203, "text": "۞ وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَّعْدُودَاتٍ ۚ فَمَن تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ", "tafsir": "الأمر بذكر الله في أيام التشريق بمنا، وأحكام التعجل والتأخر للمحرم.", "irab": "اذكروا: فعل أمر، أيام: اسم مجرور، من: اسم شرط مبتدأ." },
    { "id": 204, "text": "وَمِنَ النَّاسِ مَن يُعْجِبُكَ قَوْلُهُ فِي الْحَيَاةِ الدُّنْيَا وَيُشْهِدُ اللَّهَ عَلَىٰ مَا فِي قَلْبِهِ", "tafsir": "صفة المنافق الذي يحسن كلامه ويخفي شره وعداءه للإسلام.", "irab": "يعجبك: فعل ومفعول به، قوله: فاعل، الله: مفعول به." },
    { "id": 205, "text": "وَإِذَا تَوَلَّىٰ سَعَىٰ فِي الْأَرْضِ لِيُفْسِدَ فِيهَا وَيُهْلِكَ الْحَرْثَ وَالنَّسْلَ", "tafsir": "المنافق إذا تمكن في الأرض أفسد فيها بالظلم وتخريب معايش الناس.", "irab": "تولى: فعل ماض، يفسد: مضارع منصوب، الحرث: مفعول به." },
    { "id": 206, "text": "وَإِذَا قِيلَ لَهُ اتَّقِ اللَّهَ أَخَذَتْهُ الْعِزَّةُ بِالْإِثْمِ ۚ فَحَسْبُهُ جَهَنَّمُ ۚ وَلَبِئْسَ الْمِهَادُ", "tafsir": "كبر المنافق ورفضه للنصيحة، وجزاؤه نار جهنم وبئس المستقر.", "irab": "اتق: فعل أمر، الله: مفعول به، جهنم: فاعل حسبه، المهاد: فاعل بئس." },
    { "id": 207, "text": "وَمِنَ النَّاسِ مَن يَشْرِي نَفْسَهُ ابْتِغَاءَ مَرْضَاتِ اللَّهِ ۗ وَاللَّهُ رَءُوفٌ بِالْعِبَادِ", "tafsir": "صفة المؤمن الصادق الذي يبيع نفسه لله طلباً لرضاه، والله رحيم بخلقه.", "irab": "من الناس: خبر مقدم، من: مبتدأ مؤخر، ابتغاء: مفعول لأجله." },
    { "id": 208, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا ادْخُلُوا فِي السِّلْمِ كَافَّةً وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ", "tafsir": "الأمر بالدخول في جميع أحكام الإسلام والتحذير من مكايد الشيطان.", "irab": "الذين: نداء، ادخلوا: فعل أمر، كافة: حال، لا: ناهية." },
    { "id": 209, "text": "فَإِن زَلَلْتُم مِّن بَعْدِ مَا جَاءَتْكُمُ الْبَيِّنَاتُ فَاعْلَمُوا أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ", "tafsir": "التحذير من الانحراف عن الحق بعد معرفته، فالله غالب ومنتقم وحكيم.", "irab": "زللتم: فعل وفاعل، الله: اسم أن، عزيز: خبر أن." },
    { "id": 210, "text": "هَلْ يَنظُرُونَ إِلَّا أَن يَأْتِيَهُمُ اللَّهُ فِي ظُلَلٍ مِّنَ الْغَمَامِ وَالْمَلَائِكَةُ", "tafsير": "تهديد الكفار بانتظار يوم القيامة وأهواله وفصل القضاء بينهم.", "irab": "ينظرون: مضارع مرفوع بثبوت النون، الله: فاعل يأتيهم." },
    { "id": 211, "text": "سَلْ بَنِي إِسْرَائِيلَ كَمْ آتَيْنَاهُم مِّنْ آيَةٍ بَيِّنَةٍ ۗ وَمَن يُبَدِّلْ نِعْمَةَ اللَّهِ مِن بَعْدِ مَا جَاءَتْهُ", "tafsir": "سؤال بني إسرائيل عن المعجزات التي رأوها وعقوبة من جحد نعم الله.", "irab": "سل: فعل أمر، بني: مفعول به، من: اسم شرط، نعمة: مفعول به." },
    { "id": 212, "text": "زُيِّنَ لِلَّذِينَ كَفَرُوا الْحَيَاةُ الدُّنْيَا وَيَسْخَرُونَ مِنَ الَّذِينَ آمَنُوا", "tafsir": "افتتان الكفار بالدنيا وسخريتهم من المؤمنين، والمؤمنون فوقهم يوم القيامة.", "irab": "زين: فعل مبني للمجهول، الحياة: نائب فاعل، الدنيا: نعت." },
    { "id": 213, "text": "كَانَ النَّاسُ أُمَّةً وَاحِدَةً فَبَعَثَ اللَّهُ النَّبِيِّينَ مُبَشِّرِينَ وَمُنذِرِينَ", "tafsir": "أصل الناس التوحيد، ثم اختلفوا فأرسل الله الرسل لبيان الحق.", "irab": "الناس: اسم كان، أمة: خبر كان، مبشرين: حال منصوب بالياء." },
    { "id": 214, "text": "أَمْ حَسِبْتُمْ أَن تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ الَّذِينَ خَلَوْا مِن قَبْلِكُم", "tafsir": "تنبيه المؤمنين أن طريق الجنة محفوف بالابتلاءات كما حدث للسابقين.", "irab": "تدخلوا: مضارع منصوب، الجنة: مفعول به، الذين: مضاف إليه." },
    { "id": 215, "text": "يَسْأَلُونَكَ مَاذَا يُنفِقُونَ ۖ قُلْ مَا أَنفَقْتُم مِّنْ خَيْرٍ فَلِلْوَالِدَيْنِ وَالْأَقْرَبِينَ", "tafsir": "بيان مصارف النفقة المستحبة: الوالدان والأقربون واليتامى والمساكين.", "irab": "ماذا: اسم استفهام، أنفقتم: فعل وفاعل، للوالدين: جار ومجرور." },
    { "id": 216, "text": "كُتِبَ عَلَيْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَّكُمْ ۖ وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ", "tafsir": "فرض الجهاد والحكمة في أن الله يعلم عواقب الأمور وأنتم لا تعلمون.", "irab": "كتب: فعل، القتال: نائب فاعل، خير: خبر المبتدأ (هو)." },
    { "id": 217, "text": "يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيهِ ۖ قُلْ قِتَالٌ فِيهِ كَبِيرٌ", "tafsir": "حكم القتال في الأشهر الحرم، وتوضيح أن الصد عن سبيل الله أعظم إثماً.", "irab": "الشهر: اسم مجرور، قتال: خبر، كبير: نعت مرفوع." },
    { "id": 218, "text": "إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ أُولَٰئِكَ يَرْجُونَ رَحْمَتَ اللَّهِ", "tafsir": "بشارة للمهاجرين والمجاهدين بأنهم يستحقون رحمة الله ومغفرته.", "irab": "الذين: اسم إن، أولئك: مبتدأ، يرجون: فعل مضارع خبر." },
    { "id": 219, "text": "يَسْأَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ ۖ قُلْ فِيهِمَا إِثْمٌ كَبِيرٌ وَمَنَافِعُ لِلنَّاسِ", "tafsir": "بداية تحريم الخمر والقمار ببيان ضررهما الأكبر من نفعهما.", "irab": "إثم: مبتدأ مؤخر، كبير: نعت، الناس: اسم مجرور." },
    { "id": 220, "text": "فِي الدُّنْيَا وَالْآخِرَةِ ۗ وَيَسْأَلُونَكَ عَنِ الْيَتَامَىٰ ۖ قُلْ إِصْلَاحٌ لَّهُمْ خَيْرٌ", "tafsir": "حث على رعاية اليتامى وإصلاح شؤونهم والتعاون معهم كإخوة في الدين.", "irab": "إصلاح: مبتدأ، خير: خبر، اليتامى: اسم مجرور." }   
     { "id": 221, "text": "وَلَا تَنكِحُوا الْمُشْرِكَاتِ حَتَّىٰ يُؤْمِنَّ ۚ وَلَأَمَةٌ مُّؤْمِنَةٌ خَيْرٌ مِّن مُّشْرِكَةٍ", "tafsir": "النهي عن زواج المشركات حتى يسلمن، وتفضيل المؤمنة وإن كانت أمة على المشركة.", "irab": "لا: ناهية، تنكحوا: مضارع مجزوم، أمة: مبتدأ، خير: خبر." },
    { "id": 222, "text": "وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ ۖ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ", "tafsir": "أحكام الطهارة من الحيض والنهي عن جماع النساء حتى يطهرن.", "irab": "أذى: خبر، اعتزلوا: فعل أمر، النساء: مفعول به." },
    { "id": 223, "text": "نِسَاؤُكُمْ حَرْثٌ لَّكُمْ فَأْتُوا حَرْثَكُمْ أَنَّىٰ شِئْتُمْ ۖ وَقَدِّمُوا لِأَنفُسِكُمْ", "tafsir": "إباحة الاستمتاع بالزوجة في القبل بأي هيئة، والحث على ذكر الله عند الوقاع.", "irab": "نساؤكم: مبتدأ، حرث: خبر، قدموا: فعل أمر." },
    { "id": 224, "text": "وَلَا تَجْعَلُوا اللَّهَ عُرْضَةً لِّأَيْمَانِكُمْ أَن تَبَرُّوا وَتَتَّقُوا", "tafsir": "النهي عن جعل الحلف بالله مانعاً من فعل الخير والإصلاح بين الناس.", "irab": "لا: ناهية، الله: مفعول به أول، عرضة: مفعول به ثانٍ." },
    { "id": 225, "text": "لَّا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَٰكِن يُؤَاخِذُكُم بِمَا كَسَبَتْ قُلُوبُكُمْ", "tafsir": "الله لا يحاسب على اليمين التي تجري على اللسان بغير قصد، بل على ما قُصد بالقلب.", "irab": "الله: فاعل، اللغو: اسم مجرور، قلوبكم: فاعل." },
    { "id": 226, "text": "لِّلَّذِينَ يُؤْلُونَ مِن نِّسَائِهِمْ تَرَبُّصُ أَرْبَعَةِ أَشْهُرٍ ۖ فَإِن فَاءُوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "أحكام الإيلاء (الحلف على ترك الجماع) وإمهال الحالف أربعة أشهر.", "irab": "تربص: مبتدأ مؤخر، أشهر: مضاف إليه، الله: اسم إن." },
    { "id": 227, "text": "وَإِنْ عَزَمُوا الطَّلَاقَ فَإِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ", "tafsir": "إذا اختار الزوج الطلاق بعد انتهاء المدة، فالله سميع لقوله عليم بنيته.", "irab": "إن: شرطية، عزموا: فعل الشرط، سميع: خبر إن." },
    { "id": 228, "text": "وَالْمُطَلَّقَاتُ يَتَرَبَّصْنَ بِأَنفُسِهِنَّ ثَلَاثَةَ قُرُوءٍ ۚ وَلَا يَحِلُّ لَهُنَّ أَن يَكْتُمْنَ", "tafsir": "عدة المطلقة هي ثلاث حيضات، والنهي عن إخفاء الحمل أو الحيض.", "irab": "المطلقات: مبتدأ، يتربصن: جملة الخبر، قروء: مضاف إليه." },
    { "id": 229, "text": "الطَّلَاقُ مَرَّتَانِ ۖ فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ", "tafsir": "الطلاق الذي يحق فيه الرجعة مرتان، وبعدهما إما رجعة بالمعروف أو طلاق نهائي.", "irab": "الطلاق: مبتدأ، مرتان: خبر مرفوع بالألف، إمساك: مبتدأ لخبر محذوف." },
    { "id": 230, "text": "فَإِن طَلَّقَهَا فَلَا تَحِلُّ لَهُ مِن بَعْدُ حَتَّىٰ تَنكِحَ زَوْجًا غَيْرَهُ", "tafsir": "إذا طلقها الثالثة فلا تحل له حتى تتزوج غيره زواجاً شرعياً ثم يفارقها.", "irab": "طلقها: فعل وفاعل ومفعول، تحل: مضارع مرفوع، زوجاً: مفعول به." },
    { "id": 231, "text": "وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ سَرِّحُوهُنَّ بِمَعْرُوفٍ", "tafsir": "الأمر بحسن المعاملة عند الرجعة أو الفراق، والنهي عن المضارة في النكاح.", "irab": "أمسكوهن: فعل أمر، معروف: اسم مجرور، حدود الله: مفعول به." },
    { "id": 232, "text": "وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلَا تَعْضُلُوهُنَّ أَن يَنكِحْنَ أَزْوَاجَهُنَّ", "tafsir": "النهي عن منع المطلقة من العودة لزوجها الأول إذا تراضيا بالمعروف.", "irab": "لا: ناهية، تعضلوهن: مضارع مجزوم، أزواجهن: مفعول به." },
    { "id": 233, "text": "وَالْوَالِدَاتُ يُرْضِعْنَ أَوْلَادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ ۖ لِمَنْ أَرَادَ أَن يُتِمَّ الرَّضَاعَةَ", "tafsir": "مدة الرضاعة الكاملة سنتان، وبيان أحكام نفقة المرضعة وتشاور الأبوين.", "irab": "الوالدات: مبتدأ، يرضعن: جملة الخبر، حولين: ظرف زمان منصوب بالياء." },
    { "id": 234, "text": "وَالَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَاجًا يَتَرَبَّصْنَ بِأَنفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا", "tafsir": "عدة المرأة المتوفى عنها زوجها هي أربعة أشهر وعشرة أيام.", "irab": "الذين: مبتدأ، يذرون: فعل، أزواجاً: مفعول به، عشراً: معطوف." },
    { "id": 235, "text": "وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُم بِهِ مِنْ خِطْبَةِ النِّسَاءِ أَوْ أَكْنَنتُمْ فِي أَنفُسِكُمْ", "tafsir": "جواز التلميح بخطبة المعتدة دون التصريح، والنهي عن عقد النكاح حتى تنتهي العدة.", "irab": "جناح: اسم لا، خطبة: مضاف إليه، الصدور: مضاف إليه." },
    { "id": 236, "text": "لَّا جُنَاحَ عَلَيْكُمْ إِن طَلَّقْتُمُ النِّسَاءَ مَا لَمْ تَمَسُّوهُنَّ أَوْ تَفْرِضُوا لَهُنَّ فَرِيضَةً", "tafsir": "جواز الطلاق قبل المساس أو تحديد المهر، ووجوب المتعة للمطلقة حينها.", "irab": "تمسوهن: مضارع مجزوم، فريضة: مفعول به، الموسع: اسم مجرور." },
    { "id": 237, "text": "وَإِن طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ وَقَدْ فَرَضْتُمْ لَهُنَّ فَرِيضَةً فَنِصْفُ مَا فَرَضْتُمْ", "tafsir": "إذا وقع الطلاق قبل المساس وكان المهر محدداً، فللمرأة نصف المهر إلا أن تعفو.", "irab": "نصف: مبتدأ، ما: مضاف إليه، الصلاة: مضاف إليه." },
    { "id": 238, "text": "حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَىٰ وَقُومُوا لِلَّهِ قَانِتِينَ", "tafsir": "الأمر بالمحافظة على جميع الصلوات وخص الصلاة الوسطى (العصر)، والخشوع فيها.", "irab": "حافظوا: فعل أمر، الصلوات: اسم مجرور، الوسطى: نعت، قانتين: حال." },
    { "id": 239, "text": "فَإِنْ خِفْتُمْ فَرِجَالًا أَوْ رُكْبَانًا ۖ فَإِذَا أَمِنتُمْ فَاذْكُرُوا اللَّهَ", "tafsir": "جواز صلاة الخوف مشاة أو ركباناً عند الضرورة، والعودة للصلاة الطبيعية عند الأمن.", "irab": "خفتم: فعل وفاعل، رجالاً: حال، اذكروا: فعل أمر." },
    { "id": 240, "text": "وَالَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لِّأَزْوَاجِهِم مَّتَاعًا إِلَى الْحَوْلِ", "tafsir": "كانت الوصية قديماً للمتوفى عنها زوجها بالسكن والنفقة حولاً كاملاً قبل نسخها.", "irab": "وصية: مفعول مطلق، الحول: اسم مجرور، معروف: اسم مجرور." }
    { "id": 241, "text": "وَلِلْمُطَلَّقَاتِ مَتَاعٌ بِالْمَعْرُوفِ ۖ حَقًّا عَلَى الْمُتَّقِينَ", "tafsir": "وجوب إعطاء المطلقة مبلغاً من المال (متعة) يجبر خاطرها ويكون بالمعروف.", "irab": "للمطلقات: خبر مقدم، متاع: مبتدأ مؤخر، حقاً: مفعول مطلق." },
    { "id": 242, "text": "كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَعْقِلُونَ", "tafsir": "هذا البيان الواضح لأحكام الأسرة من الله لكي تفهموا وتعملوا بها.", "irab": "يبين: فعل، الله: فاعل، آياته: مفعول به، لعلكم: لعل واسمها." },
    { "id": 243, "text": "۞ أَلَمْ تَرَ إِلَى الَّذِينَ خَرَجُوا مِن دِيَارِهِمْ وَهُمْ أُلُوفٌ حَذَرَ الْمَوْتِ", "tafsir": "قصة قوم فروا من الموت فأماتهم الله ثم أحياهم ليعلموا أن الحذر لا ينجي من القدر.", "irab": "ألم: الهمزة للاستفهام ولم جازمة، الذين: اسم مجرور، وهم ألوف: جملة حالية." },
    { "id": 244, "text": "وَقَاتِلُوا فِي سَبِيلِ اللَّهِ وَاعْلَمُوا أَنَّ اللَّهَ سَمِيعٌ عَلِيمٌ", "tafsir": "الأمر بالجهاد في سبيل الله وتذكير بعلم الله بكل شيء.", "irab": "قاتلوا: فعل أمر، الله: اسم أن، سميع: خبر أن." },
    { "id": 245, "text": "مَّن ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ أَضْعَافًا كَثِيرَةً", "tafsir": "حث على الإنفاق في سبيل الله ووعد بمضاعفة الأجر أضعافاً كثيرة.", "irab": "من: مبتدأ، يقرض: صلة الموصول، قرضاً: مفعول مطلق، فيضاعفه: منصوب بالسببية." },
    { "id": 246, "text": "أَلَمْ تَرَ إِلَى الْمَلَإِ مِن بَنِي إِسْرَائِيلَ مِن بَعْدِ مُوسَىٰ إِذْ قَالُوا لِنَبِيٍّ لَّهُمُ ابْعَثْ لَنَا مَلِكًا", "tafsir": "طلب بني إسرائيل من نبيهم تعيين ملك ليقاتلوا معه، واختبار الله لصدقهم.", "irab": "الملأ: اسم مجرور، ابعث: فعل أمر، ملكاً: مفعول به." },
    { "id": 247, "text": "وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ اللَّهَ قَدْ بَعَثَ لَكُمْ طَالُوتَ مَلِكًا", "tafsir": "اختيار طالوت ملكاً عليهم لزيادة علمه وقوة جسمه رغم قلة ماله.", "irab": "نبيهم: فاعل، طالوت: مفعول به أول، ملكاً: حال أو مفعول ثانٍ." },
    { "id": 248, "text": "وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ آيَةَ مُلْكِهِ أَن يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِّن رَّبِّكُمْ", "tafsir": "علامة صدق ملك طالوت هي عودة التابوت الذي سلب منهم تحمله الملائكة.", "irab": "آية: اسم إن، التابوت: فاعل يأتيك، فيه سكينة: جملة حالية." },
    { "id": 249, "text": "فَلَمَّا فَصَلَ طَالُوتُ بِالْجُنُودِ قَالَ إِنَّ اللَّهَ مُبْتَلِيكُم بِنَهَرٍ", "tafsir": "اختبار الجيش بالنهي عن الشرب من النهر إلا غرفة واحدة لفرز الصابرين.", "irab": "طالوت: فاعل، الله: اسم إن، مبتليكم: خبر إن، بنهر: جار ومجرور." },
    { "id": 250, "text": "وَلَمَّا بَرَزُوا لِجَالُوتَ وَجُنُودِهِ قَالُوا رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا", "tafsir": "دعاء المؤمنين عند مواجهة العدو بالصبر والثبات والنصر.", "irab": "برزوا: فعل وفاعل، جالوت: اسم مجرور، صبراً: مفعول به." },
    { "id": 251, "text": "فَهَزَمُوهُم بِإِذْنِ اللَّهِ وَقَتَلَ دَاوُودُ جَالُوتَ وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ", "tafsir": "نصر القلة المؤمنة وقتل داود لملك الكفر جالوت، وبيان سنة التدافع.", "irab": "هزموهم: فعل وفاعل ومفعول، داوود: فاعل، جالوت: مفعول به." },
    { "id": 252, "text": "تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۚ وَإِنَّكَ لَمِنَ الْمُرْسَلِينَ", "tafsir": "هذه القصص هي وحي الله الصادق للنبي ﷺ وتأكيد لنبوته.", "irab": "تلك: مبتدأ، آيات: خبر، نتلوها: جملة حالية، إنك: إن واسمها." },
    { "id": 253, "text": "تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۘ مِّنْهُم مَّن كَلَّمَ اللَّهُ", "tafsir": "تفاضل الرسل في الدرجات والمهام، ووقوع الاختلاف بين الناس بعدهم.", "irab": "تلك: مبتدأ، الرسل: بدل، فضلنا: جملة الخبر، الله: فاعل كلم." },
    { "id": 254, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَنفِقُوا مِمَّا رَزَقْنَاكُم مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ لَّا بَيْعٌ فِيهِ", "tafsir": "الحث على الصدقة قبل يوم القيامة حيث لا تنفع تجارة ولا شفاعة إلا بإذن الله.", "irab": "أنفقوا: فعل أمر، يوم: فاعل يأت، بيع: مبتدأ." },
    { "id": 255, "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ", "tafsir": "آية الكرسي: أعظم آية في القرآن تصف عظمة الله وقدرته وإحاطته بكل شيء.", "irab": "الله: مبتدأ، لا إله إلا هو: جملة الخبر، الحي: خبر ثانٍ، سنة: فاعل." },
    { "id": 256, "text": "لَا إِكْرَاهَ فِي الدِّينِ ۖ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَن يَكْفُرْ بِالطَّاغُوتِ", "tafsir": "حرية الدين لوضوح الحق، ومن تمسك بالعروة الوثقى (التوحيد) فقد نجا.", "irab": "إكراه: اسم لا، الرشد: فاعل، من: اسم شرط مبتدأ." },
    { "id": 257, "text": "اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُم مِّنَ الظُّلُمَاتِ إِلَى النُّورِ", "tafsir": "الله ناصر المؤمنين وهاديهم، والكفار أولياؤهم الشياطين يضلونهم.", "irab": "الله: مبتدأ، ولي: خبر، الذين: مضاف إليه، يخرجهم: جملة الخبر الثاني." },
    { "id": 258, "text": "أَلَمْ تَرَ إِلَى الَّذِي حَاجَّ إِبْرَاهِيمَ فِي رَبِّهِ أَنْ آتَاهُ اللَّهُ الْمُلْكَ", "tafsir": "قصة النمرود ومجادلته لإبراهيم في الخالق، فبهت الكافر أمام حجة إبراهيم.", "irab": "الذي: اسم مجرور، إبراهيم: مفعول به، الله: فاعل آتى، فبهت الكافر: فعل وفاعل." },
    { "id": 259, "text": "أَوْ كَالَّذِي مَرَّ عَلَىٰ قَرْيَةٍ وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحْيِي هَٰذِهِ اللَّهُ", "tafsir": "قصة عزير الذي أماته الله مائة عام ثم أحياه ليريه قدرته على البعث.", "irab": "قرية: اسم مجرور، خاوية: خبر للمبتدأ (هي)، مائة عام: ظرف زمان." },
    { "id": 260, "text": "وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَىٰ ۖ قَالَ أَوَلَمْ تُؤْمِن ۖ قَالَ بَلَىٰ", "tafsir": "طلب إبراهيم رؤية كيفية الإحياء ليطمئن قلبه، ومعجزة الطيور الأربعة.", "irab": "أرني: فعل دعاء ومفعول به، الموتى: مفعول به، طيراً: مفعول به." }
    { "id": 261, "text": "مَّثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ", "tafsir": "مضاعفة أجر الإنفاق في سبيل الله من سبعمائة ضعف إلى ما يشاء الله.", "irab": "مثل: مبتدأ، الذين: مضاف إليه، سبع: مفعول به، سنابل: مضاف إليه." },
    { "id": 262, "text": "الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ ثُمَّ لَا يُتْبِعُونَ مَا أَنفَقُوا مَنًّا وَلَا أَذًى", "tafsir": "شرط قبول الصدقة هو الإخلاص وعدم التفاخر بها أو إيذاء الفقير.", "irab": "الذين: مبتدأ، أموالهم: مفعول به، منّاً: مفعول به ثانٍ أو حال." },
    { "id": 263, "text": "قَوْلٌ مَّعْرُوفٌ وَمَغْفِرَةٌ خَيْرٌ مِّن صَدَقَةٍ يَتْبَعُهَا أَذًى ۗ وَاللَّهُ غَنِيٌّ حَلِيمٌ", "tafsir": "الكلمة الطيبة والصفح خير عند الله من صدقة يصاحبها تجريح.", "irab": "قول: مبتدأ، معروف: نعت، خير: خبر، الله: مبتدأ." },
    { "id": 264, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُبْطِلُوا صَدَقَاتِكُم بِالْمَنِّ وَالْأَذَىٰ كَالَّذِي يُنفِقُ مَالَهُ رِئَاءَ النَّاسِ", "tafsir": "التحذير من إبطال أجر الصدقة بالرياء والمنّ، فذلك كمن يزرع فوق صخر صلد.", "irab": "لا: ناهية، تبطلوا: مضارع مجزوم، رئاء: مفعول لأجله، الناس: مضاف إليه." },
    { "id": 265, "text": "وَمَثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمُ ابْتِغَاءَ مَرْضَاتِ اللَّهِ وَتَثْبِيتًا مِّنْ أَنفُسِهِمْ كَمَثَلِ جَنَّةٍ بِرَبْوَةٍ", "tafsir": "مثل المنفق المخلص كمثل بستان عالٍ مثمر يضاعف إنتاجه مهما كانت الظروف.", "irab": "ابتغاء: مفعول لأجله، جنة: اسم مجرور، ربوة: اسم مجرور." },
    { "id": 266, "text": "أَيَوَدُّ أَحَدُكُمْ أَن تَكُونَ لَهُ جَنَّةٌ مِّن نَّخِيلٍ وَأَعْنَابٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ", "tafsir": "مثل من ينفق رئاءً كمن ضاع بستانه في وقت شدة حاجته إليه وهو كبير في السن.", "irab": "جنة: اسم تكون مؤخر، الأنهار: فاعل، أعصار: فاعل." },
    { "id": 267, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَنفِقُوا مِن طَيِّبَاتِ مَا كَسَبْتُمْ وَمِمَّا أَخْرَجْنَا لَكُم مِّنَ الْأَرْضِ", "tafsir": "الأمر بالإنفاق من الرزق الطيب الحلال والابتعاد عن الرديء من المال.", "irab": "أنفقوا: فعل أمر، طيبات: اسم مجرور، الأرض: اسم مجرور." },
    { "id": 268, "text": "الشَّيْطَانُ يَعِدُكُمُ الْفَقْرَ وَيَأْمُرُكُم بِالْفَحْشَاءِ ۖ وَاللَّهُ يَعِدُكُم مَّغْفِرَةً مِّنْهُ وَفَضْلًا", "tafsir": "الشيطان يخوفكم من الفقر ليمنعكم من الصدقة، والله يعدكم بالخلف والرزق.", "irab": "الشيطان: مبتدأ، الفقر: مفعول به ثانٍ، الله: مبتدأ، مغفرة: مفعول به ثانٍ." },
    { "id": 269, "text": "يُؤْتِي الْحِكْمَةَ مَن يَشَاءُ ۚ وَمَن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا", "tafsir": "الحكمة هي العلم النافع والعمل الصالح، وهي أعظم عطاء يمنحه الله لعبده.", "irab": "من: مفعول به أول، الحكمة: مفعول به ثانٍ، خيراً: مفعول به ثانٍ." },
    { "id": 270, "text": "وَمَا أَنفَقْتُم مِّن نَّفَقَةٍ أَوْ نَذَرْتُم مِّن نَّذْرٍ فَإِنَّ اللَّهَ يَعْلَمُهُ", "tafsir": "كل ما يخرجه الإنسان من مال أو يلتزم به من نذر، فالله عليم به وسيجازيه عليه.", "irab": "ما: اسم شرط مبتدأ، نفقة: اسم مجرور، يعلمه: جملة خبر إن." },
    { "id": 271, "text": "إِن تُبْدُوا الصَّدَقَاتِ فَنِعِمَّا هِيَ ۖ وَإِن تُخْفُوهَا وَتُؤْتُوهَا الْفُقَرَاءَ فَهُوَ خَيْرٌ لَّكُمْ", "tafsir": "جواز إظهار الصدقة، لكن إخفاءها وإعطاءها للفقراء سراً أفضل وأطهر للقلب.", "irab": "تبدوا: فعل الشرط، هي: فاعل، تخفوها: فعل الشرط، هو خير: جملة جواب الشرط." },
    { "id": 272, "text": "۞ لَّيْسَ عَلَيْكَ هُدَاهُمْ وَلَٰكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ ۗ وَمَا تُنفِقُوا مِنْ خَيْرٍ فَلِأَنفُسِكُمْ", "tafsir": "الهداية بيد الله وحده، والنفقة الحلال يعود نفعها وثوابها على المنفق نفسه.", "irab": "ليس: فعل ناقص، هداهم: اسم ليس مؤخر، الله: اسم لكن، من: مفعول به." },
    { "id": 273, "text": "لِلْفُقَرَاءِ الَّذِينَ أُحْصِرُوا فِي سَبِيلِ اللَّهِ لَا يَسْتَطِيعُونَ ضَرْبًا فِي الْأَرْضِ", "tafsir": "الأولوية في الصدقة للمتعففين الذين منعهم الجهاد أو الحاجة عن السعي للرزق.", "irab": "الفقراء: اسم مجرور، الذين: نعت، سيماهم: اسم مجرور، إلحافاً: حال." },
    { "id": 274, "text": "الَّذِينَ يُنفِقُونَ أَمْوَالَهُم بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلَانِيَةً فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ", "tafsir": "وعد بالثواب العظيم والأمان من الخوف والحزن للمنفقين في كل وقت وحال.", "irab": "الذين: مبتدأ، سراً: حال، أجرهم: مبتدأ مؤخر، عند: ظرف." },
    { "id": 275, "text": "الَّذِينَ يَأْكُلُونَ الرِّبَا لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ الَّذِي يَتَخَبَّطُهُ الشَّيْطَانُ مِنَ الْمَسِّ", "tafsir": "تحريم الربا ووصف حال آكل الربا يوم القيامة كالمجنون المصروع.", "irab": "الربا: مفعول به، الشيطان: فاعل، البيع: اسم كأن." },
    { "id": 276, "text": "يَمْحَقُ اللَّهُ الرِّبَا وَيُرْبِي الصَّدَقَاتِ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ", "tafsir": "الله يذهب بركة مال الربا ويزيد ويبارك في مال الصدقات.", "irab": "يمحق: فعل مضارع، الله: فاعل، الربا: مفعول به، الصدقات: مفعول به منصوب بالكسرة." },
    { "id": 277, "text": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ", "tafsir": "تأكيد فوز المؤمنين المقيمين للصلاة والمؤدين للزكاة بالأجر والأمن.", "irab": "الذين: اسم إن، أقاموا: فعل وفاعل، الصلاة: مفعول به، أجرهم: مبتدأ." },
    { "id": 278, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَذَرُوا مَا بَقِيَ مِنَ الرِّبَا إِن كُنتُم مُّؤْمِنِينَ", "tafsir": "الأمر بترك بقايا المعاملات الربوية كدليل على صدق الإيمان والتقوى.", "irab": "اتقوا: فعل أمر، الله: مفعول به، ذروا: فعل أمر، ما: مفعول به." },
    { "id": 279, "text": "فَإِن لَّمْ تَفْعَلُوا فَأْذَنُوا بِحَرْبٍ مِّنَ اللَّهِ وَرَسُولِهِ ۖ وَإِن تُبْتُمْ فَلَكُمْ رُءُوسُ أَمْوَالِكُمْ", "tafsir": "وعيد شديد للمصرين على الربا بحرب من الله، وجواز استرداد رأس المال فقط عند التوبة.", "irab": "لم تفعلوا: مضارع مجزوم، بحرب: اسم مجرور، رؤوس: مبتدأ مؤخر." },
    { "id": 280, "text": "وَإِن كَانَ ذُو عُسْرَةٍ فَنَظِرَةٌ إِلَىٰ مَيْسَرَةٍ ۚ وَأَن تَصَدَّقُوا خَيْرٌ لَّكُمْ", "tafsir": "وجوب إمهال المدين المعسر، والحث على التنازل عن الدين كصدقة.", "irab": "ذو: فاعل، عسرة: مضاف إليه، نظرة: مبتدأ لخبر محذوف، تصدقوا: مبتدأ." },
    { "id": 281, "text": "وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ ۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ", "tafsir": "تذكير بيوم القيامة والوقوف بين يدي الله حيث يوفى كل إنسان جزاء عمله دون ظلم.", "irab": "يوماً: مفعول به، ترجعون: مضارع مبني للمجهول، نفس: مضاف إليه، يظلمون: مضارع مبني للمجهول." },
    { "id": 282, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَدَايَنتُم بِدَيْنٍ إِلَىٰ أَجَلٍ مُّسَمًّى فَاكْتُبُوهُ", "tafsir": "آية الدين: أطول آية في القرآن توضح أحكام توثيق الديون والإشهاد عليها لضمان الحقوق.", "irab": "تداينتم: فعل وفاعل، أجل: اسم مجرور، اكتبوه: فعل أمر وفاعل ومفعول." },
    { "id": 283, "text": "وَإِن كُنتُمْ عَلَىٰ سَفَرٍ وَلَمْ تَجِدُوا كَاتِبًا فَرِهَانٌ مَّقْبُوضَةٌ", "tafsir": "أحكام الرهن في السفر لتوثيق الدين عند فقدان الكاتب، ووجوب أداء الأمانة.", "irab": "تجدوا: مضارع مجزوم، كاتباً: مفعول به، رهان: مبتدأ لخبر محذوف." },
    { "id": 284, "text": "لِّلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِن تُبْدُوا مَا فِي أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ اللَّهُ", "tafsir": "ملك الله للكون وعلمه بما تخفيه الصدور ومحاسبته للعباد بعدله ورحمته.", "irab": "لله: خبر مقدم، ما: مبتدأ مؤخر، يحاسبكم: جواب الشرط، الله: فاعل." },
    { "id": 285, "text": "آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ", "tafsir": "إعلان إيمان الرسول والمؤمنين بجميع أركان الإيمان والسمع والطاعة لله.", "irab": "آمن: فعل ماض، الرسول: فاعل، كل: مبتدأ، آمن: جملة الخبر." },
    { "id": 286, "text": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ", "tafsir": "رحمة الله بعدم تكليف العباد فوق طاقتهم، ودعاء المؤمنين بالمغفرة والعفو والنصر.", "irab": "لا: نافية، الله: فاعل، نفساً: مفعول به أول، وسعها: مفعول به ثانٍ." }
   ] 
    },
    { "id": 3, "name": "آل عمران", "verses": [    { "id": 1, "text": "الم", "tafsir": "حروف مقطعة للإعجاز الإلهي، الله أعلم بمراده بها.", "irab": "حروف مبنية لا محل لها من الإعراب." },
    { "id": 2, "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ", "tafsir": "الله هو المعبود وحده بحق، المتصف بالحياة الكاملة والقائم بتدبير خلقه.", "irab": "الله: مبتدأ، لا إله إلا هو: جملة الخبر، الحي: خبر ثانٍ." },
    { "id": 3, "text": "نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَأَنزَلَ التَّوْرَاةَ وَالْإِنجِيلَ", "tafsir": "أنزل الله القرآن بالصدق، موافقاً لما سبقه من الكتب، وأنزل التوراة والإنجيل.", "irab": "نزل: فعل، الكتاب: مفعول به، مصدقاً: حال منصوب." },
    { "id": 4, "text": "مِن قَبْلُ هُدًى لِّلنَّاسِ وَأَنزَلَ الْفُرْقَانَ ۗ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ", "tafsir": "كانت الكتب السابقة هداية، والقرآن هو المفرق بين الحق والباطل.", "irab": "من قبل: ظرف زمان، الذين: اسم إن، عذاب: مبتدأ مؤخر." },
    { "id": 5, "text": "إِنَّ اللَّهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ", "tafsir": "علم الله محيط بكل شيء، فلا يغيب عنه ذرة في الكون.", "irab": "إن: حرف ناسخ، الله: اسمها، شيء: فاعل مرفوع." },
    { "id": 6, "text": "هُوَ الَّذِي يُصَوِّرُكُمْ فِي الْأَرْحَامِ كَيْفَ يَشَاءُ ۚ لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ", "tafsir": "الله هو الذي يخلقكم في أرحام أمهاتكم على الهيئة التي يختارها.", "irab": "هو: مبتدأ، الذي: خبر، يصوركم: فعل ومفعول به، كيف: اسم استفهام." },
    { "id": 7, "text": "هُوَ الَّذِي أَنزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُّحْكَمَاتٌ هُنَّ أُمُّ الْكِتَابِ وَأُخَرُ مُتَشَابِهَاتٌ", "tafsir": "القرآن فيه آيات واضحة (محكمات) وآيات تحتاج لتفسير (متشابهات).", "irab": "آيات: مبتدأ، محكمات: نعت، هن: مبتدأ، أم: خبر." },
    { "id": 8, "text": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ", "tafsir": "دعاء الراسخين في العلم بالثبات على الهداية وطلب الرحمة.", "irab": "لا: ناهية (للدعاء)، تزغ: مضارع مجزوم، قلوبنا: مفعول به." },
    { "id": 9, "text": "رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ", "tafsir": "الإيمان بيوم القيامة حيث يجمع الله الخلق للحساب كما وعد.", "irab": "جامع: خبر إن، الناس: مضاف إليه، الميعاد: مفعول به." },
    { "id": 10, "text": "إِنَّ الَّذِينَ كَفَرُوا لَن تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلَا أَوْلَادُهُم مِّنَ اللَّهِ شَيْئًا", "tafsir": "أموال الكفار وأولادهم لن تحميهم من عذاب الله يوم القيامة.", "irab": "الذين: اسم إن، أموالهم: فاعل تغني، شيئاً: مفعول به ثانٍ." },
    { "id": 11, "text": "كَدَأْبِ آلِ فِرْعَوْنَ وَالَّذِينَ مِن قَبْلِهِمْ ۚ كَذَّبُوا بِآيَاتِنَا فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ", "tafsir": "حال الكفار كحال آل فرعون الذين كذبوا وعوقبوا بذنوبهم.", "irab": "آل: مضاف إليه، الذين: معطوف، الله: فاعل، بذنوبهم: جار ومجرور." },
    { "id": 12, "text": "قُل لِّلَّذِينَ كَفَرُوا سَتُغْلَبُونَ وَتُحْشَرُونَ إِلَىٰ جَهَنَّمَ ۚ وَبِئْسَ الْمِهَادُ", "tafsir": "وعد الله بهزيمة الكفار في الدنيا وحشرهم في نار جهنم في الآخرة.", "irab": "تغلبون: مضارع مبني للمجهول، جهنم: اسم مجرور بالفتحة." },
    { "id": 13, "text": "قَدْ كَانَ لَكُمْ آيَةٌ فِي فِئَتَيْنِ الْتَقَتَا ۖ فِئَةٌ تُقَاتِلُ فِي سَبِيلِ اللَّهِ وَأُخْرَىٰ كَافِرَةٌ", "tafsir": "عبرة في غزوة بدر بنصر القلة المؤمنة على الكثرة الكافرة.", "irab": "آية: اسم كان مؤخر، فئة: مبتدأ، كافرة: نعت." },
    { "id": 14, "text": "زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوَاتِ مِنَ النِّسَاءِ وَالْبَنِينَ وَالْقَنَاطِيرِ الْمُقَنطَرَةِ مِنَ الذَّهَبِ", "tafsir": "بيان فتن الدنيا ومتاعها الزائل من أموال وأولاد.", "irab": "زين: مبني للمجهول، حب: نائب فاعل، الشهوات: مضاف إليه." },
    { "id": 15, "text": "قُلْ أَؤُنَبِّئُكُم بِخَيْرٍ مِّن ذَٰلِكُمْ ۚ لِلَّذِينَ اتَّقَوْا عِندَ رَبِّهِمْ جَنَّاتٌ", "tafsir": "النعيم الباقي للمتقين في الجنات خير من كل متاع الدنيا.", "irab": "أؤنبئكم: استفهام وفعل، جنات: مبتدأ مؤخر." },
    { "id": 16, "text": "الَّذِينَ يَقُولُونَ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ", "tafsir": "صفات المتقين: التوسل لله بإيمانهم لطلب المغفرة والنجاة.", "irab": "آمنا: فعل وفاعل، ذنوبنا: مفعول به، قنا: فعل أمر (دعاء)." },
    { "id": 17, "text": "الصَّابِرِينَ وَالصَّادِقِينَ وَالْقَانِتِينَ وَالْمُنفِقِينَ وَالْمُسْتَغْفِرِينَ بِالْأَسْحَارِ", "tafsir": "مزيد من صفات المتقين: الصبر والصدق والقنوت والإنفاق والاستغفار بالليل.", "irab": "الصابرين: نعت مجرور بالياء (أو مفعول به لفعل محذوف)." },
    { "id": 18, "text": "شَهِدَ اللَّهُ أَنَّهُ لَا إِلَٰهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ قَائِمًا بِالْقِسْطِ", "tafsir": "أعظم شهادة بالتوحيد من الله وملائكته وأهل العلم بالعدل.", "irab": "شهد: فعل، الله: فاعل، قائماً: حال منصوبة." },
    { "id": 19, "text": "إِنَّ الدِّينَ عِندَ اللَّهِ الْإِسْلَامُ ۗ وَمَا اخْتَلَفَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءَهُمُ الْعِلْمُ", "tafsir": "الدين المقبول عند الله هو الإسلام، واختلاف أهل الكتاب سببه البغي.", "irab": "الدين: اسم إن، الإسلام: خبر إن، الذين: فاعل." },
    { "id": 20, "text": "فَإِنْ حَاجُّوكَ فَقُلْ أَسْلَمْتُ وَجْهِيَ لِلَّهِ وَمَنِ اتَّبَعَنِ ۗ وَقُل لِّلَّذِينَ أُوتُوا الْكِتَابَ", "tafsir": "الرد على المجادلين بالتمسك بالإسلام ودعوتهم للدخول فيه.", "irab": "حاجوك: فعل وفاعل ومفعول، وجهي: مفعول به." },
    { "id": 21, "text": "إِنَّ الَّذِينَ يَكْفُرُونَ بِآيَاتِ اللَّهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ", "tafsir": "وعيد شديد لمن يجحدون بالآيات ويقتلون الأنبياء بغير وجه حق.", "irab": "الذين: اسم إن، النبيين: مفعول به منصوب بالياء." },
    { "id": 22, "text": "أُولَٰئِكَ الَّذِينَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ وَمَا لَهُم مِّن نَّاصِرِينَ", "tafsir": "هؤلاء بطلت أعمالهم ولن يجدوا من ينصرهم من عذاب الله.", "irab": "أولئك: مبتدأ، الذين: خبر، أعمالهم: فاعل حبطت." },
    { "id": 23, "text": "أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِّنَ الْكِتَابِ يُدْعَوْنَ إِلَىٰ كِتَابِ اللَّهِ لِيَحْكُمَ بَيْنَهُمْ", "tafsir": "إعراض بعض أهل الكتاب عن حكم الله الموجود في كتبهم.", "irab": "الذين: اسم مجرور، نصيباً: مفعول به، الله: مضاف إليه." },
    { "id": 24, "text": "ذَٰلِكَ بِأَنَّهُمْ قَالُوا لَن تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَّعْدُودَاتٍ ۖ وَغَرَّهُمْ فِي دِينِهِم مَّا كَانُوا يَفْتَرُونَ", "tafsir": "اغترارهم بأكاذيبهم بأن النار لن تمسهم إلا قليلاً.", "irab": "أياماً: ظرف زمان، ما: اسم موصول فاعل غرهم." },
    { "id": 25, "text": "فَكَيْفَ إِذَا جَمَعْنَاهُمْ لِيَوْمٍ لَّا رَيْبَ فِيهِ وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا كَسَبَتْ", "tafsir": "حالهم العظيم يوم يجمعهم الله للحساب ويوفى كلٌ عمله.", "irab": "كيف: اسم استفهام، نفس: مضاف إليه، ما: مفعول به." }
    { "id": 26, "text": "قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَن تَشَاءُ وَتَنزِعُ الْمُلْكَ مِمَّن تَشَاءُ", "tafsir": "الله هو المتصرف في الملك، يعز من يشاء ويذل من يشاء بيده الخير وهو على كل شيء قدير.", "irab": "اللهم: منادى، مالك: نعت، من: مفعول به أول، الملك: مفعول به ثانٍ." },
    { "id": 27, "text": "تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ ۖ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ", "tafsir": "قدرة الله في تعاقب الليل والنهار وإخراج الحي من الميت والميت من الحي ورزق من يشاء.", "irab": "تولج: فعل مضارع، الليل: مفعول به، الحي: مفعول به، بغير حساب: جار ومجرور." },
    { "id": 28, "text": "لَّا يَتَّخِذِ الْمُؤْمِنُونَ الْكَافِرِينَ أَوْلِيَاءَ مِن دُونِ الْمُؤْمِنِينَ", "tafsir": "النهي عن موالاة الكفار وترك موالاة المؤمنين، والتحذير من مخالفة أمر الله.", "irab": "لا: ناهية، يتخذ: مضارع مجزوم، الكافرين: مفعول به أول، أولياء: مفعول ثانٍ." },
    { "id": 29, "text": "قُلْ إِن تُخْفُوا مَا فِي صُدُورِكُمْ أَوْ تُبْدُوهُ يَعْلَمْهُ اللَّهُ", "tafsir": "علم الله المحيط بكل ما تخفيه الصدور أو تعلنه، وقدرته الشاملة على كل شيء.", "irab": "إن: شرطية، تخفوا: فعل الشرط، يعلمه: جواب الشرط، الله: فاعل." },
    { "id": 30, "text": "يَوْمَ تَجِدُ كُلُّ نَفْسٍ مَّا عَمِلَتْ مِنْ خَيْرٍ مُّحْضَرًا", "tafsir": "يوم القيامة يجد كل إنسان عمله حاضراً أمامه، ويتمنى الكافر لو كان بينه وبين عمله أمد بعيد.", "irab": "يوم: ظرف زمان، كل: فاعل، ما: مفعول به، محضراً: حال." },
    { "id": 31, "text": "قُلْ إِن كُنتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ", "tafsir": "شرط محبة الله هو اتباع النبي ﷺ، وجزاؤه محبة الله ومغفرة الذنوب.", "irab": "إن: شرطية، اتبعوني: فعل أمر، يحببكم: جواب الشرط، الله: فاعل." },
    { "id": 32, "text": "قُلْ أَطِيعُوا اللَّهَ وَالرَّسُولَ ۖ فَإِن تَوَلَّوْا فَإِنَّ اللَّهَ لَا يُحِبُّ الْكَافِرِينَ", "tafsير": "الأمر بطاعة الله ورسوله، والتحذير من الإعراض الذي يؤدي للكفر.", "irab": "أطيعوا: فعل أمر، الله: مفعول به، تولوا: فعل ماض، الله: اسم إن." },
    { "id": 33, "text": "۞ إِنَّ اللَّهَ اصْطَفَىٰ آدَمَ وَنُوحًا وَآلَ إِبْرَاهِيمَ وَآلَ عِمْرَانَ عَلَى الْعَالَمِينَ", "tafsir": "اختيار الله لآدم ونوح وآل إبراهيم وآل عمران وتفضيلهم على أهل زمانهم.", "irab": "إن: حرف ناسخ، الله: اسمها، اصطفى: فعل، آدم: مفعول به." },
    { "id": 34, "text": "ذُرِّيَّةً بَعْضُهَا مِن بَعْضٍ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ", "tafsir": "هؤلاء الرسل والأنبياء ذرية متسلسلة في الفضل والدين، والله عليم بهم.", "irab": "ذرية: حال أو بدل، بعضها: مبتدأ، من بعض: خبر، الله: مبتدأ." },
    { "id": 35, "text": "إِذْ قَالَتِ امْرَأَتُ عِمْرَانَ رَبِّ إِنِّي نَذَرْتُ لَكَ مَا فِي بَطْنِي مُحَرَّرًا", "tafsir": "نذر امرأة عمران ما في بطنها لخدمة بيت المقدس مخلصاً لله.", "irab": "إذ: ظرف، امرأت: فاعل، إني: إن واسمها، محرراً: حال." },
    { "id": 36, "text": "فَلَمَّا وَضَعَتْهَا قَالَتْ رَبِّ إِنِّي وَضَعْتُهَا أُنثَىٰ وَاللَّهُ أَعْلَمُ بِمَا وَضَعَتْ", "tafsir": "ولادة مريم عليها السلام واعتذار أمها بأنها أنثى، وتسميتها مريم وإعاذتها بالله.", "irab": "وضعتها: فعل وفاعل ومفعول، أنثى: حال، الله: مبتدأ، أعلم: خبر." },
    { "id": 37, "text": "فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٍ وَأَنبَتَهَا نَبَاتًا حَسَنًا وَكَفَّلَهَا زَكَرِيَّا", "tafsir": "رعاية الله لمريم وإنباتها نباتاً حسناً وجعل زكريا كفيلاً لها ورزقها بكراماته.", "irab": "تقبلها: فعل ومفعول، ربها: فاعل، نباتاً: مفعول مطلق، زكريا: فاعل." },
    { "id": 38, "text": "هُنَالِكَ دَعَا زكريا رَبَّهُ ۖ قَالَ رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً", "tafsir": "دعاء زكريا لربه بالذرية الصالحة لما رأى من كرامة الله لمريم.", "irab": "دعا: فعل ماض، زكريا: فاعل، ربه: مفعول به، ذرية: مفعول به ثانٍ." },
    { "id": 39, "text": "فَنَادَتْهُ الْمَلَائِكَةُ وَهُوَ قَائِمٌ يُصَلِّي فِي الْمِحْرَابِ أَنَّ اللَّهَ يُبَشِّرُكَ بِيَحْيَىٰ", "tafsir": "بشارة الملائكة لزكريا بيحيى عليه السلام وهو يصلي، وتصديق يحيى بكلمة الله.", "irab": "نادثه: فعل ومفعول، الملائكة: فاعل، هو قائم: جملة حالية، يحيى: اسم مجرور." },
    { "id": 40, "text": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَامٌ وَقَدْ بَلَغَنِيَ الْكِبَرُ وَامْرَأَتِي عَاقِرٌ", "tafsir": "تعجب زكريا من البشارة لكبر سنه وعقم زوجته، وتأكيد قدرة الله على كل شيء.", "irab": "أنى: اسم استفهام، يكون: مضارع ناقص، غلام: اسم يكون، عاقر: خبر." },
    { "id": 41, "text": "قَالَ رَبِّ اجْعَل لِّي آيَةً ۖ قَالَ آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا", "tafsir": "طلب زكريا علامة، فكانت ألا يكلم الناس إلا بالإشارة مع كثرة الذكر.", "irab": "اجعل: فعل أمر، آية: مفعول به، ثلاثة أيام: ظرف زمان، رمزاً: حال." },
    { "id": 42, "text": "وَإِذْ قَالَتِ الْمَلَائِكَةُ يَا مَرْيَمُ إِنَّ اللَّهَ اصْطَفَاكِ وَطَهَّرَكِ وَاصْطَفَاكِ عَلَىٰ نِسَاءِ الْعَالَمِينَ", "tafsir": "تبشير الملائكة لمريم باصطفاء الله لها وتطهيرها وتفضيلها على جميع النساء.", "irab": "يا مريم: منادى، الله: اسم إن، اصطفاكِ: فعل ومفعول." },
    { "id": 43, "text": "يَا مَرْيَمُ اقْنُتِي لِرَبِّكِ وَاسْجُدِي وَارْكَعِي مَعَ الرَّاكِعِينَ", "tafsir": "أمر مريم بمداومة العبادة والقنوت والسجود والركوع شكراً لله.", "irab": "اقنتي: فعل أمر، لربك: جار ومجرور، مع: ظرف مكان." },
    { "id": 44, "text": "ذَٰلِكَ مِنْ أَنبَاءِ الْغَيْبِ نُوحِيهِ إِلَيْكَ ۚ وَمَا كُنتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَامَهُمْ", "tafsir": "هذه القصص من وحي الغيب للنبي ﷺ، ولم يكن حاضراً وقت قرعة كفالة مريم.", "irab": "ذلك: مبتدأ، من أنباء: خبر، نوحيه: فعل ومفعول، أقلامهم: مفعول به." },
    { "id": 45, "text": "إِذْ قَالَتِ الْمَلَائِكَةُ يَا مَرْيَمُ إِنَّ اللَّهَ يُبَشِّرُكِ بِكَلِمَةٍ مِّنْهُ اسْمُهُ الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ", "tafsir": "بشارة مريم بعيسى عليه السلام بكلمة من الله، وسيكون وجيهاً في الدنيا والآخرة.", "irab": "إن: حرف ناسخ، يبشرك: فعل ومفعول، اسمه: مبتدأ، المسيح: خبر." }
    { "id": 46, "text": "وَيُكَلِّمُ النَّاسَ فِي الْمَهْدِ وَكَهْلًا وَمِنَ الصَّالِحِينَ", "tafsir": "من معجزات عيسى عليه السلام كلامه للناس وهو طفل في المهد، وكذلك كلامه لهم في كهولته بالوحي.", "irab": "يكلم: فعل مضارع، الناس: مفعول به، كهلاً: حال منصوبة." },
    { "id": 47, "text": "قَالَتْ رَبِّ أَنَّىٰ يَكُونُ لِي وَلَدٌ وَلَمْ يَمْسَسْنِي بَشَرٌ ۖ قَالَ كَذَٰلِكِ اللَّهُ يَخْلُقُ مَا يَشَاءُ", "tafsir": "تعجب مريم من الولادة دون زوج، والرد بأن الله يخلق ما يشاء بكلمة (كن).", "irab": "ولد: اسم يكون مؤخر، بشر: فاعل، يشاء: مضارع مرفوع." },
    { "id": 48, "text": "وَيُعَلِّمُهُ الْكِتَابَ وَالْحِكْمَةَ وَالتَّوْرَاةَ وَالْإِنجِيلَ", "tafsir": "تفضل الله على عيسى بتعليمه الكتابة والحكمة وأسرار التوراة والإنجيل.", "irab": "يعلمه: فعل ومفعول أول، الكتاب: مفعول ثانٍ، الحكمة: معطوف." },
    { "id": 49, "text": "وَرَسُولًا إِلَىٰ بَنِي إِسْرَائِيلَ أَنِّي قَدْ جِئْتُكُم بِآيَةٍ مِّن رَّبِّكُمْ ۖ أَنِّي أَخْلُقُ لَكُم مِّنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ", "tafsir": "معجزات عيسى: صنع طير من طين ونفخ الروح فيه بإذن الله، وإبراء الأكمه والأبرص وإحياء الموتى.", "irab": "رسولاً: حال أو مفعول به، آية: اسم مجرور، الطير: مضاف إليه." },
    { "id": 50, "text": "وَمُصَدِّقًا لِّمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَلِأُحِلَّ لَكُم بَعْضَ الَّذِي حُرِّمَ عَلَيْكُمْ", "tafsir": "جاء عيسى مكملاً لشريعة موسى ومخففاً لبعض الأحكام التي كانت محرمة عليهم.", "irab": "مصدقاً: حال، التوراة: اسم مجرور، بعض: مفعول به." },
    { "id": 51, "text": "إِنَّ اللَّهَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۗ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ", "tafsir": "دعوة عيسى الصريحة لتوحيد الله وعبادته، وتأكيد أن هذا هو الطريق الصحيح.", "irab": "الله: اسم إن، ربي: خبر إن، فاعبدوه: فعل أمر ومفعول به." },
    { "id": 52, "text": "۞ فَلَمَّا أَحَسَّ عِيسَىٰ مِنْهُمُ الْكُفْرَ قَالَ مَنْ أَنصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنصَارُ اللَّهِ", "tafsir": "لما رأى عيسى عناد اليهود طلب النصرة، فاستجاب له الحواريون وأعلنوا إيمانهم.", "irab": "أحس: فعل ماض، عيسى: فاعل، نحن: مبتدأ، أنصار: خبر." },
    { "id": 53, "text": "رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ", "tafsir": "دعاء الحواريين واعترافهم بالإيمان واتباع عيسى عليه السلام.", "irab": "آمنا: فعل وفاعل، الرسول: مفعول به، الشاهدين: اسم مجرور بالياء." },
    { "id": 54, "text": "وَمَكَرُوا وَمَكَرَ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ", "tafsir": "دبر الكفار قتلاً لعيسى، فدبر الله نجاته ورفع إليه، والله أقوى تدبيراً.", "irab": "مكروا: فعل وفاعل، الله: مبتدأ، خير: خبر." },
    { "id": 55, "text": "إِذْ قَالَ اللَّهُ يَا عِيسَىٰ إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنَ الَّذِينَ كَفَرُوا", "tafsir": "وعد الله لعيسى بالنجاة والرفع وتطهيره من كيد الكفار وجعل أتباعه فوقهم.", "irab": "إني: اسم إن، متوفيك: خبر إن، عيسى: منادى." },
    { "id": 56, "text": "فَأَمَّا الَّذِينَ كَفَرُوا فَأُعَذِّبُهُمْ عَذَابًا شَدِيدًا فِي الدُّنْيَا وَالْآخِرَةِ", "tafsir": "جزاء الكافرين هو العذاب الأليم في الدارين، ولن يجدوا من ينقذهم.", "irab": "الذين: مبتدأ، عذاباً: مفعول مطلق، شديداً: نعت." },
    { "id": 57, "text": "وَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُوَفِّيهِمْ أُجُورَهُمْ ۗ وَاللَّهُ لَا يُحِبُّ الظَّالِمِينَ", "tafsir": "جزاء المؤمنين هو الثواب الكامل من الله، والله يبغض الظالمين.", "irab": "يوفيهم: فعل ومفعول أول، أجورهم: مفعول ثانٍ، الله: مبتدأ." },
    { "id": 58, "text": "ذَٰلِكَ نَتْلُوهُ عَلَيْكَ مِنَ الْآيَاتِ وَالذِّكْرِ الْحَكِيمِ", "tafsir": "هذه القصص هي آيات الله التي يوحى بها للنبي ﷺ لتكون عبرة وذكراً.", "irab": "ذلك: مبتدأ، نتلوه: جملة الخبر، الآيات: اسم مجرور." },
    { "id": 59, "text": "إِنَّ مَثَلَ عِيسَىٰ عِندَ اللَّهِ كَمَثَلِ آدَمَ ۖ خَلَقَهُ مِن تُرَابٍ ثُمَّ قَالَ لَهُ كُن فَيَكُونُ", "tafsir": "الرد على من ادعى ألوهية عيسى؛ فخلقه كخلق آدم من تراب بلا أب ولا أم بكلمة الله.", "irab": "مثل: اسم إن، الله: مضاف إليه، تراب: اسم مجرور، فيكون: مضارع." },
    { "id": 60, "text": "الْحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ الْمُمْتَرِينَ", "tafsir": "هذا الخبر هو الحق اليقين، فلا تكن من الشاكين فيه أبداً.", "irab": "الحق: مبتدأ، من ربك: خبر، تكن: مضارع ناقص مجزوم." },
    { "id": 61, "text": "فَمَنْ حَاجَّكَ فِيهِ مِن بَعْدِ مَا جَاءَكَ مِنَ الْعِلْمِ فَقُلْ تَعَالَوْا نَدْعُ أَبْنَاءَنَا وَأَبْنَاءَكُمْ", "tafsir": "آية المباهلة: دعوة المجادلين في عيسى للمباهلة والابتهال لله ليجعل لعنته على الكاذبين.", "irab": "من: اسم شرط مبتدأ، حاجك: فعل الشرط، أبناءنا: مفعول به." },
    { "id": 62, "text": "إِنَّ هَٰذَا لَهُوَ الْقَصَصُ الْحَقُّ ۚ وَمَا مِنْ إِلَٰهٍ إِلَّا اللَّهَ", "tafsir": "تأكيد أن هذا الكلام هو الخبر الصدق، ولا معبود بحق إلا الله القوي الحكيم.", "irab": "إن: حرف ناسخ، القصص: خبر إن، إله: مبتدأ مجرور لفظاً." },
    { "id": 63, "text": "فَإِن تَوَلَّوْا فَإِنَّ اللَّهَ عَلِيمٌ بِالْمُفْسِدِينَ", "tafsir": "إذا أعرضوا عن الحق، فالله مطلع على إفسادهم وسيجازيهم عليه.", "irab": "تولوا: فعل وفاعل، الله: اسم إن، المفسدين: اسم مجرور بالياء." },
    { "id": 64, "text": "قُلْ يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَىٰ كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ", "tafsir": "دعوة أهل الكتاب للاتفاق على أصل التوحيد وترك عبادة غير الله.", "irab": "تعالوا: فعل أمر، كلمة: اسم مجرور، لا نعبد: أن مضمر ومضارع منصوب." },
    { "id": 65, "text": "يَا أَهْلَ الْكِتَابِ لِمَ تُحَاجُّونَ فِي إِبْرَاهِيمَ وَمَا أُنزِلَتِ التَّوْرَاةُ وَالْإِنجِيلُ إِلَّا مِن بَعْدِهِ", "tafsir": "توبيخ أهل الكتاب لادعائهم أن إبراهيم كان على دينهم، مع أن كتبهم نزلت بعده بقرون.", "irab": "لم: اسم استفهام، تحاجون: مضارع مرفوع، التوراة: نائب فاعل." }
    { "id": 66, "text": "هَا أَنتُمْ هَٰؤُلَاءِ حَاجَجْتُمْ فِيمَا لَكُم بِهِ عِلْمٌ فَلِمَ تُحَاجُّونَ فِيمَا لَيْسَ لَكُم بِهِ عِلْمٌ", "tafsir": "توبيخ لمن يجادلون في أمور لا علم لهم بها، والله هو الذي يعلم الحقائق وأنتم لا تعلمونها.", "irab": "أنتم: مبتدأ، هؤلاء: خبر أو منادى، علم: مبتدأ مؤخر، الله: فاعل." },
    { "id": 67, "text": "مَا كَانَ إِبْرَاهِيمُ يَهُودِيًّا وَلَا نَصْرَانِيًّا وَلَٰكِن كَانَ حَنِيفًا مُّسْلِمًا", "tafsir": "تبرئة إبراهيم عليه السلام من اليهودية والنصرانية، وتأكيد أنه كان متبعاً للحق مخلصاً لله.", "irab": "إبراهيم: اسم كان، يهودياً: خبر كان، حنيفاً: خبر كان ثانٍ." },
    { "id": 68, "text": "إِنَّ أَوْلَى النَّاسِ بِإِبْرَاهِيمَ لَلَّذِينَ اتَّبَعُوهُ وَهَٰذَا النَّبِيُّ وَالَّذِينَ آمَنُوا", "tafsir": "أقرب الناس لإبراهيم هم أتباعه في زمانه، وهذا النبي محمد ﷺ والمؤمنون به.", "irab": "أولى: اسم إن، الناس: مضاف إليه، الذين: خبر إن، النبي: بدل." },
    { "id": 69, "text": "وَدَّت طَّائِفَةٌ مِّنْ أَهْلِ الْكِتَابِ لَوْ يُضِلُّونَكُمْ وَمَا يُضِلُّونَ إِلَّا أَنفُسَهُمْ", "tafsir": "رغبة بعض أهل الكتاب في إضلال المؤمنين، والواقع أنهم لا يضلون إلا أنفسهم.", "irab": "طائفة: فاعل، أنفسهم: مفعول به، يشعرون: مضارع مرفوع." },
    { "id": 70, "text": "يَا أَهْلَ الْكِتَابِ لِمَ تَكْفُرُونَ بِآيَاتِ اللَّهِ وَأَنتُمْ تَشْهَدُونَ", "tafsir": "إنكار على أهل الكتاب جحودهم بآيات الله وهم يعرفون أنها الحق من كتبهم.", "irab": "لم: استفهام، تكفرون: فعل وفاعل، أنتم: مبتدأ، تشهدون: خبر." },
    { "id": 71, "text": "يَا أَهْلَ الْكِتَابِ لِمَ تَلْبِسُونَ الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُونَ الْحَقَّ وَأَنتُمْ تَعْلَمُونَ", "tafsir": "توبيخهم على خلط الحق بالباطل وإخفاء صفات النبي ﷺ الموجودة عندهم.", "irab": "الحق: مفعول به، الباطل: اسم مجرور، تعلمون: مضارع مرفوع." },
    { "id": 72, "text": "وَقَالَت طَّائِفَةٌ مِّنْ أَهْلِ الْكِتَابِ آمِنُوا بِالَّذِي أُنزِلَ عَلَى الَّذِينَ آمَنُوا وَجْهَ النَّهَارِ", "tafsir": "حيلة بعض أهل الكتاب بإظهار الإيمان أول النهار والكفر آخره لشكيك المؤمنين.", "irab": "طائفة: فاعل، وجه: ظرف زمان، النهار: مضاف إليه." },
    { "id": 73, "text": "وَلَا تُؤْمِنُوا إِلَّا لِمَن تَبِعَ دِينَكُمْ قُلْ إِنَّ الْهُدَىٰ هُدَى اللَّهِ", "tafsir": "تحذيرهم لأتباعهم من الوثوق إلا بمنتسبي دينهم، والرد بأن الهدى هو هدى الله وحده.", "irab": "لا: ناهية، الهدى: اسم إن، هدى: خبر إن، الله: مضاف إليه." },
    { "id": 74, "text": "يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ ۗ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ", "tafsir": "الله يخص برحمته ونبوته من يشاء من عباده، وهو صاحب العطاء الواسع.", "irab": "من: مفعول به، الله: مبتدأ، ذو: خبر مرفوع بالواو، الفضل: مضاف إليه." },
    { "id": 75, "text": "وَمِنْ أَهْلِ الْكِتَابِ مَنْ إِن تَأْمَنْهُ بِقِنطَارٍ يُؤَدِّهِ إِلَيْكَ", "tafsir": "الأمانة والخيانة بين أهل الكتاب؛ منهم الأمين ومنهم الخائن المبرر لخيانته.", "irab": "من: مبتدأ، قنطار: اسم مجرور، يؤده: جواب الشرط، إليك: جار ومجرور." },
    { "id": 76, "text": "بَلَىٰ مَنْ أَوْفَىٰ بِعَهْدِهِ وَاتَّقَىٰ فَإِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ", "tafsir": "قاعدة عامة: من وفى بعهده واتقى الله، فإنه ينال محبة الله ورضوانه.", "irab": "من: اسم شرط مبتدأ، الله: اسم إن، يحب: جملة الخبر." },
    { "id": 77, "text": "إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا", "tafsir": "وعيد لمن يستبدل عهد الله بمال الدنيا؛ فلا حظ لهم في الآخرة ولا رحمة.", "irab": "الذين: اسم إن، ثمناً: مفعول به، قليلاً: نعت، لهم: خبر مقدم." },
    { "id": 78, "text": "وَإِنَّ مِنْهُمْ لَفَرِيقًا يَلْوُونَ أَلْسِنَتَهُم بِالْكِتَابِ لِتَحْسَبُوهُ مِنَ الْكِتَابِ", "tafsir": "خداع فريق منهم بتحريف الكلام ليوهموا الناس أنه من عند الله وهو كذب.", "irab": "فريقاً: اسم إن مؤخر، ألسنتهم: مفعول به، الكتاب: اسم مجرور." },
    { "id": 79, "text": "مَا كَانَ لِبَشَرٍ أَن يُؤْتِيَهُ اللَّهُ الْكِتَابَ وَالْحُكْمَ وَالنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُوا عِبَادًا لِّي", "tafsir": "لا يعقل لنبي آتاه الله النبوة أن يدعو الناس لعبادته من دون الله.", "irab": "بشر: اسم مجرور، الله: فاعل، الكتاب: مفعول به، عباداً: خبر كونوا." },
    { "id": 80, "text": "وَلَا يَأْمُرَكُمْ أَن تَتَّخِذُوا الْمَلَائِكَةَ وَالنَّبِيِّينَ أَرْبَابًا", "tafsir": "النبي لا يأمر الناس باتخاذ الملائكة أو الأنبياء آلهة، فهذا كفر لا يرضاه.", "irab": "تتخذوا: مضارع منصوب، الملائكة: مفعول به أول، أرباباً: مفعول ثانٍ." },
    { "id": 81, "text": "وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ النَّبِيِّينَ لَمَا آتَيْتُكُم مِّن كِتَابٍ وَحِكْمَةٍ", "tafsir": "العهد الغليظ على جميع الأنبياء بالإيمان بالنبي محمد ﷺ ونصرته إذا جاءهم.", "irab": "أخذ: فعل، الله: فاعل، ميثاق: مفعول به، النبيين: مضاف إليه." },
    { "id": 82, "text": "فَمَن تَوَلَّىٰ بَعْدَ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْفَاسِقُونَ", "tafsir": "من أعرض عن هذا الميثاق والعهد بعد هذا البيان فهو خارج عن طاعة الله.", "irab": "من: اسم شرط، أولئك: مبتدأ، هم: ضمير فصل، الفاسقون: خبر." },
    { "id": 83, "text": "أَفَغَيْرَ دِينِ اللَّهِ يَبْغُونَ وَلَهُ أَسْلَمَ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ", "tafsir": "استنكار لطلب دين غير دين الله، والكون كله خاضع لله طوعاً أو كرهاً.", "irab": "غير: مفعول به مقدم، الله: مضاف إليه، مَن: فاعل أسلم." },
    { "id": 84, "text": "قُلْ آمَنَّا بِاللَّهِ وَمَا أُنزِلَ عَلَيْنَا وَمَا أُنزِلَ عَلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ", "tafsir": "إعلان الإيمان بكل ما أنزل الله على الرسل دون تفرقة بين أحد منهم.", "irab": "آمنا: فعل وفاعل، الله: اسم مجرور، إبراهيم: اسم مجرور بالفتحة." },
    { "id": 85, "text": "وَمَن يَبْتَغِ غَيْرَ الْإِسْلَامِ دِينًا فَلَن يُقْبَلَ مِنْهُ وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ", "tafsir": "التأكيد أن الإسلام هو الدين الوحيد المقبول، ومن سواه فهو من الخاسرين.", "irab": "من: اسم شرط، يبتغ: فعل الشرط مجزوم، ديناً: حال أو تمييز، الخاسرين: اسم مجرور بالياء." }
    { "id": 86, "text": "كَيْفَ يَهْدِي اللَّهُ قَوْمًا كَفَرُوا بَعْدَ إِيمَانِهِمْ وَشَهِدُوا أَنَّ الرَّسُولَ حَقٌّ وَجَاءَهُمُ الْبَيِّنَاتُ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ", "tafsir": "استبعاد الهداية لمن كفر عناداً بعدما استبان له الحق وشهد بصدق الرسول.", "irab": "كيف: اسم استفهام، الله: فاعل، الرسول: اسم أن، حق: خبر أن." },
    { "id": 87, "text": "أُولَٰئِكَ جَزَاؤُهُمْ أَنَّ عَلَيْهِمْ لَعْنَةَ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ", "tafsir": "عقوبة المرتدين المعاندين هي الطرد من رحمة الله ولعنة خلقه أجمعين.", "irab": "أولئك: مبتدأ، جزاؤهم: مبتدأ ثان، لعنة: اسم أن مؤخر." },
    { "id": 88, "text": "خَالِدِينَ فِيهَا لَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ يُنظَرُونَ", "tafsir": "بقاء الكفار في اللعنة والعذاب أبداً دون تخفيف أو إمهال.", "irab": "خالدين: حال، العذاب: نائب فاعل، ينظرون: مضارع مبني للمجهول." },
    { "id": 89, "text": "إِلَّا الَّذِينَ تَابُوا مِن بَعْدِ ذَٰلِكَ وَأَصْلَحُوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "استثناء لمن تاب وأصلح عمله بعد كفره، فالله يقبل توبته برحمته الواسعة.", "irab": "الذين: اسم استثناء، تابوا: فعل وفاعل، الله: اسم إن، غفور: خبرها." },
    { "id": 90, "text": "إِنَّ الَّذِينَ كَفَرُوا بَعْدَ إِيمَانِهِمْ ثُمَّ ازْدَادُوا كُفْرًا لَّن تُقْبَلَ تَوْبَتُهُمْ وَأُولَٰئِكَ هُمُ الضَّالُّونَ", "tafsir": "من تمادى في الكفر وازداد فيه حتى الموت لن تقبل توبته عند الاحتضار.", "irab": "كفراً: تمييز، توبتهم: نائب فاعل، هم: مبتدأ، الضالون: خبر." },
    { "id": 91, "text": "إِنَّ الَّذِينَ كَفَرُوا وَمَاتُوا وَهُمْ كُفَّارٌ فَلَن يُقْبَلَ مِنْ أَحَدِهِم مِّلْءُ الْأَرْضِ ذَهَبًا وَلَوِ افْتَدَىٰ بِهِ ۗ أُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ وَمَا لَهُم مِّن نَّاصِرِينَ", "tafsir": "من مات على الكفر لا ينفعه فداء ولو بملء الأرض ذهباً، وله عذاب أليم.", "irab": "ذهباً: تمييز، ملء: نائب فاعل، عذاب: مبتدأ مؤخر." },
    { "id": 92, "text": "لَن تَنَالُوا الْبِرَّ حَتَّىٰ تُنفِقُوا مِمَّا تُحِبُّونَ ۚ وَمَا تُنفِقُوا مِن شَيْءٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ", "tafsir": "كمال الخير والبر لا يُنال إلا بالصدقة من أحب الأموال إلى النفس.", "irab": "تنالوا: مضارع منصوب، البر: مفعول به، تنفقوا: فعل الشرط." },
    { "id": 93, "text": "كُلُّ الطَّعَامِ كَانَ حِلًّا لِّبَنِي إِسْرَائِيلَ إِلَّا مَا حَرَّمَ إِسْرَائِيلُ عَلَىٰ نَفْسِهِ مِن قَبْلِ أَن تُنَزَّلَ التَّوْرَاةُ ۗ قُلْ فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا إِن كُنتُمْ صَادِقِينَ", "tafsir": "كل الأطعمة كانت حلالاً ليعقوب وبنيه إلا ما حرمه هو على نفسه لعلة.", "irab": "كل: مبتدأ، حلاً: خبر كان، إسرائيل: فاعل، التوراة: نائب فاعل." },
    { "id": 94, "text": "فَمَنِ افْتَرَىٰ عَلَى اللَّهِ الْكَذِبَ مِن بَعْدِ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ", "tafsir": "من اختلق الأكاذيب على الله في تحريم الحلال فهم المتجاوزون للحق.", "irab": "من: اسم شرط، الله: اسم مجرور، الظالمون: خبر." },
    { "id": 95, "text": "قُلْ صَدَقَ اللَّهُ ۗ فَاتَّبِعُوا مِلَّةَ إِبْرَاهِيمَ حَنِيفًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ", "tafsir": "الله أصدق القائلين، فاتبعوا دين إبراهيم القائم على التوحيد الخالص.", "irab": "صدق: فعل، الله: فاعل، حنيفاً: حال." },
    { "id": 96, "text": "إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبَارَكًا وَهُدًى لِّلْعَالَمِينَ", "tafsir": "الكعبة بمكة هي أول بيت بُني لعبادة الله وتوحيده في الأرض.", "irab": "أول: اسم إن، بكة: اسم مجرور بالفتحة، مباركاً: حال." },
    { "id": 97, "text": "فِيهِ آيَاتٌ بَيِّنَاتٌ مَّقَامُ إِبْرَاهِيمَ ۖ وَمَن دَخَلَهُ كَانَ آمِنًا ۗ وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلًا ۚ وَمَن كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ", "tafsir": "معالم الكعبة واضحة كالمقام، ووجوب الحج على كل مستطيع.", "irab": "آيات: مبتدأ مؤخر، آمناً: خبر كان، سبيلاً: تمييز." },
    { "id": 98, "text": "قُلْ يَا أَهْلَ الْكِتَابِ لِمَ تَكْفُرُونَ بِآيَاتِ اللَّهِ وَاللَّهُ شَهِيدٌ عَلَىٰ مَا تَعْمَلُونَ", "tafsir": "إنكار على أهل الكتاب جحودهم بالحق مع علم الله المحيط بأعمالهم.", "irab": "لم: استفهام، الله: مبتدأ، شهيد: خبر." },
    { "id": 99, "text": "قُلْ يَا أَهْلَ الْكِتَابِ لِمَ تَصُدُّونَ عَن سَبِيلِ اللَّهِ مَنْ آمَنَ تَبْغُونَهَا عِوَجًا وَأَنتُمْ شُهَدَاءُ ۗ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ", "tafsir": "توبيخهم لصدهم الناس عن الإسلام وطلبهم تحريف الحق وهم يعرفونه.", "irab": "تصدون: فعل وفاعل، مَن: مفعول به، عوجاً: مفعول به ثان." },
    { "id": 100, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِن تُطِيعُوا فَرِيقًا مِّنَ الَّذِينَ أُوتُوا الْكِتَابَ يَرُدُّوكُم بَعْدَ إِيمَانِكُمْ كَافِرِينَ", "tafsir": "تحذير المؤمنين من الانصياع لأهل الكتاب لكي لا يردوهم عن دينهم.", "irab": "تطيعوا: فعل الشرط، يردواكم: جواب الشرط، كافرين: حال." },
    { "id": 101, "text": "وَكَيْفَ تَكْفُرُونَ وَأَنتُمْ تُتْلَىٰ عَلَيْكُمْ آيَاتُ اللَّهِ وَفِيكُمْ رَسُولُهُ ۗ وَمَن يَعْتَصِم بِاللَّهِ فَقَدْ هُدِيَ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ", "tafsir": "استبعاد الكفر في ظل وجود القرآن والرسول، والاعتصام بالله هو طريق الهداية.", "irab": "آيات: نائب فاعل، رسوله: فاعل، هدي: مبني للمجهول." },
    { "id": 102, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ", "tafsir": "الأمر بالتقوى الصادقة والثبات على الإسلام حتى لحظة الموت.", "irab": "اتقوا: فعل أمر، حق: مفعول مطلق، مسلمون: خبر." },
    { "id": 103, "text": "وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا ۚ وَاذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَاءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَبْتُم بِنِعْمَتِهِ إِخْوَانًا", "tafsir": "دعوة للوحدة والاعتصام بالدين وتذكر نعمة الألفة بعد العداوة.", "irab": "اعتصموا: فعل أمر، حبل: اسم مجرور، أعداءً: خبر كنتم." },
    { "id": 104, "text": "وَلْتَكُن مِّنكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ ۚ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ", "tafsir": "وجوب الدعوة للخير والأمر بالمعروف لضمان فلاح الأمة.", "irab": "تكن: مضارع مجزوم، أمة: اسم تكن، المفلحون: خبر." },
    { "id": 105, "text": "وَلَا تَكُونُوا كَالَّذِينَ تَفَرَّقُوا وَاخْتَلَفُوا مِن بَعْدِ مَا جَاءَهُمُ الْبَيِّنَاتُ ۚ وَأُولَٰئِكَ لَهُمْ عَذَابٌ عَظِيمٌ", "tafsir": "النهي عن التفرق والاختلاف المذموم الذي وقعت فيه الأمم السابقة.", "irab": "لا: ناهية، الذين: اسم مجرور، عذاب: مبتدأ مؤخر." },
    { "id": 106, "text": "يَوْمَ تَبْيَضُّ وُجُوهٌ وَتَسْوَدُّ وُجُوهٌ ۚ فَأَمَّا الَّذِينَ اسْوَدَّتْ وُجُوهُهُمْ أَكَفَرْتُم بَعْدَ إِيمَانِكُمْ فَذُوقُوا الْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ", "tafsir": "مشهد يوم القيامة: بياض وجوه المؤمنين وسواد وجوه الكافرين وتوبيخهم.", "irab": "يوم: ظرف، وجوه: فاعل، الذين: مبتدأ، وجوههم: فاعل." },
    { "id": 107, "text": "وَأَمَّا الَّذِينَ ابْيَضَّتْ وُجُوهُهُمْ فَفِي رَحْمَةِ اللَّهِ هُمْ فِيهَا خَالِدُونَ", "tafsir": "المؤمنون أصحاب الوجوه النضرة يسكنون جنات النعيم خالدين.", "irab": "الذين: مبتدأ، وجوههم: فاعل، الله: مضاف إليه." },
    { "id": 108, "text": "تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۗ وَمَا اللَّهُ يُرِيدُ ظُلْمًا لِّلْعَالَمِينَ", "tafsir": "هذا الوحي الصادق نتلوه عليك يا محمد، والله منزه عن ظلم العباد.", "irab": "تلك: مبتدأ، آيات: خبر، الله: اسم ما العاملة عمل ليس، ظلماً: مفعول به." },
    { "id": 109, "text": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ", "tafsir": "كل ما في الكون ملك لله وحده، وإليه مرجع كل الخلائق للحساب.", "irab": "لله: خبر مقدم، ما: مبتدأ مؤخر، الأمور: نائب فاعل." },
    { "id": 110, "text": "كُنتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ تَأْمُرُونَ بِالْمَعْرُوفِ وَتَنْهَوْنَ عَنِ الْمُنكَرِ وَتُؤْمِنُونَ بِاللَّهِ ۗ وَلَوْ آمَنَ أَهْلُ الْكِتَابِ لَكَانَ خَيْرًا لَّهُم", "tafsir": "تشريف هذه الأمة بالخيرية لقيامها بواجب الأمر بالمعروف والنهي عن المنكر.", "irab": "كنتم: كان واسمها، خير: خبرها، أمة: مضاف إليه، المعروف: اسم مجرور." }
    { "id": 111, "text": "لَن يَضُرُّوكُمْ إِلَّا أَذًى ۖ وَإِن يُقَاتِلُوكُمْ يُوَلُّوكُمُ الْأَدْبَارَ ثُمَّ لَا يُنصَرُونَ", "tafsir": "لن ينال أهل الكتاب منكم إلا الأذى القولي، وإن قاتلوكم فروا منهزمين ولن يجدوا نصيراً.", "irab": "لن: ناصب، يضروكم: مضارع منصوب بحذف النون، الأدبار: مفعول به ثانٍ." },
    { "id": 112, "text": "ضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ أَيْنَ مَا ثُقِفُوا إِلَّا بِحَبْلٍ مِّنَ اللَّهِ وَحَبْلٍ مِّنَ النَّاسِ", "tafsir": "أحاطت باليهود المهانة والذل في كل مكان إلا بعهد من الله أو حماية من الناس.", "irab": "ضربت: فعل مبني للمجهول، الذلة: نائب فاعل، الله: مضاف إليه." },
    { "id": 113, "text": "۞ لَيْسُوا سَوَاءً ۗ مِّنْ أَهْلِ الْكِتَابِ أُمَّةٌ قَائِمَةٌ يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ", "tafsir": "ليس كل أهل الكتاب متشابهين، فهناك فئة مؤمنة مستقيمة تقرأ القرآن بالليل وتسجد لله.", "irab": "ليسوا: كان واسمها، سواءً: خبر ليس، أمة: مبتدأ مؤخر، آناء: ظرف زمان." },
    { "id": 114, "text": "يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ", "tafsir": "صفات المؤمنين من أهل الكتاب: الإيمان والعمل الصالح والمسارعة في الخيرات.", "irab": "يؤمنون: فعل وفاعل، المعروف: اسم مجرور، الصالحين: اسم مجرور بالياء." },
    { "id": 115, "text": "وَمَا يَفْعَلُوا مِنْ خَيْرٍ فَلَن يُكْفَرُوهُ ۗ وَاللَّهُ عَلِيمٌ بِالْمُتَّقِينَ", "tafsir": "كل عمل صالح يقدمونه لن يضيع أجرهم عليه عند الله، فالله عليم بالمتقين.", "irab": "ما: اسم شرط، يفعلوا: فعل الشرط، لن يكفروه: جواب الشرط، الله: مبتدأ." },
    { "id": 116, "text": "إِنَّ الَّذِينَ كَفَرُوا لَن تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلَا أَوْلَادُهُم مِّنَ اللَّهِ شَيْئًا", "tafsir": "أموال الكفار وأولادهم لن تنفعهم في دفع عذاب الله، ومصيرهم الخلود في النار.", "irab": "الذين: اسم إن، أموالهم: فاعل تغني، أصحاب: خبر لمبتدأ محذوف." },
    { "id": 117, "text": "مَثَلُ مَا يُنفِقُونَ فِي هَٰذِهِ الْحَيَاةِ الدُّنْيَا كَمَثَلِ رِيحٍ فِيهَا صِرٌّ أَصَابَتْ حَرْثَ قَوْمٍ", "tafsir": "مثل نفقات الكفار في بطلانها كمثل ريح باردة أهلكت زرع قوم ظلموا أنفسهم.", "irab": "مثل: مبتدأ، ما: مضاف إليه، ريح: اسم مجرور، حرث: مفعول به." },
    { "id": 118, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا بِطَانَةً مِّن دُونِكُمْ لَا يَأْلُونَكُمْ خَبَالًا", "tafsir": "النهي عن اتخاذ المقربين والأسرار من غير المؤمنين الذين يتمنون ضرركم.", "irab": "لا: ناهية، تتخذوا: مضارع مجزوم، بطانة: مفعول به، خبالاً: تمييز." },
    { "id": 119, "text": "هَا أَنتُمْ أُولَاءِ تُحِبُّونَهُمْ وَلَا يُحِبُّونَكُمْ وَتُؤْمِنُونَ بِالْكِتَابِ كُلِّهِ", "tafsir": "توبيخ للمؤمنين على حسن ظنهم بمن يبغضونهم ويكتمون العداوة لهم.", "irab": "أنتم: مبتدأ، تحبونهم: جملة الخبر، الكتاب: اسم مجرور." },
    { "id": 120, "text": "إِن تَمْسَسْكُمْ حَسَنَةٌ تَسُؤْهُمْ وَإِن تُصِبْكُمْ سَيِّئَةٌ يَفْرَحُوا بِهَا", "tafsir": "شدة عداوة المنافقين؛ يحزنون لنعمة تنالكم ويفرحون لمصيبة تصيبكم.", "irab": "إن: شرطية، تمسسكم: فعل الشرط، تسؤهم: جواب الشرط." },
    { "id": 121, "text": "وَإِذْ غَدَوْتَ مِنْ أَهْلِكَ تُبَوِّئُ الْمُؤْمِنِينَ مَقَاعِدَ لِلْقِتَالِ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ", "tafsir": "تذكير بخروج النبي ﷺ في غزوة أحد لتنظيم صفوف المؤمنين للقتال.", "irab": "غدوت: فعل وفاعل، المؤمنين: مفعول به، مقاعد: مفعول به ثانٍ." },
    { "id": 122, "text": "إِذْ هَمَّت طَّائِفَتَانِ مِنكُمْ أَن تَفْشَلَا وَاللَّهُ وَلِيُّهُمَا ۗ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ", "tafsir": "تردد قبيلتين في القتال فثبتهما الله، والحث على التوكل على الله وحده.", "irab": "طائفتان: فاعل مرفوع بالألف، أن تفشلا: مصدر مؤول، الله: مبتدأ." },
    { "id": 123, "text": "وَلَقَدْ نَصَرَكُمُ اللَّهُ بِبَدْرٍ وَأَنتُمْ أَذِلَّةٌ ۖ فَاتَّقُوا اللَّهَ لَعَلَّكُمْ تَشْكُرُونَ", "tafsir": "تذكير بنصر الله للمسلمين في بدر رغم قلة عددهم ليرسخ التقوى والشكر.", "irab": "نصركم: فعل ومفعول، الله: فاعل، أنتم أذلة: جملة حالية." },
    { "id": 124, "text": "إِذْ تَقُولُ لِلْمُؤْمِنِينَ أَلَن يَكْفِيَكُمْ أَن يُمِدَّكُمْ رَبُّكُم بِثَلَاثَةِ آلَافٍ مِّنَ الْمَلَائِكَةِ مُنزَلِينَ", "tafsir": "وعد النبي ﷺ للمؤمنين بمدد من الملائكة لتثبيت قلوبهم في المعركة.", "irab": "يمايكم: مصدر مؤول فاعل يكفي، آلاف: مضاف إليه، منزلين: نعت مجرور بالياء." },
    { "id": 125, "text": "بَلَىٰ ۚ إِن تَصْبِرُوا وَتَتَّقُوا وَيَأْتُوكُم مِّن فَوْرِهِمْ هَٰذَا يُمْدِدْكُمْ رَبُّكُم بِخَمْسَةِ آلَافٍ", "tafsir": "شرط المدد الإلهي هو الصبر والتقوى، فيزيد الله الملائكة لـ 5 آلاف.", "irab": "تصبروا: فعل الشرط، يمددكم: جواب الشرط، ربكم: فاعل." },
    { "id": 126, "text": "وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ لَكُمْ وَلِتَطْمَئِنَّ قُلُوبُكُم بِهِ", "tafsir": "إرسال الملائكة كان بشارة وتثبيتاً للقلوب، فالتصر من عند الله وحده.", "irab": "جعله: فعل ومفعولين، الله: فاعل، بشرى: مفعول به ثانٍ." },
    { "id": 127, "text": "لِيَقْطَعَ طَرَفًا مِّنَ الَّذِينَ كَفَرُوا أَوْ يَكْبِتَهُمْ فَيَنقَلِبُوا خَائِبِينَ", "tafsir": "الهدف من النصر هو إضعاف الكفار بالقتل أو الهزيمة ليعودوا خاسرين.", "irab": "ليقطع: مضارع منصوب، طرفاً: مفعول به، خائبين: حال منصوب بالياء." },
    { "id": 128, "text": "لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ", "tafsir": "الأمر كله لله، هو الذي يقبل التوبة أو يعذب العاصين بحسب مشيئته.", "irab": "ليس: فعل ناقص، لك: خبر مقدم، شيء: اسم ليس مؤخر." },
    { "id": 129, "text": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ يَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ", "tafsir": "الله مالك الكون، يغفر ويرحم أو يعذب بعدله وحكمته الواسعة.", "irab": "لله: خبر مقدم، ما: مبتدأ مؤخر، يشاء: مضارع مرفوع." },
    { "id": 130, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَأْكُلُوا الرِّبَا أَضْعَافًا مُّضَاعَفَةً ۖ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ", "tafsir": "تحريم الربا بجميع أشكاله الفاحشة، والأمر بالتقوى لنيل الفلاح والنجاح.", "irab": "لا: ناهية، تأكلوا: مضارع مجزوم، الربا: مفعول به، أضعافاً: حال." }
    { "id": 131, "text": "وَاتَّقُوا النَّارَ الَّتِي أُعِدَّتْ لِلْكَافِرِينَ", "tafsir": "التحذير من النار التي هيأها الله لمن جحد بآياته وعصى أمره.", "irab": "اتقوا: فعل أمر، النار: مفعول به، أعدت: فعل مبني للمجهول." },
    { "id": 132, "text": "وَأَطِيعُوا اللَّهَ وَالرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ", "tafsir": "الأمر بالتزام طاعة الله واتباع نبيه ﷺ لتنالوا رحمة الله الواسعة.", "irab": "أطيعوا: فعل أمر، الله: مفعول به، ترحمون: مضارع مبني للمجهول." },
    { "id": 133, "text": "۞ وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ", "tafsir": "حث المؤمنين على المبادرة بالأعمال الصالحة لنيل المغفرة والجنة التي هيأت للمتقين.", "irab": "سارعوا: فعل أمر، عرضها: مبتدأ، السماوات: خبر، المتقين: اسم مجرور." },
    { "id": 134, "text": "الَّذِينَ يُنفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ ۗ وَاللَّهُ يُحبُّ الْمُحْسِنِينَ", "tafsir": "من صفات المتقين: الإنفاق في كل حال، والتحكم في الغضب، والصفح عن الناس.", "irab": "الذين: نعت للمتقين، الغيظ: مفعول به، الله: مبتدأ، يحب: جملة الخبر." },
    { "id": 135, "text": "وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنفُسَهُمْ ذَكَرُوا اللَّهَ فَاسْتَغْفَرُوا لِذُنُوبِهِمْ", "tafsir": "صفة المؤمنين في سرعة التوبة والرجوع لله بالاستغفار عند الوقوع في المعصية.", "irab": "فعلوا: فعل وفاعل، فاحشة: مفعول به، ذنوبهم: اسم مجرور." },
    { "id": 136, "text": "أُولَٰئِكَ جَزَاؤُهُم مَّغْفِرَةٌ مِّن رَّبِّهِمْ وَجَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا", "tafsir": "ثواب التائبين المتقين هو مغفرة الذنوب والخلود في جنات النعيم.", "irab": "أولئك: مبتدأ، جزاؤهم: مبتدأ ثان، مغفرة: خبر المبتدأ الثاني." },
    { "id": 137, "text": "قَدْ خَلَتْ مِن قَبْلِكُمْ سُنَنٌ فَسِيرُوا فِي الْأَرْضِ فَانظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ", "tafsir": "عبرة في أحوال الأمم السابقة؛ فالله يهلك المكذبين وينصر المؤمنين بمرور الزمن.", "irab": "سنن: فاعل، عاقبة: اسم كان، المكذبين: مضاف إليه مجرور بالياء." },
    { "id": 138, "text": "هَٰذَا بَيَانٌ لِّلنَّاسِ وَهُدًى وَمَوْعِظَةٌ لِّلْمُتَّقِينَ", "tafsir": "هذا القرآن هو توضيح للحق، وإرشاد، وتذكرة لمن يخشى الله ويتقيه.", "irab": "هذا: مبتدأ، بيان: خبر، المتقين: اسم مجرور بالياء." },
    { "id": 139, "text": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ", "tafsir": "تثبيت للمؤمنين بعد غزوة أحد: لا تضعفوا ولا تحزنوا فأنتم الغالبون بإيمانكم.", "irab": "لا: ناهية، تهنوا: مضارع مجزوم بحذف النون، أنتم الأعلون: جملة حالية." },
    { "id": 140, "text": "إِن يَمْسَسْكُمْ قَرْحٌ فَقَدْ مَسَّ الْقَوْمَ قَرْحٌ مِّثْلُهُ ۚ وَتِلْكَ الْأَيَّامُ نُدَاوِلُهَا بَيْنَ النَّاسِ", "tafsir": "الأيام دول؛ فإذا نالكم أذى في أحد، فقد نال الكفار مثله في بدر، والحكمة تمحيص المؤمنين.", "irab": "قرح: فاعل، الأيام: بدل، نداولها: فعل مضارع ومفعول به." },
    { "id": 141, "text": "وَلِيُمَحِّصَ اللَّهَ الَّذِينَ آمَنُوا وَيَمْحَقَ الْكَافِرِينَ", "tafsir": "ابتلاء المؤمنين يهدف لتطهير صفوفهم واختبار صبرهم، وإهلاك الكافرين بذنوبهم.", "irab": "يمحص: فعل مضارع، الله: فاعل، الذين: مفعول به." },
    { "id": 142, "text": "أَمْ حَسِبْتُمْ أَن تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جَاهَدُوا مِنكُمْ وَيَعْلَمَ الصَّابِرِينَ", "tafsir": "الجنة لا تنال إلا بالجهاد والصبر، واختبار الله لعباده ليظهر الصادق من الكاذب.", "irab": "تدخلوا: مضارع منصوب، الله: فاعل، الصابرين: مفعول به منصوب بالياء." },
    { "id": 143, "text": "وَلَقَدْ كُنتُمْ تَمَنَّوْنَ الْمَوْتَ مِن قَبْلِ أَن تَلْقَوْهُ فَقَدْ رَأَيْتُمُوهُ وَأَنتُمْ تَنظُرُونَ", "tafsir": "تذكير للمؤمنين بتمنيهم الشهادة قبل المعركة، فلما وقعت رأوها بأعينهم فكان عليهم الصبر.", "irab": "الموت: مفعول به، رأيتموه: فعل وفاعل ومفعول، تنظرون: جملة حالية." },
    { "id": 144, "text": "وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِن قَبْلِهِ الرُّسُلُ ۚ أَفَإِن مَّاتَ أَوْ قُتِلَ انقَلَبْتُمْ عَلَىٰ أَعْقَابِكُمْ", "tafsir": "تأكيد أن النبي ﷺ بشر ورسول، وموته لا يبرر الرجوع عن الدين، فالله حي لا يموت.", "irab": "محمد: مبتدأ، رسول: خبر، مات: فعل الشرط، انقلبتم: جواب الشرط." },
    { "id": 145, "text": "وَمَا كَانَ لِنَفْسٍ أَن تَمُوتَ إِلَّا بِإِذْنِ اللَّهِ كِتَابًا مُّؤَجَّلًا", "tafsir": "الموت لا يقع إلا بتقدير الله في وقته المحدد، ومن أراد ثواب الدنيا ناله ومن أراد الآخرة زدناه فيها.", "irab": "أن تموت: فاعل كان (أو خبرها)، الله: مضاف إليه، مؤجلاً: نعت." },
    { "id": 146, "text": "وَكَأَيِّن مِّن نَّبِيٍّ قَاتَلَ مَعَهُ رِبِّيُّونَ كَثِيرٌ فَمَا وَهَنُوا لِمَا أَصَابَهُمْ فِي سَبِيلِ اللَّهِ", "tafsir": "حث على الاقتداء بأتباع الأنبياء السابقين الذين صبروا ولم يضعفوا أمام الابتلاء.", "irab": "نبي: اسم مجرور، ربيون: فاعل مرفوع بالواو، وهنوا: فعل وفاعل." },
    { "id": 147, "text": "وَمَا كَانَ قَوْلَهُمْ إِلَّا أَن قَالُوا رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا", "tafsir": "دعاء المؤمنين الصادقين في الشدائد بطلب المغفرة والثبات والنصر على الكافرين.", "irab": "قولهم: اسم كان، اغفر: فعل أمر (دعاء)، أقدامنا: مفعول به." },
    { "id": 148, "text": "فَآتَاهُمُ اللَّهُ ثَوَابَ الدُّنْيَا وَحُسْنَ ثَوَابِ الْآخِرَةِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ", "tafsir": "جزاء الصابرين النصر في الدنيا والجنة في الآخرة، والله يحب من أحسن العمل.", "irab": "آتاهم: فعل ومفعول، الله: فاعل، ثواب: مفعول به ثانٍ." },
    { "id": 149, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِن تُطِيعُوا الَّذِينَ كَفَرُوا يَرُدُّوكُمْ عَلَىٰ أَعْقَابِكُمْ فَتَنقَلِبُوا خَاسِرِينَ", "tafsir": "تحذير من طاعة الكفار لأنهم سيقودونكم للردة والخسران في الدنيا والآخرة.", "irab": "تطيعوا: فعل الشرط، يردوكم: جواب الشرط، خاسرين: حال منصوب بالياء." },
    { "id": 150, "text": "بَلِ اللَّهُ مَوْلَاكُمْ ۖ وَهُوَ خَيْرُ النَّاصِرِينَ", "tafsir": "الله هو ناصركم وحافظكم، فلا تطلبوا النصرة من غيره فهو أفضل نصير.", "irab": "الله: مبتدأ، مولاكم: خبر، هو: مبتدأ، خير: خبر." }
    { "id": 151, "text": "سَنُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ بِمَا أَشْرَكُوا بِاللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا ۖ وَمَأْوَاهُمُ النَّارُ ۚ وَبِئْسَ مَثْوَى الظَّالِمِينَ", "tafsir": "وعد من الله بقذف الخوف في قلوب الكفار بسبب شركهم، ومصيرهم النهائي هو النار.", "irab": "الرعب: مفعول به، ما: اسم موصول، النار: مبتدأ مؤخر، مثوى: فاعل بئس." },
    { "id": 152, "text": "وَلَقَدْ صَدَقَكُمُ اللَّهُ وَعْدَهُ إِذْ تَحُسُّونَهُم بِإِذْنِهِ ۖ حَتَّىٰ إِذَا فَشِلْتُمْ وَتَنَازَعْتُمْ فِي الْأَمْرِ وَعَصَيْتُم", "tafsir": "الله حقق وعده بالنصر في بداية أحد، لكن الفشل والنزاع وعصيان أمر الرسول غير النتائج.", "irab": "الله: فاعل، وعده: مفعول به ثانٍ، فشلتم: فعل وفاعل، الأمر: اسم مجرور." },
    { "id": 153, "text": "۞ إِذْ تُصْعِدُونَ وَلَا تَلْوُونَ عَلَىٰ أَحَدٍ وَالرَّسُولُ يَدْعُوكُمْ فِي أُخْرَاكُمْ فَأَثَابَكُمْ غَمًّا بِغَمٍّ", "tafsir": "تذكير بحال المؤمنين أثناء الهزيمة والفرار، وجزاء ذلك كان الغم والمشقة.", "irab": "تُصعدون: مضارع مرفوع، الرسول: مبتدأ، غماً: مفعول به ثانٍ." },
    { "id": 154, "text": "ثُمَّ أَنزَلَ عَلَيْكُم مِّن بَعْدِ الْغَمِّ أَمَنَةً نُّعَاسًا يَغْشَىٰ طَائِفَةً مِّنكُمْ ۖ وَطَائِفَةٌ قَدْ أَهَمَّتْهُمْ أَنفُسُهُمْ", "tafsir": "رحمة الله بإنزال النعاس كأمن للمؤمنين، بينما المنافقون كانوا في قلق وشك.", "irab": "أمنة: مفعول به، نعاساً: بدل، طائفة: مفعول به، أنفسهم: فاعل." },
    { "id": 155, "text": "إِنَّ الَّذِينَ تَوَلَّوْا مِنكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ إِنَّمَا اسْتَزَلَّهُمُ الشَّيْطَانُ بِبَعْضِ مَا كَسَبُوا", "tafsir": "الذين فروا يوم أحد كان بسبب خطايا سابقة استغلها الشيطان، وقد عفا الله عنهم.", "irab": "الذين: اسم إن، الجمعان: فاعل مرفوع بالألف، الشيطان: فاعل." },
    { "id": 156, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَكُونُوا كَالَّذِينَ كَفَرُوا وَقَالُوا لِإِخْوَانِهِمْ إِذَا ضَرَبُوا فِي الْأَرْضِ أَوْ كَانُوا غُزًّى", "tafsir": "النهي عن التشبه بالكفار في قولهم إن الموت كان بسبب الخروج للقتال أو السفر.", "irab": "لا: ناهية، إخوانهم: اسم مجرور، الأرض: اسم مجرور، حسرة: مفعول لأجله." },
    { "id": 157, "text": "وَلَئِن قُتِلْتُمْ فِي سَبِيلِ اللَّهِ أَوْ مُتُّمْ لَمَغْفِرَةٌ مِّنَ اللَّهِ وَرَحْمَةٌ خَيْرٌ مِّمَّا يَجْمَعُونَ", "tafsir": "الشهادة أو الموت في سبيل الله عاقبته مغفرة ورحمة هي خير من حطام الدنيا.", "irab": "مغفرة: مبتدأ، الله: مضاف إليه، خير: خبر المبتدأ." },
    { "id": 158, "text": "وَلَئِن مُّتُّمْ أَوْ قُتِلْتُمْ لَإِلَى اللَّهِ تُحْشَرُونَ", "tafsir": "سواء كان الموت طبيعياً أو قتلاً، فالمرجع والحشر إلى الله وحده للحساب.", "irab": "إلى الله: جار ومجرور متعلق بـ تحشرون، تحشرون: مضارع مبني للمجهول." },
    { "id": 159, "text": "فَبِمَا رَحْمَةٍ مِّنَ اللَّهِ لِنتَ لَهُمْ ۖ وَلَوْ كُنتَ فَظًّا غَلِيظَ الْقَلْبِ لَانفَضُّوا مِنْ حَوْلِكَ", "tafsir": "حث النبي ﷺ على اللين والعفو والمشاورة، فهي من أسباب تأليف القلوب.", "irab": "رحمة: اسم مجرور، لِنتَ: فعل وفاعل، فظاً: خبر كنت، حولك: مضاف إليه." },
    { "id": 160, "text": "إِن يَنصُرْكُمُ اللَّهُ فَلَا غَالِبَ لَكُمْ ۖ وَإِن يَخْذُلْكُمْ فَمَن ذَا الَّذِي يَنصُرُكُم مِّن بَعْدِهِ", "tafsir": "النصر من الله وحده؛ فإذا نصركم فلا قوة تهزمكم، وإذا خذلكم فلا ناصر لكم.", "irab": "ينصركم: فعل الشرط، الله: فاعل، غالب: اسم لا، مَن: اسم استفهام." },
    { "id": 161, "text": "وَمَا كَانَ لِنَبِيٍّ أَن يَغُلَّ ۚ وَمَن يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيَامَةِ", "tafsir": "تنزيه الأنبياء عن الخيانة في الغنائم، والوعيد لمن يسرق منها بالفضيحة يوم القيامة.", "irab": "نبي: اسم مجرور، مَن: اسم شرط، يأتِ: جواب الشرط، يوم: ظرف." },
    { "id": 162, "text": "أَفَمَنِ اتَّبَعَ رِضْوَانَ اللَّهِ كَمَن بَاءَ بِسَخَطٍ مِّنَ اللَّهِ وَمَأْوَاهُ جَهَنَّمُ ۚ وَبِئْسَ الْمَصِيرُ", "tafsir": "لا يستوي من يسعى لرضا الله ومن يستحق غضبه ويكون مصيره جهنم.", "irab": "مَن: مبتدأ، رضوان: مفعول به، جهنم: مبتدأ، المصير: فاعل بئس." },
    { "id": 163, "text": "هُمْ دَرَجَاتٌ عِندَ اللَّهِ ۗ وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ", "tafsir": "الناس منازل ورتب عند الله بحسب أعمالهم، والله مطلع على كل فعل.", "irab": "هم: مبتدأ، درجات: خبر، الله: مضاف إليه، بصير: خبر." },
    { "id": 164, "text": "لَقَدْ مَنَّ اللَّهُ عَلَى الْمُؤْمِنِينَ إِذْ بَعَثَ فِيهِمْ رَسُولًا مِّنْ أَنفُسِهِمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ", "tafsir": "منة الله الكبرى بإرسال النبي محمد ﷺ لتعليم الناس وتزكيتهم.", "irab": "منّ: فعل، الله: فاعل، رسولاً: مفعول به، آياته: مفعول به." },
    { "id": 165, "text": "أَوَلَمَّا أَصَابَتْكُم مُّصِيبَةٌ قَدْ أَصَبْتُم مِّثْلَيْهَا قُلْتُمْ أَنَّىٰ هَٰذَا ۖ قُلْ هُوَ مِنْ عِندِ أَنفُسِكُمْ", "tafsir": "توضيح أن ما أصاب المؤمنين في أحد كان بسبب مخالفتهم، رغم نصرهم السابق في بدر.", "irab": "مصيبة: فاعل، مثليها: مفعول به منصوب بالياء، أنفسكم: مضاف إليه." },
    { "id": 166, "text": "وَمَا أَصَابَكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ فَبِإِذْنِ اللَّهِ وَلِيَعْلَمَ الْمُؤْمِنِينَ", "tafsir": "ما حدث في المعركة كان بقدر الله وحكمته لتمييز المؤمنين الصادقين.", "irab": "أصابكم: فعل ومفعول، الجمعان: فاعل، المؤمنين: مفعول به منصوب بالياء." },
    { "id": 167, "text": "وَلِيَعْلَمَ الَّذِينَ نَافَقُوا ۚ وَقِيلَ لَهُمْ تَعَالَوْا قَاتِلُوا فِي سَبِيلِ اللَّهِ أَوِ ادْفَعُوا", "tafsir": "كشف حال المنافقين الذين تخلوا عن القتال بحجج واهية وهم للكفر أقرب.", "irab": "الذين: مفعول به، نافقوا: صلة الموصول، قيل: مبني للمجهول، قتالاً: مفعول مطلق." },
    { "id": 168, "text": "الَّذِينَ قَالُوا لِإِخْوَانِهِمْ وَقَعَدُوا لَوْ أَطَاعُونَا مَا قُتِلُوا ۗ قُلْ فَادْرَءُوا عَنْ أَنفُسِكُمُ الْمَوْتَ", "tafsir": "رد على المنافقين الذين ادعوا أن القعود ينجي من الموت؛ فالموت لا يدفعه حذر.", "irab": "الذين: مبتدأ، إخوانهم: اسم مجرور، الموت: مفعول به." },
    { "id": 169, "text": "وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا ۚ بَلْ أَحْيَاءٌ عِندَ رَبِّهِمْ يُرْزَقُونَ", "tafsir": "الشهداء ليسوا موتى، بل هم أحياء عند الله ينعمون برزقه وفضله.", "irab": "لا: ناهية، تحسبن: مضارع مبني على الفتح، الذين: مفعول أول، أمواتاً: مفعول ثانٍ." },
    { "id": 170, "text": "فَرِحِينَ بِمَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ وَيَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا بِهِم مِّنْ خَلْفِهِمْ", "tafsir": "حال الشهداء في فرح دائم بفضل الله وبمن سيلحق بهم من إخوانهم المجاهدين.", "irab": "فرحين: حال، الله: فاعل، الذين: اسم مجرور، خوف: مبتدأ مؤخر." }
    { "id": 171, "text": "۞ يَسْتَبْشِرُونَ بِنِعْمَةٍ مِّنَ اللَّهِ وَفَضْلٍ وَأَنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُؤْمِنِينَ", "tafsir": "فرح الشهداء بنعم الله المتتالية، وتأكيد أن الله يحفظ أجر أهل الإيمان.", "irab": "يستبشرون: مضارع مرفوع، الله: اسم إن، أجر: مفعول به." },
    { "id": 172, "text": "الَّذِينَ اسْتَجَابُوا لِلَّهِ وَالرَّسُولِ مِن بَعْدِ مَا أَصَابَهُمُ الْقَرْحُ ۚ لِلَّذِينَ أَحْسَنُوا مِنْهُمْ وَاتَّقَوْا أَجْرٌ عَظِيمٌ", "tafsir": "ثناء على المؤمنين الذين خرجوا مع النبي ﷺ رغم جراحهم بعد أحد.", "irab": "الذين: مبتدأ، استجابوا: فعل وفاعل، أجر: مبتدأ مؤخر، عظيم: نعت." },
    { "id": 173, "text": "الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ", "tafsir": "ثبات المؤمنين أمام تهديد الأعداء، واعتمادهم الكلي على كفاية الله لهم.", "irab": "الناس: فاعل، إيماناً: تمييز، الله: مبتدأ، الوكيل: فاعل نعم." },
    { "id": 174, "text": "فَانقَلَبُوا بِنِعْمَةٍ مِّنَ اللَّهِ وَفَضْلٍ لَّمْ يَمْسَسْهُمْ سُوءٌ وَاتَّبَعُوا رِضْوَانَ اللَّهِ", "tafsir": "عودة المؤمنين سالمين غانمين بفضل الله واتباعهم لمرضاته.", "irab": "انقلبوا: فعل وفاعل، سوء: فاعل، الله: مضاف إليه." },
    { "id": 175, "text": "إِنَّمَا ذَٰلِكُمُ الشَّيْطَانُ يُخَوِّفُ أَوْلِيَاءَهُ فَلَا تَخَافُوهُمْ وَخَافُونِ إِن كُنتُم مُّؤْمِنِينَ", "tafsir": "الشيطان هو من يخوفكم بأتباعه، فلا تخشوا غير الله إن كنتم صادقين.", "irab": "الشيطان: خبر، أولياءه: مفعول به ثان، خافون: فعل أمر ومفعول." },
    { "id": 176, "text": "وَلَا يَحْزُنكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ ۚ إِنَّهُمْ لَن يَضُرُّوا اللَّهَ شَيْئًا", "tafsir": "تصبير للنبي ﷺ بأن مسارعة الكفار في جحودهم لن تضر دين الله أبداً.", "irab": "لا: ناهية، الذين: فاعل، الله: مفعول به، شيئاً: مفعول مطلق." },
    { "id": 177, "text": "إِنَّ الَّذِينَ اشْتَرَوُا الْكُفْرَ بِالْإِيمَانِ لَن يَضُرُّوا اللَّهَ شَيْئًا وَلَهُمْ عَذَابٌ أَلِيمٌ", "tafsir": "من استبدل الإيمان بالكفر لن يضر إلا نفسه، ومصيره العذاب الموجع.", "irab": "اشتروا: فعل وفاعل، الكفر: مفعول به، عذاب: مبتدأ مؤخر." },
    { "id": 178, "text": "وَلَا يَحْسَبَنَّ الَّذِينَ كَفَرُوا أَنَّمَا نُمْلِي لَهُمْ خَيْرٌ لِّأَنفُسِهِمْ ۚ إِنَّمَا نُمْلِي لَهُمْ لِيَزْدَادُوا إِثْمًا", "tafsir": "إمهال الله للكفار ليس حباً فيهم، بل ليزدادوا إثماً ويستحقوا العذاب المهين.", "irab": "الذين: فاعل، إثماً: تمييز، عذاب: مبتدأ مؤخر، مهين: نعت." },
    { "id": 179, "text": "مَّا كَانَ اللَّهُ لِيَذَرَ الْمُؤْمِنِينَ عَلَىٰ مَا أَنتُمْ عَلَيْهِ حَتَّىٰ يَمِيزَ الْخَبِيثَ مِنَ الطَّيِّبِ", "tafsir": "سنة الله في الابتلاء لتمييز المنافق من المؤمن الصادق.", "irab": "الله: اسم كان، يذر: مضارع منصوب، الخبيث: مفعول به." },
    { "id": 180, "text": "وَلَا يَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ هُوَ خَيْرًا لَّهُم ۖ بَلْ هُوَ شَرٌّ لَّهُمْ", "tafsir": "البخل بالمال وبال حقيقي على صاحبه يوم القيامة، فالله وارث كل شيء.", "irab": "الذين: فاعل، هو: ضمير فصل، خيراً: مفعول ثان، الله: فاعل." },
    { "id": 181, "text": "لَّقَدْ سَمِعَ اللَّهُ قَوْلَ الَّذِينَ قَالُوا إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ", "tafsir": "رد على استهزاء اليهود وادعائهم الباطل، ووعيد بكتابة قولهم وقتلهم الأنبياء.", "irab": "الله: فاعل، الذين: مضاف إليه، نحن: مبتدأ، أغنياء: خبر." },
    { "id": 182, "text": "ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيدِ", "tafsir": "هذا العذاب بسبب أعمالكم، والله منزه عن ظلم خلقه.", "irab": "أيديكم: فاعل، الله: اسم إن، بظلام: خبر ليس مجرور لفظاً." },
    { "id": 183, "text": "الَّذِينَ قَالُوا إِنَّ اللَّهَ عَهِيدَ إِلَيْنَا أَلَّا نُؤْمِنَ لِرَسُولٍ حَتَّىٰ يَأْتِيَنَا بِقُرْبَانٍ تَأْكُلُهُ النَّارُ", "tafsir": "حجج أهل الكتاب الواهية لعدم الإيمان، ورد الله عليهم بقتلهم للأنبياء السابقين.", "irab": "نؤمن: مضارع منصوب، رسول: اسم مجرور، النار: فاعل." },
    { "id": 184, "text": "فَإِن كَذَّبُوكَ فَقَدْ كُذِّبَ رُسُلٌ مِّن قَبْلِكَ جَاءُوا بِالْبَيِّنَاتِ وَالزُّبُرِ وَالْكِتَابِ الْمُنِيرِ", "tafsir": "تسلية للنبي ﷺ بأن تكذيب الرسل سنة قديمة رغم وضوح معجزاتهم.", "irab": "كذبوك: فعل وفاعل ومفعول، رسل: نائب فاعل." },
    { "id": 185, "text": "كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ۗ وَإِنَّمَا تُوَفَّوْنَ أُجُورَكُمْ يَوْمَ الْقِيَامَةِ", "tafsir": "حقيقة الموت الحتمية، وأن الجزاء الكامل والمتاع الحقيقي ليس في الدنيا الزائلة.", "irab": "كل: مبتدأ، ذائقة: خبر، الموت: مضاف إليه، أجوركم: مفعول به ثان." },
    { "id": 186, "text": "۞ لَتُبْلَوُنَّ فِي أَمْوَالِكُمْ وَأَنفُسِكُمْ وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ", "tafsir": "تنبيه بوقوع الابتلاء في المال والنفس والأذى القولي، والحث على الصبر والتقوى.", "irab": "تبلون: مضارع مبني للمجهول، أموالكم: اسم مجرور، أذى: مفعول به." },
    { "id": 187, "text": "وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلَا تَكْتُمُونَهُ", "tafsir": "العهد على أهل العلم ببيان الحق وعدم كتمانه، وذم من اشترى به دنيا فانية.", "irab": "الله: فاعل، ميثاق: مفعول به، الناس: اسم مجرور." },
    { "id": 188, "text": "لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوا وَّيُحِبُّونَ أَن يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا", "tafsir": "الوعيد لمن يفرح بضلاله ويحب المدح الكاذب، فلن ينجوا من العذاب.", "irab": "الذين: مفعول أول، يحمدوا: مضارع منصوب، بمفازة: خبر ثانٍ مجرور لفظاً." },
    { "id": 189, "text": "وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ", "tafsir": "تأكيد ملكية الله المطلقة للكون وقدرته التي لا يعجزها شيء.", "irab": "لله: خبر مقدم، ملك: مبتدأ مؤخر، الله: مبتدأ، قدير: خبر." },
    { "id": 190, "text": "إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِّأُولِي الْأَلْبَابِ", "tafsir": "الأدلة الكونية في الخلق وتعاقب الزمن هي علامات لأصحاب العقول الراجحة.", "irab": "في خلق: خبر إن مقدم، آيات: اسم إن مؤخر، الألباب: مضاف إليه." },
    { "id": 191, "text": "الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ", "tafsir": "صفات أولي الألباب: دوام ذكر الله والتفكر في عظمة خلقه والاعتراف بحكمته.", "irab": "قياماً: حال، الله: مفعول به، باطلاً: مفعول به ثانٍ أو حال." },
    { "id": 192, "text": "رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ ۖ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ", "tafsir": "دعاء بالنجاة من خزي النار، وتأكيد أنه لا ناصر للظالمين من غضب الله.", "irab": "إنك: إن واسمها، مَن: اسم شرط، النار: مفعول به، أنصار: مبتدأ مؤخر." },
    { "id": 193, "text": "رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا", "tafsir": "إعلان الاستجابة لدعوة الرسول ﷺ وطلب المغفرة وتكفير السيئات.", "irab": "منادياً: مفعول به، ذنوبنا: مفعول به، الأبرار: اسم مجرور." },
    { "id": 194, "text": "رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ", "tafsir": "دعاء بإنجاز الوعد بالنصر والجنة وعدم الفضيحة يوم العرض الأكبر.", "irab": "آتنا: فعل دعاء ومفعول، رسلك: اسم مجرور، القيامة: مضاف إليه." },
    { "id": 195, "text": "فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ", "tafsir": "قبول الله لدعائهم وتأكيد المساواة في الجزاء بين الرجل والمرأة على العمل الصالح.", "irab": "ربهم: فاعل، عمل: مفعول به، ذكر: اسم مجرور، ثواباً: مفعول مطلق." },
    { "id": 196, "text": "لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُوا فِي الْبِلَادِ", "tafsir": "تحذير من الاغترار بما ينعم به الكفار من تجارة وقوة في الدنيا.", "irab": "لا: ناهية، تقلب: فاعل، الذين: مضاف إليه، البلاد: اسم مجرور." },
    { "id": 197, "text": "مَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ جَهَنَّمُ ۚ وَبِئْسَ الْمِهَادُ", "tafsir": "نعيم الكفار زائل ومؤقت، ومصيرهم الأبدي في جهنم وبئس المستقر.", "irab": "متاع: خبر لمبتدأ محذوف، مأواهم: مبتدأ، جهنم: خبر." },
    { "id": 198, "text": "لَٰكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا", "tafsir": "جزاء المتقين هو النعيم المقيم والخلود في الجنات بضيافة الله ورضوانه.", "irab": "الذين: مبتدأ، جنات: مبتدأ مؤخر، خالدين: حال، الله: مضاف إليه." },
    { "id": 199, "text": "وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَن يُؤْمِنُ بِاللَّهِ وَمَا أُنزِلَ إِلَيْكُمْ وَمَا أُنزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ", "tafsir": "ثناء على المنصفين من أهل الكتاب الذين آمنوا بالحق ولم يستبدلوه بدنيا.", "irab": "مَن: اسم إن مؤخر، الله: اسم مجرور، خاشعين: حال منصوب بالياء." },
    { "id": 200, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ", "tafsir": "وصية ختامية بالصبر والمصابرة والمرابطة والتقوى كطريق وحيد للفلاح.", "irab": "اصبروا: فعل أمر، صابروا: معطوف، الله: مفعول به، تفلحون: مضارع مرفوع." }
] },
    { "id": 4, "name": "النساء", "verses": [    { "id": 1, "text": "يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُم مِّن نَّفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا", "tafsir": "الأمر بتقوى الله الذي خلق البشر من أصل واحد (آدم)، وخلق منه زوجته (حواء)، ونشر منهما الرجال والنساء.", "irab": "يا أيها: منادى، الناس: بدل، ربكم: مفعول به، نفس: اسم مجرور." },
    { "id": 2, "text": "وَآتُوا الْيَتَامَىٰ أَمْوَالَهُمْ ۖ وَلَا تَتَبَدَّلُوا الْخَبِيثَ بِالطَّيِّبِ ۖ وَلَا تَأْكُلُوا أَمْوَالَهُمْ إِلَىٰ أَمْوَالِكُمْ", "tafsir": "وجوب إعطاء اليتامى أموالهم كاملة عند بلوغهم، والنهي عن استبدال مالهم الجيد بمالكم الرديء أو خلطه لسرقته.", "irab": "آتوا: فعل أمر، اليتامى: مفعول به أول، أموالهم: مفعول به ثانٍ، حوباً: خبر كان." },
    { "id": 3, "text": "وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَىٰ فَانكِحُوا مَا طَابَ لَكُم مِّنَ النِّسَاءِ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ", "tafsir": "إباحة تعدد الزوجات إلى أربع لمن خاف ألا يعدل في أموال اليتامى، مع اشتراط العدل بين الزوجات.", "irab": "خفتم: فعل وفاعل، النساء: اسم مجرور، مثنى: حال منصوبة بالفتحة المقدرة." },
    { "id": 4, "text": "وَآتُوا النِّسَاءَ صَدُقَاتِهِنَّ نِحْلَةً ۚ فَإِن طِبْنَ لَكُمْ عَن شَيْءٍ مِّنْهُ نَفْسًا فَكُلُوهُ هَنِيئًا مَّرِيئًا", "tafsir": "وجوب إعطاء المهر للمرأة عطاءً مفروضاً، إلا إذا تنازلت عن جزء منه برضاها فهو حلال للزوج.", "irab": "النساء: مفعول به أول، صدقاتهن: مفعول ثانٍ، نحلة: حال أو مفعول مطلق، نفساً: تمييز." },
    { "id": 5, "text": "وَلَا تُؤْتُوا السُّفَهَاءَ أَمْوَالَكُمُ الَّتِي جَعَلَ اللَّهُ لَكُمْ قِيَامًا وَارْزُقُوهُمْ فِيهَا وَاكْسُوهُمْ", "tafsir": "النهي عن تمكين غير المحسنين للتصرف في الأموال (كالسفهاء واليتامى الصغار) مع وجوب النفقة عليهم منها.", "irab": "لا: ناهية، السفهاء: مفعول به أول، الله: فاعل، قولاً: مفعول مطلق." },
    { "id": 6, "text": "وَابْتَلُوا الْيَتَامَىٰ حَتَّىٰ إِذَا بَلَغُوا النِّكَاحَ فَإِنْ آنَسْتُم مِّنْهُمْ رُشْدًا فَادْفَعُوا إِلَيْهِمْ أَمْوَالَهُمْ", "tafsir": "اختبار اليتامى في حسن التصرف قبل تسليمهم أموالهم عند البلوغ، والنهي عن الإسراف في أكلها قبل كبرهم.", "irab": "ابتلوا: فعل أمر، اليتامى: مفعول به، رشداً: مفعول به، حسيباً: حال." },
    { "id": 7, "text": "لِّلرِّجَالِ نَصِيبٌ مِّمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ وَلِلنِّسَاءِ نَصِيبٌ مِّمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ", "tafsir": "إقرار حق الميراث للرجال والنساء في مال الأقارب، سواء كان المال قليلاً أو كثيراً.", "irab": "للرجال: خبر مقدم، نصيب: مبتدأ مؤخر، مفروضاً: نعت." },
    { "id": 8, "text": "وَإِذَا حَضَرَ الْقِسْمَةَ أُولُو الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينُ فَارْزُقُوهُم مِّنْهُ", "tafsir": "استحباب إعطاء الأقارب غير الوارثين والفقراء شيئاً من المالك عند تقسيم الميراث تطييباً لخواطرهم.", "irab": "حضر: فعل، القسمة: مفعول به مقدم، أولو: فاعل مرفوع بالواو." },
    { "id": 9, "text": "وَلْيَخْشَ الَّذِينَ لَوْ تَرَكُوا مِنْ خَلْفِهِمْ ذُرِّيَّةً ضِعَافًا خَافُوا عَلَيْهِمْ فَلْيَتَّقُوا اللَّهَ", "tafsir": "حث الأوصياء على معاملة اليتامى بالعدل والرحمة كما يحبون أن يُعامل أبناؤهم بعد موتهم.", "irab": "يخشى: مضارع مجزوم، الذين: فاعل، ذرية: مفعول به، الله: مفعول به." },
    { "id": 10, "text": "إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَىٰ ظُلْمًا إِنَّمَا يَأْكُلُونَ فِي بُطُونِهِمْ نَارًا", "tafsir": "وعيد شديد لمن يسرق أموال اليتامى؛ فإنما يملأ بطنه بنار تحرقه يوم القيامة.", "irab": "الذين: اسم إن، ظلماً: مفعول لأجله أو حال، ناراً: مفعول به." },
    { "id": 11, "text": "يُوصِيكُمُ اللَّهُ فِي أَوْلَادِكُمْ ۖ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنثَيَيْنِ ۚ فَإِن كُنَّ نِسَاءً فَوْقَ اثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ", "tafsir": "تفصيل أحكام ميراث الأولاد والوالدين؛ للذكر ضعف الأنثى، وحالات نصيب البنات والأبوين.", "irab": "الله: فاعل، الذكر: اسم مجرور، ثلثا: مبتدأ مؤخر، فريضة: حال." },
    { "id": 12, "text": "وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ إِن لَّمْ يَكُن لَّهُنَّ وَلَدٌ ۚ فَإِن كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ الرُّبُعُ", "tafsir": "تفصيل ميراث الزوج والزوجة والإخوة لأم؛ مع بيان تأثير وجود الفرع الوارث على النصيب.", "irab": "لكم: خبر مقدم، نصف: مبتدأ مؤخر، ولد: اسم يكن، ديناً: مفعول به." },
    { "id": 13, "text": "تِلْكَ حُدُودُ اللَّهِ ۚ وَمَن يُطِيعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ", "tafsir": "هذه الأحكام هي حدود الله وشرعه، ومن يلتزم بها فله الجنة والخلود والفضل العظيم.", "irab": "تلك: مبتدأ، حدود: خبر، يطع: فعل الشرط، يدخله: جواب الشرط." },
    { "id": 14, "text": "وَمَن يَعْصِ اللَّهَ وَرَسُولَهُ وَيَتَعَدَّ حُدُودَهُ يُدْخِلْهُ نَارًا خَالِدًا فِيهَا وَلَهُ عَذَابٌ مُّهِينٌ", "tafsir": "وعيد لمن يتجاوز حدود الله في المواريث وغيرها؛ فجزاؤه الخلود في النار والعذاب المذل.", "irab": "يعص: فعل الشرط مجزوم، ناراً: مفعول به ثانٍ، خالداً: حال." },
    { "id": 15, "text": "وَاللَّاتِي يَأْتِينَ الْفَاحِشَةَ مِن نِّسَائِكُمْ فَاسْتَشْهِدُوا عَلَيْهِنَّ أَرْبَعَةً مِّنكُمْ", "tafsir": "حكم الفاحشة في بداية الإسلام (قبل النسخ) بالحبس في البيوت، مع اشتراط أربعة شهود.", "irab": "اللاتي: مبتدأ، نسائكم: اسم مجرور، أربعة: مفعول به." },
    { "id": 16, "text": "وَاللَّذَانِ يَأْتِيَانِهَا مِنكُمْ فَآذُوهُمَا ۖ فَإِن تَابَا وَأَصْلَحَا فَأَعْرِضُوا عَنْهُمَا ۗ إِنَّ اللَّهَ كَانَ تَوَّابًا رَّحِيمًا", "tafsir": "عقوبة من يرتكب الفاحشة بالأذى، فإن تابا نترك أذاهما، فالله يقبل التوبة.", "irab": "اللذان: مبتدأ، آذوهما: فعل أمر، تواباً: خبر كان." },
    { "id": 17, "text": "إِنَّمَا التَّوْبَةُ عَلَى اللَّهِ لِلَّذِينَ يَعْمَلُونَ السُّوءَ بِجَهَالَةٍ ثُمَّ يَتُوبُونَ مِن قَرِيبٍ", "tafsir": "الله يقبل توبة من فعل الذنب بجهالة (أي غلبة شهوة) ثم سارع بالتوبة قبل الموت.", "irab": "التوبة: مبتدأ، السوء: مفعول به، قريب: اسم مجرور." },
    { "id": 18, "text": "وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّىٰ إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الْآنَ", "tafsir": "لا تقبل توبة من أصر على الذنوب حتى حضره الموت، ولا من مات كافراً.", "irab": "ليست: فعل ناقص، الموت: فاعل، الآن: ظرف زمان، أليماً: نعت." },
    { "id": 19, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَحِلُّ لَكُمْ أَن تَرِثُوا النِّسَاءَ كَرْهًا ۖ وَلَا تَعْضُلُوهُنَّ", "tafsir": "النهي عن إكراه النساء على البقاء مع الزوج أو التنازل عن مهورهن، والأمر بحسن العشرة.", "irab": "لا: نافية، أن ترثوا: فاعل يحل، كرهاً: حال، معروف: اسم مجرور." },
    { "id": 20, "text": "وَإِنْ أَرَدتُّمُ اسْتِبْدَالَ زَوْجٍ مَّكَانَ زَوْجٍ وَآتَيْتُمْ إِحْدَاهُنَّ قِنطَارًا فَلَا تَأْخُذُوا مِنْهُ شَيْئًا", "tafsir": "إذا أراد الزوج استبدال زوجته بغيرها، فلا يحق له استرداد شيء من مهرها ولو كان كثيراً.", "irab": "أردتم: فعل وفاعل، زوج: مضاف إليه، قنطاراً: مفعول به ثانٍ، شيئاً: مفعول به." }
    { "id": 21, "text": "وَكَيْفَ تَأْخُذُونَهُ وَقَدْ أَفْضَىٰ بَعْضُكُمْ إِلَىٰ بَعْضٍ وَأَخَذْنَ مِنكُم مِّيثَاقًا غَلِيظًا", "tafsir": "استنكار استرداد المهر من الزوجة بعد العشرة الزوجية والعهد الموثق بينكما.", "irab": "كيف: اسم استفهام، بعضكم: فاعل، ميثاقاً: مفعول به، غليظاً: نعت." },
    { "id": 22, "text": "وَلَا تَنكِحُوا مَا نَكَحَ آبَاؤُكُم مِّنَ النِّسَاءِ إِلَّا مَا قَدْ سَلَفَ ۚ إِنَّهُ كَانَ فَاحِشَةً وَمَقْتًا وَسَاءَ سَبِيلًا", "tafsir": "تحريم الزواج من زوجات الآباء، ووصف ذلك بأنه ذنب قبيح وطريق سوء.", "irab": "لا: ناهية، آباؤكم: فاعل، إنه: إن واسمها، فاحشة: خبر كان." },
    { "id": 23, "text": "حُرِّمَتْ عَلَيْكُمْ أُمَّهَاتُكُمْ وَبَنَاتُكُمْ وَأَخَوَاتُكُمْ وَعَمَّاتُكُمْ وَخَالَاتُكُمْ", "tafsir": "تفصيل المحرمات من النساء بسبب النسب أو الرضاع أو المصاهرة.", "irab": "حرمت: فعل مبني للمجهول، أمهاتكم: نائب فاعل، الله: اسم إن، رحيماً: خبر كان." },
    { "id": 24, "text": "وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ ۖ كِتَابَ اللَّهِ عَلَيْكُمْ", "tafsir": "تحريم الزواج من النساء المتزوجات، وبيان ما يحل من النساء والبحث عنهن بالمال.", "irab": "المحصنات: معطوف على نائب الفاعل، كتاب: مفعول مطلق، الله: مضاف إليه." },
    { "id": 25, "text": "وَمَن لَّمْ يَسْتَطِعْ مِنكُمْ طَوْلًا أَن يَنكِحَ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ فَمِمَّا مَلَكَتْ أَيْمَانُكُم", "tafsir": "جواز الزواج من الإماء المؤمنات لمن عجز عن مهر الحرة، مع الحث على الصبر.", "irab": "من: اسم شرط، طولاً: مفعول به، المحصنات: مفعول به، الله: اسم إن." },
    { "id": 26, "text": "يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِن قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ", "tafsir": "الله يهدف من هذه الأحكام توضيح الحق لكم وإرشادكم لمنهاج الصالحين السابقين.", "irab": "يريد: فعل، الله: فاعل، سنن: مفعول به، عليم: خبر إن." },
    { "id": 27, "text": "وَاللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَن تَمِيلُوا مَيْلًا عَظِيمًا", "tafsir": "الله يريد لكم الخير والتوبة، بينما يسعى أهل الضلال والشهوات لإبعادكم عن الحق.", "irab": "الله: مبتدأ، يريد: فعل، الذين: فاعل، ميلاً: مفعول مطلق." },
    { "id": 28, "text": "يُرِيدُ اللَّهُ أَن يُخَفِّفَ عَنكُمْ ۚ وَخُلِقَ الْإِنسَانُ ضَعِيفًا", "tafsir": "رحمة الله بالتيسير في الأحكام مراعاة لضعف الإنسان أمام شهواته.", "irab": "يريد: فعل، الله: فاعل، الإنسان: نائب فاعل، ضعيفاً: حال." },
    { "id": 29, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَأْكُلُوا أَمْوَالَكُم بَيْنَكُم بِالْبَاطِلِ إِلَّا أَن تَكُونَ تِجَارَةً", "tafsir": "النهي عن أكل أموال الناس بالظلم، وإباحة الربح من التجارة القائمة على التراضي.", "irab": "لا: ناهية، أموالكم: مفعول به، تجارة: خبر تكون، رحيماً: خبر كان." },
    { "id": 30, "text": "وَمَن يَفْعَلْ ذَٰلِكَ عُدْوَانًا وَظُلْمًا فَسَوْفَ نُصْلِيهِ نَارًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا", "tafsir": "وعيد شديد لمن يعتدي على الأنفس أو الأموال بالظلم، فجزاؤه نار جهنم.", "irab": "من: اسم شرط، عدواناً: حال، نصليه: جواب الشرط، يسيراً: خبر كان." },
    { "id": 31, "text": "إِن تَجْتَنِبُوا كَبَائِرَ مَا تُنْهَوْنَ عَنْهُ نُكَفِّرْ عَنكُمْ سَيِّئَاتِكُمْ وَنُدْخِلْكُم مُّدْخَلًا كَرِيمًا", "tafsir": "وعد من الله بتكفير صغائر الذنوب وإدخال الجنة لمن ابتعد عن كبائر المحرمات.", "irab": "تجتنبوا: فعل الشرط، كبائر: مفعول به، نكفر: جواب الشرط، مدخلاً: مفعول مطلق." },
    { "id": 32, "text": "وَلَا تَتَمَنَّوْا مَا فَضَّلَ اللَّهُ بِهِ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِّلرِّجَالِ نَصِيبٌ مِّمَّا اكْتَسَبُوا", "tafsir": "النهي عن الحسد وتمني ما خص الله به غيركم، فلكل عمله ونصيبه من فضل الله.", "irab": "لا: ناهية، الله: فاعل، للرجال: خبر مقدم، نصيب: مبتدأ مؤخر." },
    { "id": 33, "text": "وَلِكُلٍّ جَعَلْنَا مَوَالِيَ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ ۚ وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ فَآتُوهُمْ نَصِيبَهُمْ", "tafsir": "تأكيد حقوق الورثة في الميراث، ووجوب أداء الحقوق لمن ارتبطتم معهم بعهود.", "irab": "جعلنا: فعل وفاعل، موالي: مفعول به، آتوهم: فعل أمر، شهيداً: خبر كان." },
    { "id": 4, "text": "الرِّجَالُ قَوَّامُونَ عَلَى النِّسَاء scale بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ وَبِمَا أَنفَقُوا مِنْ أَمْوَالِهِمْ", "tafsir": "قيادة الرجل للاسرة بسبب التفضيل الفطري وواجبه في النفقة، وصفات الزوجات الصالحات.", "irab": "الرجال: مبتدأ، قوامون: خبر، الصالحات: مبتدأ لخبر محذوف، كبيراً: نعت." },
    { "id": 35, "text": "وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِّنْ أَهْلِهِ وَحَكَمًا مِّنْ أَهْلِهَا", "tafsir": "خطوات علاج الخلاف الزوجي بإرسال حكمين للإصلاح، فالله يوفق بينهما إذا أرادا ذلك.", "irab": "خفتم: فعل وفاعل، شقاق: مفعول به، حكماً: مفعول به، علياً: خبر كان." },
    { "id": 36, "text": "۞ وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا وَبِذِي الْقُرْبَىٰ", "tafsir": "وصايا جامعة: توحيد الله، وبر الوالدين، والإحسان للأقارب واليتامى والمساكين والجار.", "irab": "اعبدوا: فعل أمر، الله: مفعول به، إحساناً: مفعول مطلق، فخوراً: خبر كان." },
    { "id": 37, "text": "الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ وَيَكْتُمُونَ مَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ", "tafsir": "ذم البخلاء الذين يخفون نعم الله ويشجعون غيرهم على البخل، ووعيدهم بالعذاب.", "irab": "الذين: مبتدأ، الناس: مفعول به، الله: فاعل، مهيناً: نعت." },
    { "id": 38, "text": "وَالَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ رِئَاءَ النَّاسِ وَلَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ", "tafsir": "ذم المنفقين رياءً وتظاهراً دون إيمان حقيقي، ووصف الشيطان بأنه بئس القرين لهم.", "irab": "أموالهم: مفعول به، رئاء: مفعول لأجله، الشيطان: اسم كان، قريناً: تمييز." },
    { "id": 39, "text": "وَمَاذَا عَلَيْهِمْ لَوْ آمَنُوا بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَأَنفَقُوا مِمَّا رَزَقَهُمُ اللَّهُ", "tafsir": "أي ضرر يلحقهم لو أخلصوا الإيمان لله وأنفقوا ابتغاء مرضاته؟ فالله عليم بهم.", "irab": "ماذا: اسم استفهام مبتدأ، الله: فاعل، عليماً: خبر كان." },
    { "id": 40, "text": "إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ ۖ وَإِن تَكُ حَسَنَةً يُضَاعِفْهَا وَيُؤْتِ مِن لَّدُنْهُ أَجْرًا عَظِيمًا", "tafsir": "عدل الله المطلق؛ فهو لا يظلم أحداً، بل يضاعف الحسنات ويمنح الأجر العظيم.", "irab": "الله: اسم إن، مثقال: مفعول مطلق، حسنة: اسم تك، عظيماً: نعت." }
    { "id": 41, "text": "فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَٰؤُلَاءِ شَهِيدًا", "tafsir": "مشهد عظيم يوم القيامة حين يشهد كل نبي على أمته، ويشهد النبي محمد ﷺ على الناس جميعاً.", "irab": "كيف: اسم استفهام، أمة: مضاف إليه، شهيداً: حال منصوبة." },
    { "id": 42, "text": "يَوْمَئِذٍ يَوَدُّ الَّذِينَ كَفَرُوا وَعَصَوُا الرَّسُولَ لَوْ تُسَوَّىٰ بِهِمُ الْأَرْضُ", "tafsir": "ندم الكفار يوم القيامة وتمنيهم لو انشقت الأرض وابتلعتهم لشدة ما يرون، ولا يكتمون الله شيئاً.", "irab": "يود: فعل مضارع، الذين: فاعل، الأرض: نائب فاعل، الله: مفعول به." },
    { "id": 43, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْرَبُوا الصَّلَاةَ وَأَنتُمْ سُكَارَىٰ حَتَّىٰ تَعْلَمُوا مَا تَقُولُونَ", "tafsir": "بداية التدرج في تحريم الخمر بالنهي عن الصلاة في حال السكر، وأحكام التيمم عند فقد الماء.", "irab": "لا: ناهية، الصلاة: مفعول به، أنتم سكارى: جملة حالية، غفوراً: خبر كان." },
    { "id": 44, "text": "أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِّنَ الْكِتَابِ يَشْتَرُونَ الضَّلَالَةَ وَيُرِيدُونَ أَن تَضِلُّوا السَّبِيلَ", "tafsir": "ذم أهل الكتاب الذين يستبدلون الهدى بالضلال ويسعون لإضلال المؤمنين عن الطريق المستقيم.", "irab": "الذين: اسم مجرور، نصيباً: مفعول به، الضلالة: مفعول به، السبيل: مفعول به." },
    { "id": 45, "text": "وَاللَّهُ أَعْلَمُ بِأَعْدَائِكُمْ ۚ وَكَفَىٰ بِاللَّهِ وَلِيًّا وَكَفَىٰ بِاللَّهِ نَصِيرًا", "tafsir": "الله يعلم عداوة هؤلاء لكم أكثر منكم، وحسبكم الله ولياً يحفظكم ونصيراً ينصركم.", "irab": "الله: مبتدأ، أعلم: خبر، ولياً: تمييز، نصيراً: تمييز." },
    { "id": 46, "text": "مِّنَ الَّذِينَ هَادُوا يُحَرِّفُونَ الْكَلِمَ عَن مَّوَاضِعِهِ وَيَقُولُونَ سَمِعْنَا وَعَصَيْنَا", "tafsir": "صفات اليهود في تحريف كلام الله وسوء أدبهم مع النبي ﷺ بالقول واللسان.", "irab": "الكلم: مفعول به، مواضعه: اسم مجرور، قليلاً: حال أو نعت." },
    { "id": 47, "text": "يَا أَيُّهَا الَّذِينَ أُوتُوا الْكِتَابَ آمِنُوا بِمَا نَزَّلْنَا مُصَدِّقًا لِّمَا مَعَكُم مِّن قَبْلِ أَن نَّطْمِسَ وُجُوهًا", "tafsir": "دعوة أهل الكتاب للإيمان بالقرآن قبل وقوع العقوبة بطمس الوجوه أو اللعن.", "irab": "آمنوا: فعل أمر، مصدقاً: حال، وجوهاً: مفعول به، مفعولاً: خبر كان." },
    { "id": 48, "text": "إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَاءُ", "tafsir": "الشرك بالله هو الذنب الوحيد الذي لا يغفر لمن مات عليه، وما سواه تحت مشيئة الله.", "irab": "الله: اسم إن، يشرك: مضارع مبني للمجهول، من: فاعل يشاء، عظيماً: نعت." },
    { "id": 49, "text": "أَلَمْ تَرَ إِلَى الَّذِينَ يُزَكُّونَ أَنفُسَهُم ۚ بَلِ اللَّهُ يُزَكِّي مَن يَشَاءُ وَلَا يُظْلَمُونَ فَتِيلًا", "tafsir": "ذم مدح الإنسان لنفسه وتنزيهها بالباطل، فالله هو الذي يزكي من يستحق بعدله.", "irab": "الذين: اسم مجرور، أنفسهم: مفعول به، الله: مبتدأ، فتيلاً: مفعول مطلق." },
    { "id": 50, "text": "انظُرْ كَيْفَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ ۖ وَكَفَىٰ بِهِ إِثْمًا مُّبِينًا", "tafsir": "التعجب من جرأتهم في اختلاق الأكاذيب على الله، وهذا كافٍ ليكون ذنباً كبيراً ظاهراً.", "irab": "انظر: فعل أمر، الكذب: مفعول به، إثماً: تمييز، مبيناً: نعت." },
    { "id": 51, "text": "أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِّنَ الْكِتَابِ يُؤْمِنُونَ بِالْجِبْتِ وَالطَّاغُوتِ", "tafsir": "تعجب من حال بعض أهل الكتاب الذين آمنوا بالأوثان والشيطان وفضلوهم على المؤمنين.", "irab": "الجبت: اسم مجرور، الذين: اسم مجرور، سبيلاً: تمييز." },
    { "id": 52, "text": "أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ ۖ وَمَن يَلْعَنِ اللَّهُ فَلَن تَجِدَ لَهُ نَصِيرًا", "tafsir": "هؤلاء مطرودون من رحمة الله، ومن يطرده الله فلا ناصر له ولا معين.", "irab": "أولئك: مبتدأ، الله: فاعل، لن: ناصب، نصيراً: مفعول به." },
    { "id": 53, "text": "أَمْ لَهُمْ نَصِيبٌ مِّنَ الْمُلْكِ فَإِذًا لَّا يُؤْتُونَ النَّاسَ نَقِيرًا", "tafsir": "ليس لهؤلاء أي ملك، ولو كان لديهم لبخلوا على الناس بأقل القليل (النقير).", "irab": "نصيب: مبتدأ مؤخر، الملك: اسم مجرور، الناس: مفعول به أول، نقيراً: مفعول ثانٍ." },
    { "id": 54, "text": "أَمْ يَحْسُدُونَ النَّاسَ عَلَىٰ مَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ ۖ فَقَدْ آتَيْنَا آلَ إِبْرَاهِيمَ الْكِتَابَ", "tafsir": "حسد أهل الكتاب للنبي ﷺ وأصحابه على النبوة والفضل، رغم إتيان الله لآل إبراهيم سابقاً.", "irab": "يحسدون: مضارع مرفوع، الناس: مفعول به، الله: فاعل، سعيراً: خبر كان." },
    { "id": 55, "text": "فَمِنْهُم مَّنْ آمَنَ بِهِ وَمِنْهُم مَّن صَدَّ عَنْهُ ۚ وَكَفَىٰ بِجَهَنَّمَ سَعِيرًا", "tafsir": "انقسام الناس تجاه الحق؛ منهم المؤمن ومنهم المعرض، وجهنم كافية لعقابهم.", "irab": "منهم: خبر مقدم، مَن: مبتدأ مؤخر، جهنم: اسم مجرور لفظاً، سعيراً: تمييز." },
    { "id": 56, "text": "إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِنَا سَوْفَ نُصْلِيهِمْ نَارًا كُلَّمَا نَضِجَتْ جُلُودُهُم بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا", "tafsir": "وعيد مخيف للكفار بتجدد جلودهم في النار ليستمر عذابهم، تأكيداً لقدرة الله وعدله.", "irab": "الذين: اسم إن، ناراً: مفعول ثانٍ، جلودهم: فاعل، عزيزاً: خبر كان." },
    { "id": 57, "text": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ", "tafsir": "بشارة المؤمنين بالجنة والنعيم المقيم والظلال الوافرة والزوجات المطهرة.", "irab": "جنات: مفعول ثانٍ، الأنهار: فاعل، ظلاً: مفعول به ثانٍ." },
    { "id": 58, "text": "۞ إِنَّ اللَّهَ يَأْمُرُكُمْ أَن تُؤَدُّوا الْأَمَانَاتِ إِلَىٰ أَهْلِهَا وَإِذَا حَكَمْتُم بَيْنَ النَّاسِ أَن تَحْكُمُوا بِالْعَدْلِ", "tafsir": "الأمر بوجوب أداء الأمانات لأصحابها والعدل في الحكم بين الناس، وهذا وعظ حسن من الله.", "irab": "الله: اسم إن، الأمانات: مفعول به منصوب بالكسرة، سميعاً: خبر كان." },
    { "id": 59, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنكُمْ", "tafsir": "وجوب طاعة الله ورسوله وأصحاب القرار في طاعة الله، والرجوع للقرآن والسنة عند الخلاف.", "irab": "أطيعوا: فعل أمر، الله: مفعول به، تأويلاً: نعت أو تمييز." },
    { "id": 60, "text": "أَلَمْ تَرَ إِلَى الَّذِينَ يَزْعُمُونَ أَنَّهُمْ آمَنُوا بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ", "tafsir": "التعجب من المنافقين الذين يدعون الإيمان ويريدون التحاكم للطاغوت (غير شرع الله).", "irab": "تجاه الطاغوت: اسم مجرور، الشيطان: فاعل يريد، بعيداً: نعت." }
    { "id": 61, "text": "وَإِذَا قِيلَ لَهُمْ تَعَالَوْا إِلَىٰ مَا أَنزَلَ اللَّهُ وَإِلَى الرَّسُولِ رَأَيْتَ الْمُنَافِقِينَ يَصُدُّونَ عَنكَ صُدُودًا", "tafsir": "حال المنافقين عند دعوتهم لتحكيم شرع الله؛ يعرضون ويمنعون الناس عنك إعراضاً شديداً.", "irab": "قيل: مبني للمجهول، المنافقين: مفعول به منصوب بالياء، صدوداً: مفعول مطلق." },
    { "id": 62, "text": "فَكَيْفَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ ثُمَّ جَاءُوكَ يَحْلِفُونَ بِاللَّهِ إِنْ أَرَدْنَا إِلَّا إِحْسَانًا وَتَوْفِيقًا", "tafsir": "تناقض المنافقين؛ يعرضون عن الشرع، فإذا وقعوا في ورطة بسبب أفعالهم جاءوا يعتذرون كذباً.", "irab": "مصيبة: فاعل، أيديهم: فاعل، إحساناً: مفعول به." },
    { "id": 63, "text": "أُولَٰئِكَ الَّذِينَ يَعْلَمُ اللَّهُ مَا فِي قُلُوبِهِمْ فَأَعْرِضْ عَنْهُمْ وَعِظْهُمْ وَقُل لَّهُمْ فِي أَنفُسِهِمْ قَوْلًا بَلِيغًا", "tafsir": "الله مطلع على نفاقهم، والأمر بالإعراض عن توبيخهم علناً مع وعظهم سراً بكلام مؤثر.", "irab": "الذين: خبر، الله: فاعل، أعرض: فعل أمر، قولاً: مفعول مطلق." },
    { "id": 64, "text": "وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا لِيُطَاعَ بِإِذْنِ اللَّهِ ۚ وَلَوْ أَنَّهُمْ إِذ ظَّلَمُوا أَنفُسَهُمْ جَاءُوكَ فَاسْتَغْفَرُوا اللَّهَ", "tafsir": "الغاية من الرسل هي الطاعة، والحث على المجيء للنبي ﷺ لطلب الاستغفار والرحمة.", "irab": "ليطاع: مضارع مبني للمجهول منصوب، الله: مفعول به، رحيماً: خبر وجدوا." },
    { "id": 65, "text": "فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّىٰ يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنفُسِهِمْ حَرَجًا مِّمَّا قَضَيْتَ", "tafsir": "قسم إلهي بأن الإيمان لا يكتمل إلا بتحكيم النبي ﷺ والرضا التام بحكمه دون ضيق.", "irab": "ربك: اسم مجرور، يحكموك: مضارع منصوب، حرجاً: مفعول به، تسليماً: مفعول مطلق." },
    { "id": 66, "text": "وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ اقْتُلُوا أَنفُسَكُمْ أَوِ اخْرُجُوا مِن دِيَارِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٌ مِّنْهُمْ", "tafsir": "بيان ضعف عزيمة المنافقين؛ فلو كُلفوا بشدائد لما نفذوها، والخير في امتثال أوامر الله.", "irab": "كتبنا: فعل وفاعل، فعلوه: فعل وفاعل ومفعول، قليل: بدل مرفوع." },
    { "id": 67, "text": "وَإِذًا لَّآتَيْنَاهُم مِّن لَّدُنَّا أَجْرًا عَظِيمًا", "tafsir": "لو أنهم امتثلوا لأوامر الله لأثابهم الله ثواباً كبيراً في الدنيا والآخرة.", "irab": "آتيناهم: فعل وفاعل ومفعول، أجراً: مفعول ثانٍ، عظيماً: نعت." },
    { "id": 68, "text": "وَلَهَدَيْنَاهُمْ صِرَاطًا مُّسْتَقِيمًا", "tafsir": "ولو أطاعوا الله لثبتهم على طريق الحق والهداية الواضح.", "irab": "هديناهم: فعل وفاعل ومفعول، صراطاً: مفعول ثانٍ، مستقيماً: نعت." },
    { "id": 69, "text": "وَمَن يُطِيعِ اللَّهَ وَالرَّسُولَ فَأُولَٰئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِم مِّنَ النَّبِيِّينَ وَالصِّدِّيقِينَ", "tafsir": "بشارة طائعي الله ورسوله بأنهم سيحشرون مع خير البشر من الأنبياء والصالحين.", "irab": "من: اسم شرط، يطع: فعل الشرط، أولئك: مبتدأ، رفيقاً: تمييز." },
    { "id": 70, "text": "ذَٰلِكَ الْفَضْلُ مِنَ اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ عَلِيمًا", "tafsir": "تلك المنزلة العظيمة هي محض فضل من الله، وهو العليم بمن يستحقها.", "irab": "ذلك: مبتدأ، الفضل: بدل، الله: اسم مجرور لفظاً فاعل كفى، عليماً: تمييز." },
    { "id": 71, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا خُذُوا حِذْرَكُمْ فَانفِرُوا ثُبَاتٍ أَوِ انفِرُوا جَمِيعًا", "tafsir": "الأمر بالاستعداد للأعداء والحذر منهم، والخروج للقتال جماعات أو جيشاً واحداً.", "irab": "خذوا: فعل أمر، حذركم: مفعول به، ثبات: حال منصوب بالكسرة." },
    { "id": 72, "text": "وَإِنَّ مِنكُمْ لَمَن لَّيُبَطِّئَنَّ فَإِنْ أَصَابَتْكُم مُّصِيبَةٌ قَالَ قَدْ أَنْعَمَ اللَّهُ عَلَيَّ إِذْ لَمْ أَكُن مَّعَهُمْ شَهِيدًا", "tafsir": "حال المنافق المتقاعس؛ يفرح لعدم خروجه إذا هُزم المؤمنون، ويعتبر ذلك نعمة.", "irab": "مَن: اسم إن مؤخر، مصيبة: فاعل، الله: فاعل، شهيداً: خبر أكن." },
    { "id": 73, "text": "وَلَئِنْ أَصَابَكُمْ فَضْلٌ مِّنَ اللَّهِ لَيَقُولَنَّ كَأَن لَّمْ تَكُن بَيْنَكُمْ وَبَيْنَهُ مَوَدَّةٌ يَا لَيْتَنِي كُنتُ مَعَهُمْ", "tafsir": "وإذا نصركم الله، ندم المنافق وتمنى لو كان معكم لينال من الغنائم والمكاسب.", "irab": "فضل: فاعل، مودة: اسم تكن مؤخر، ليتني: ليت واسمها، فوزاً: مفعول مطلق." },
    { "id": 74, "text": "۞ فَلْيُقَاتِلْ فِي سَبِيلِ اللَّهِ الَّذِينَ يَشْرُونَ الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ", "tafsir": "حث المؤمنين البائعين للدنيا بالآخرة على الجهاد، ووعدهم بالأجر العظيم سواء قُتلوا أو غلبوا.", "irab": "يقاتل: مضارع مجزوم بلام الأمر، الذين: فاعل، الحياة: مفعول به، عظيماً: نعت." },
    { "id": 75, "text": "وَمَا لَكُمْ لَا تُقَاتِلُونَ فِي سَبِيلِ اللَّهِ وَالْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ", "tafsir": "تحريض على القتال لإنقاذ الضعفاء المظلومين الذين يدعون الله للخلاص من الظلم.", "irab": "ما: اسم استفهام مبتدأ، المستضعفين: معطوف على سبيل، نصيراً: مفعول ثانٍ." },
    { "id": 76, "text": "الَّذِينَ آمَنُوا يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ وَالَّذِينَ كَفَرُوا يُقَاتِلُونَ فِي سَبِيلِ الطَّاغُوتِ", "tafsir": "الفرق بين قتال المؤمن لإعلاء كلمة الله وقتال الكافر لنصرة الشيطان، فالشيطان كيده ضعيف.", "irab": "الذين: مبتدأ، الله: مضاف إليه، الطاغوت: مضاف إليه، ضعيفاً: خبر كان." },
    { "id": 77, "text": "أَلَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّوا أَيْدِيَكُمْ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ", "tafsir": "التعجب ممن طلب القتال فلما فُرض عليهم خافوا من الناس، والآخرة خير للمتقين.", "irab": "أيديكم: مفعول به، الصلاة: مفعول به، خشية: مفعول مطلق، فتيلاً: مفعول مطلق." },
    { "id": 78, "text": "أَيْنَمَا تَكُونُوا يُدْرِككُّمُ الْمَوْتُ وَلَوْ كُنتُمْ فِي بُرُوجٍ مُّشَيَّدَةٍ", "tafsir": "الموت حتمي في كل مكان، والرد على المنافقين الذين ينسبون الحسنة لله والسيئة للنبي ﷺ.", "irab": "أينما: اسم شرط، يدرككم: جواب الشرط، الموت: فاعل، مشيدة: نعت." },
    { "id": 79, "text": "مَّا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ ۖ وَمَا أَصَابَكَ مِن سَيِّئَةٍ فَمِن نَّفْسِكَ", "tafsir": "كل نعمة هي من فضل الله، وكل بلاء هو بسبب ذنوب العبد، والرسول ﷺ حجة على الناس.", "irab": "حسنة: اسم مجرور، الله: اسم مجرور، نفسك: اسم مجرور، شهيداً: حال." },
    { "id": 80, "text": "مَّن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ ۖ وَمَن تَوَلَّىٰ فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا", "tafsir": "طاعة الرسول هي طاعة لله، ومن أعرض فليس للنبي ﷺ سلطان عليه، فالله هو المحاسب.", "irab": "من: اسم شرط، يطع: فعل الشرط، الله: مفعول به، حفيظاً: حال." }
    { "id": 81, "text": "وَيَقُولُونَ طَاعَةٌ فَإِذَا بَرَزُوا مِنْ عِندِكَ بَيَّتَ طَائِفَةٌ مِّنْهُمْ غَيْرَ الَّذِي تَقُولُ ۖ وَاللَّهُ يَكْتُبُ مَا يُبَيِّتُونَ", "tafsir": "المنافقون يظهرون الطاعة أمامك، فإذا انصرفوا دبروا سراً خلاف ما أظهروا، والله يسجل مكرهم.", "irab": "طاعة: مبتدأ لخبر محذوف، طائفة: فاعل، الله: مبتدأ، يبيتوت: مضارع مرفوع." },
    { "id": 82, "text": "أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ ۚ وَلَوْ كَانَ مِنْ عِندِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا", "tafsir": "دعوة لتأمل القرآن؛ فعدم وجود تناقض فيه دليل قاطع على أنه من عند الله وحده.", "irab": "القرآن: مفعول به، الله: مضاف إليه، اختلافاً: مفعول به، كثيراً: نعت." },
    { "id": 83, "text": "وَإِذَا جَاءَهُمْ أَمْرٌ مِّنَ الْأَمْنِ أَوِ الْخَوْفِ أَذَاعُوا بِهِ ۖ وَلَوْ رَدُّوهُ إِلَى الرَّسُولِ", "tafsir": "النهي عن نشر الإشاعات، ووجوب رد الأمور الهامة لأولي العلم والرسول لبيان حقيقتها.", "irab": "أمر: فاعل، الرسول: اسم مجرور، العلم: مضاف إليه، الشيطان: مفعول به." },
    { "id": 84, "text": "فَقَاتِلْ فِي سَبِيلِ اللَّهِ لَا تُكَلَّفُ إِلَّا نَفْسَكَ ۚ وَحَرِّضِ الْمُؤْمِنِينَ ۖ عَسَى اللَّهُ أَن يَكُفَّ بَأْسَ الَّذِينَ كَفَرُوا", "tafsir": "أمر للنبي ﷺ بالقتال ولو وحده مع حث المؤمنين، ووعد بكف بأس الكفار بقوة الله.", "irab": "قاتل: فعل أمر، نفسك: مفعول به، المؤمنين: مفعول به، بأساً: مفعول به." },
    { "id": 85, "text": "مَّن يَشْفَعْ شَفَاعَةً حَسَنَةً يَكُن لَّهُ نَصِيبٌ مِّنْهَا ۖ وَمَن يَشْفَعْ شَفَاعَةً سَيِّئَةً يَكُن لَّهُ كِفْلٌ مِّنْهَا", "tafsir": "من سعى في خير فله أجر، ومن سعى في شر فعليه وزر، والله رقيب على كل شيء.", "irab": "من: اسم شرط، شفاعة: مفعول مطلق، نصيب: اسم يكن مؤخر، مقيتاً: خبر كان." },
    { "id": 86, "text": "وَإِذَا حُيِّيتُم بِتَحِيَّةٍ فَحَيُّوا بِأَحْسَنَ مِنْهَا أَوْ رُدُّوهَا ۗ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ حَسِيبًا", "tafsir": "أدب التحية في الإسلام؛ بردها بمثلها أو أحسن منها، والله يحاسب على كل عمل.", "irab": "حييتم: مبني للمجهول، أحسن: اسم مجرور بالفتحة، الله: اسم إن، حسيباً: خبر كان." },
    { "id": 87, "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۚ لَيَجْمَعَنَّكُمْ إِلَىٰ يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ", "tafsir": "تأكيد وحدانية الله وحتمية البعث يوم القيامة للحساب، وقول الله هو أصدق الأقوال.", "irab": "الله: مبتدأ، يوم: اسم مجرور، ريب: اسم لا، حديثاً: تمييز." },
    { "id": 88, "text": "فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُم بِمَا كَسَبُوا", "tafsir": "إنكار اختلاف المؤمنين في شأن المنافقين؛ فالله طردهم بسبب كفرهم، ولا هادي لمن أضله الله.", "irab": "ما: اسم استفهام، فئتين: حال، الله: مبتدأ، سبيلاً: مفعول به ثانٍ." },
    { "id": 90, "text": "إِلَّا الَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُم مِّيثَاقٌ أَوْ جَاءُوكُمْ حَصِرَتْ صُدُورُهُمْ", "tafsir": "استثناء من القتال: من لجأ لقوم معاهدين، أو من كف يده عن قتالكم لضيق صدره، فالمسالم لا يُقاتل.", "irab": "الذين: اسم استثناء، ميثاق: مبتدأ مؤخر، صدورهم: فاعل، سبيلاً: مفعول به." },
    { "id": 91, "text": "سَتَجِدُونَ آخَرِينَ يُرِيدُونَ أَن يَأْمَنُوكُمْ وَيأْمَنُوا قَوْمَهُمْ كُلَّ مَا رُدُّوا إِلَى الْفِتْنَةِ أُرْكِسُوا فِيهَا", "tafsir": "فئة منافقة تظهر السلم لتأمن الفريقين، فإذا فُتنوا عادوا للكفر؛ فهؤلاء يُقاتلون لغدرهم.", "irab": "آخرين: مفعول به، الفتنة: اسم مجرور، سلطاناً: مفعول به، مبيناً: نعت." },
    { "id": 92, "text": "وَمَا كَانَ لِمُؤْمِنٍ أَن يَقْتُلَ مُؤْمِنًا إِلَّا خَطأً ۚ وَمَن قَتَلَ مُؤْمِنًا خَطأً فَتَحْرِيرُ رَقَبَةٍ مُّؤْمِنَةٍ", "tafsir": "أحكام القتل الخطأ: وجوب عتق رقبة ودفع الدية لأهل القتيل إلا أن يتصدقوا بها.", "irab": "مؤمن: اسم مجرور، خطأ: حال، رقبة: مضاف إليه، رحيماً: خبر كان." },
    { "id": 93, "text": "وَمَن يَقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا وَغَضِبَ اللَّهُ عَلَيْهِ", "tafsir": "وعيد شديد للقاتل عمداً: الخلود في جهنم، وغضب الله ولعنته، والعذاب العظيم.", "irab": "من: اسم شرط، متعمداً: حال، جهنم: مبتدأ ثان، الله: فاعل، عظيماً: نعت." },
    { "id": 94, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا ضَرَبْتُمْ فِي سَبِيلِ اللَّهِ فَتَبَيَّنُوا وَلَا تَقُولُوا لِمَنْ أَلْقَىٰ إِلَيْكُمُ السَّلَامَ لَسْتَ مُؤْمِنًا", "tafsir": "الأمر بالتثبت في القتال، والنهي عن اتهام من أظهر الإسلام طمعاً في ماله.", "irab": "ضربتم: فعل وفاعل، السلام: مفعول به، عرض: مفعول لأجله، خبيراً: خبر كان." },
    { "id": 95, "text": "لَّا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ غَيْرُ أُولِي الضَّرَرِ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ", "tafsir": "تفضيل المجاهدين بالمال والنفس على القاعدين بغير عذر، ووعد الجميع بالجنة مع تفاوت الدرجات.", "irab": "القاعدون: فاعل، المجاهدون: معطوف مرفوع، الله: فاعل، عظيماً: نعت." },
    { "id": 96, "text": "دَرَجَاتٍ مِّنْهُ وَمَغْفِرَةً وَرَحْمَةً ۚ وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا", "tafsir": "المنازل العالية في الجنة والمغفرة هي جزاء المجاهدين، والله واسع المغفرة.", "irab": "درجات: بدل من أجراً، الله: اسم كان، غفوراً: خبر كان، رحيماً: خبر ثانٍ." },
    { "id": 97, "text": "إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلَائِكَةُ ظَالِمِي أَنفُسِهِمْ قَالُوا فِيمَ كُنتُمْ ۖ قَالُوا كُنَّا مُسْتَضْعَفِينَ فِي الْأَرْضِ", "tafsir": "وعيد لمن ترك الهجرة مع القدرة ورضي بالذل، وحجتهم بالضعف مرفوضة لأن أرض الله واسعة.", "irab": "الملائكة: فاعل، ظالمي: حال، الأرض: اسم مجرور، جهنم: اسم كان، مصيراً: تمييز." },
    { "id": 98, "text": "إِلَّا الْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ لَا يَسْتَطِيعُونَ حِيلَةً وَلَا يَهْتَدُونَ سَبِيلًا", "tafsir": "عفو الله عن العاجزين حقيقة عن الهجرة من الرجال والنساء والولدان.", "irab": "المستضعفين: اسم استثناء، حيلة: مفعول به، سبيلاً: مفعول به." },
    { "id": 99, "text": "فَأُولَٰئِكَ عَسَى اللَّهُ أَن يَعْفُوَ عَنْهُمْ ۚ وَكَانَ اللَّهُ عَفُوًّا غَفُورًا", "tafsir": "هؤلاء الضعفاء يرجى لهم عفو الله ورحمته، والله كثير العفو والمغفرة.", "irab": "أولئك: مبتدأ، الله: اسم عسى، عفواً: خبر كان، غفوراً: خبر ثانٍ." },
    { "id": 100, "text": "۞ وَمَن يُهَاجِرْ فِي سَبِيلِ اللَّهِ يَجِدْ فِي الْأَرْضِ مُرَاغَمًا كَثِيرًا وَسَعَةً", "tafsir": "من هاجر لله وجد الرزق والمنعة، ومن مات في طريق هجرته فقد ثبت أجره العظيم على الله.", "irab": "من: اسم شرط، يهاجر: فعل الشرط، الأرض: اسم مجرور، الله: اسم كان." }
    { "id": 101, "text": "وَإِذَا ضَرَبْتُمْ فِي الْأَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَقْصُرُوا مِنَ الصَّلَاةِ", "tafsir": "رخصة القصر في الصلاة للمسافر عند الخوف من العدو، وبيان عداوة الكفار الظاهرة للمؤمنين.", "irab": "ضربتم: فعل وفاعل، جناح: اسم ليس مؤخر، الصلاة: اسم مجرور، مبيناً: خبر كان." },
    { "id": 102, "text": "وَإِذَا كُنتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ فَلْتَقُمْ طَائِفَةٌ مِّنْهُم مَّعَكَ", "tafsir": "تفصيل كيفية صلاة الخوف في ميدان القتال؛ لضمان استمرار الحذر والحماية أثناء الصلاة.", "irab": "كنت: فعل ناقص واسمه، طائفة: فاعل، أسلحتكم: مفعول به، حذركم: مفعول به." },
    { "id": 103, "text": "فَإِذَا قَضَيْتُمُ الصَّلَاةَ فَاذْكُرُوا اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِكُمْ", "tafsir": "الأمر بذكر الله بعد الصلاة في كل حال، ووجوب أداء الصلاة في أوقاتها المحددة عند الاطمئنان.", "irab": "قضيتم: فعل وفاعل، الله: مفعول به، قياماً: حال، كتاباً: خبر إن." },
    { "id": 104, "text": "وَلَا تَهِنُوا فِي ابْتِغَاءِ الْقَوْمِ ۖ إِن تَكُونُوا تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ", "tafsir": "حث على القوة في ملاحقة الأعداء؛ فالمعاناة مشتركة لكن المؤمن يرجو من الله ما لا يرجوه الكافر.", "irab": "لا: ناهية، القوم: مضاف إليه، تألمون: خبر تكون، ترجون: مضارع مرفوع." },
    { "id": 105, "text": "إِنَّا أَنزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَا أَرَاكَ اللَّهُ", "tafsir": "الهدف من إنزال القرآن هو الحكم بالعدل، والنهي عن الدفاع عن الخائنين.", "irab": "أنزلنا: فعل وفاعل، الكتاب: مفعول به، الناس: مضاف إليه، خصيماً: حال." },
    { "id": 106, "text": "وَاسْتَغْفِرِ اللَّهَ ۖ إِنَّ اللَّهَ كَانَ غَفُورًا رَّحِيمًا", "tafsir": "الأمر بالاستغفار دائماً، والتأكيد على مغفرة الله ورحمته الواسعة.", "irab": "استغفر: فعل أمر، الله: مفعول به، غفوراً: خبر كان، رحيماً: خبر ثانٍ." },
    { "id": 107, "text": "وَلَا تُجَادِلْ عَنِ الَّذِينَ يَخْتَانُونَ أَنفُسَهُمْ ۚ إِنَّ اللَّهَ لَا يُحِبُّ مَن كَانَ خَوَّانًا أَثِيمًا", "tafsir": "النهي عن المدافعة عن أصحاب الخيانة والذنوب، فالله يبغض الخائنين المصرين على الإثم.", "irab": "تجادل: مضارع مجزوم، الذين: اسم مجرور، الله: اسم إن، أثيماً: نعت." },
    { "id": 108, "text": "يَسْتَخْفُونَ مِنَ النَّاسِ وَلَا يَسْتَخْفُونَ مِنَ اللَّهِ وَهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ مَا لَا يَرْضَىٰ مِنَ الْقَوْلِ", "tafsir": "ذم المنافقين الذين يخشون الناس ويخفون قبائحهم عنهم، بينما الله مطلع عليهم في كل وقت.", "irab": "الناس: اسم مجرور، القول: اسم مجرور، محيطاً: خبر كان." },
    { "id": 109, "text": "هَا أَنتُمْ هَٰؤُلَاءِ جَادَلْتُمْ عَنْهُمْ فِي الْحَيَاةِ الدُّنْيَا فَمَن يُجَادِلُ اللَّهَ عَنْهُمْ يَوْمَ الْقِيَامَةِ", "tafsir": "توبيخ لمن دافع عن الخائنين في الدنيا؛ فمن يدافع عنهم أمام عدل الله يوم الحساب؟", "irab": "أنتم: مبتدأ، الحياة: اسم مجرور، الله: مفعول به، وكيلاً: تمييز." },
    { "id": 110, "text": "وَمَن يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّهَ يَجِدِ اللَّهَ غَفُورًا رَّحِيمًا", "tafsir": "باب التوبة مفتوح؛ فمن أخطأ ثم استغفر بصدق وجد الله تواباً رحيماً به.", "irab": "من: اسم شرط، سوءاً: مفعول به، الله: مفعول به أول، غفوراً: مفعول به ثانٍ." },
    { "id": 111, "text": "وَمَن يَكْسِبْ إِثْمًا فَإِنَّمَا يَكْسِبُهُ عَلَىٰ نَفْسِهِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا", "tafsir": "كل إنسان مسؤول عن ذنبه وحده، وضرر الإثم يعود على صاحبه، والله عليم بمقاصد الخلق.", "irab": "إثماً: مفعول به، نفسه: اسم مجرور، الله: اسم كان، حكيماً: خبر ثانٍ." },
    { "id": 112, "text": "وَمَن يَكْسِبْ خَطِيئَةً أَوْ إِثْمًا ثُمَّ يَرْمِ بِهِ بَرِيئًا فَقَدِ احْتَمَلَ بُهْتَانًا وَإِثْمًا مُّبِينًا", "tafsir": "تحريم قذف الأبرياء بالذنب؛ وهو من أعظم البهتان والإثم الظاهر.", "irab": "خطيئة: مفعول به، بريئاً: مفعول به، بهتاناً: مفعول به، مبيناً: نعت." },
    { "id": 113, "text": "وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكَ وَرَحْمَتُهُ لَهَمَّت طَّائِفَةٌ مِّنْهُمْ أَن يُضِلُّوكَ", "tafsir": "حماية الله للنبي ﷺ من كيد المضلين، وأن كيدهم لا يضر إلا أنفسهم، وتذكير بنعمة الكتاب والحكمة.", "irab": "فضل: مبتدأ، الله: مضاف إليه، طائفة: فاعل، عظيماً: نعت." },
    { "id": 114, "text": "۞ لَّا خَيْرَ فِي كَثِيرٍ مِّن نَّجْوَاهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَاحٍ بَيْنَ النَّاسِ", "tafsir": "معظم كلام الناس لا فائدة فيه إلا ما كان أمراً بخير أو إصلاحاً، ومن فعل ذلك لله فله الأجر العظيم.", "irab": "خير: اسم لا، صدقة: اسم مجرور، الناس: مضاف إليه، عظيماً: نعت." },
    { "id": 115, "text": "وَمَن يُشَاقِقِ الرَّسُولَ مِن بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَىٰ وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ", "tafsir": "وعيد لمن خالف طريق النبي ﷺ وجماعة المؤمنين؛ بأن يتركه الله لضلاله ومصيره جهنم.", "irab": "الرسول: مفعول به، الهدى: فاعل، جهنم: مفعول به، مصيراً: تمييز." },
    { "id": 116, "text": "إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَاءُ", "tafsir": "تكرار التأكيد على أن الشرك هو الذنب الذي لا يُغفر لمن مات عليه، وهو ضلال بعيد.", "irab": "الله: اسم إن، يشاء: مضارع مرفوع، ضلالاً: مفعول مطلق، بعيداً: نعت." },
    { "id": 117, "text": "إِن يَدْعُونَ مِن دُونِهِ إِلَّا إِنَاثًا وَإِن يَدْعُونَ إِلَّا شَيْطَانًا مَّرِيدًا", "tafsir": "المشركون يعبدون أصناماً لا تنفع، وفي الحقيقة هم يتبعون الشيطان المتمرد.", "irab": "يدعون: مضارع مرفوع، إناثاً: مفعول به، شيطاناً: مفعول به، مريداً: نعت." },
    { "id": 118, "text": "لَّعَنَهُ اللَّهُ ۘ وَقَالَ لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًا مَّفْرُوضًا", "tafsir": "طرد الله الشيطان، فتوعد الشيطان بإغواء جزء من عباد الله وجعلهم تابعين له.", "irab": "لعنه: فعل ومفعول، الله: فاعل، نصيباً: مفعول به، مفروضاً: نعت." },
    { "id": 119, "text": "وَلأُضِلَّنَّهُمْ وَلأُمَنِّيَنَّهُمْ وَلآمُرَنَّهُمْ فَلَيُبَتِّكُنَّ آذَانَ الأَنْعَامِ", "tafsir": "وسائل الشيطان في الإغواء: التضليل، الأماني الكاذبة، وتغيير خلق الله كتقطيع آذان الأنعام.", "irab": "أضلنهم: مضارع مبني على الفتح، آذان: مفعول به، الأنعام: مضاف إليه، مبيناً: نعت." },
    { "id": 120, "text": "يَعِدُهُمْ وَيُمَنِّيهِمْ ۖ وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلَّا غُرُورًا", "tafsir": "وعود الشيطان كلها خداع وباطل لا حقيقة لها، تهدف لجر الإنسان للهلاك.", "irab": "يعدهم: مضارع ومفعول، الشيطان: فاعل، غروراً: مفعول مطلق أو حال." }
    { "id": 121, "text": "أُولَٰئِكَ مَأْوَاهُمْ جَهَنَّمُ وَلَا يَجِدُونَ عَنْهَا مَحِيصًا", "tafsir": "مصير أتباع الشيطان هو جهنم، ولن يجدوا عنها مفراً ولا ملجأً يهربون إليه.", "irab": "أولئك: مبتدأ، مأواهم: مبتدأ ثان، جهنم: خبر المبتدأ الثاني، محيصاً: مفعول به." },
    { "id": 122, "text": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ", "tafsir": "وعد الله الحق للمؤمنين بالجنة والخلود فيها، وهو أصدق القائلين وعداً.", "irab": "الذين: مبتدأ، جنات: مفعول ثانٍ، وعد: مفعول مطلق، قيلاً: تمييز." },
    { "id": 123, "text": "لَّيْسَ بِأَمَانِيِّكُمْ وَلَا أَمَانِيِّ أَهْلِ الْكِتابِ ۗ مَن يَعْمَلْ سُوءًا يُجْزَ بِهِ", "tafsir": "الجزاء بالعمل لا بالتمني؛ فمن أساء عوقب، ولن يجد له من دون الله ولياً ولا نصيراً.", "irab": "ليس: فعل ناقص، أمانيكم: اسم مجرور لفظاً خبر ليس، من: اسم شرط، نصيراً: مفعول به ثانٍ." },
    { "id": 124, "text": "وَمَن يَعْمَلْ مِنَ الصَّالِحَاتِ مِن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَأُولَٰئِكَ يَدْخُلُونَ الْجَنَّةَ", "tafsir": "المساواة في ثواب الجنة بين الذكر والأنثى بشرط الإيمان، ولا يظلمون شيئاً.", "irab": "من: اسم شرط، الصالحات: اسم مجرور، هو مؤمن: جملة حالية، نقيراً: مفعول مطلق." },
    { "id": 125, "text": "وَمَنْ أَحْسَنُ دِينًا مِّمَّنْ أَسْلَمَ وَجْهَهُ لِلَّهِ وَهُوَ مُحْسِنٌ وَاتَّبَعَ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا", "tafsir": "أفضل الناس ديناً هو المخلص لله المتبع للسنة، المقتدي بإبراهيم عليه السلام.", "irab": "من: اسم استفهام مبتدأ، ديناً: تمييز، حنيفاً: حال، خليلاً: مفعول به ثانٍ." },
    { "id": 126, "text": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ مُّحِيطًا", "tafsir": "كل ما في الكون ملك لله تعالى، وعلمه وقدرته أحاطت بكل تفاصيل الخلق.", "irab": "لله: خبر مقدم، ما: مبتدأ مؤخر، الله: اسم كان، محيطاً: خبر كان." },
    { "id": 127, "text": "وَيَسْتَفْتُونَكَ فِي النِّسَاءِ ۖ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَىٰ عَلَيْكُمْ فِي الْكِتَابِ", "tafsir": "أحكام اليتيمات والنساء الضعيفات، ووجوب إعطائهن حقوقهن في الميراث والمهر بالعدل.", "irab": "يستفتونك: فعل وفاعل ومفعول، الله: مبتدأ، اليتامى: مضاف إليه، القسط: اسم مجرور." },
    { "id": 128, "text": "وَإِنِ امْرَأَةٌ خَافَتْ مِن بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا فَلَا جُنَاحَ عَلَيْهِمَا أَن يُصْلِحَا بَيْنَهُمَا صُلْحًا", "tafsir": "أدب الإصلاح بين الزوجين عند الخلاف، والحث على الصلح والتسامح بدلاً من الفرقة.", "irab": "امرأة: فاعل لفعل محذوف، جناح: اسم لا، صلحاً: مفعول مطلق، خبيراً: خبر كان." },
    { "id": 129, "text": "وَلَن تَسْتَطِيعُوا أَن تَعْدِلُوا بَيْنَ النِّسَاءِ وَلَوْ حَرَصْتُمْ ۖ فَلَا تَمِيلُوا كُلَّ الْمَيْلِ", "tafsir": "الإنسان لا يملك المساواة المطلقة في المشاعر، لكن النهي عن الميل الظاهر الذي يضر الزوجة.", "irab": "تستطيعوا: مضارع منصوب، النساء: اسم مجرور، الميل: مضاف إليه، غفوراً: خبر كان." },
    { "id": 130, "text": "وَإِن يَتَفَرَّقَا يُغْنِ اللَّهُ كُلًّا مِّن سَعَتِهِ ۚ وَكَانَ اللَّهُ وَاسِعًا حَكِيمًا", "tafsir": "إذا استحال الصلح ووقع الطلاق، فالله يرزق كل طرف من فضله الواسع.", "irab": "يتفرقا: فعل الشرط مجزوم بالألف، الله: فاعل، كلاً: مفعول به، حكيماً: خبر ثانٍ." },
    { "id": 131, "text": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَلَقَدْ وَصَّيْنَا الَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلِكُمْ", "tafsir": "تكرار ملكية الله للكون، ووصيته لكل الأمم بتقوى الله، فالله غني عن عبادة خلقه.", "irab": "لله: خبر مقدم، الذين: مفعول به، الكتاب: مفعول به ثانٍ، حميداً: خبر كان." },
    { "id": 132, "text": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَفىٰ بِاللَّهِ وَكِيلًا", "tafsir": "تأكيد أن الله هو المالك والمتصرف، وحسب العباد أن يكون الله وكيلاً عليهم.", "irab": "لله: خبر مقدم، ما: مبتدأ مؤخر، الله: فاعل كفى، وكيلاً: تمييز." },
    { "id": 133, "text": "إِن يَشَأْ يُذْهِبْكُمْ أَيُّهَا النَّاسُ وَيَأْتِ بِآخَرِينَ ۚ وَكَانَ اللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرًا", "tafsir": "قدرة الله على استبدال الخلق بخلق آخرين، فهو غير محتاج لأحد من عباده.", "irab": "يشأ: فعل الشرط، يذهبكم: جواب الشرط، الناس: بدل، قديراً: خبر كان." },
    { "id": 134, "text": "مَّن كَانَ يُرِيدُ ثَوَابَ الدُّنْيَا فَعِندَ اللَّهِ ثَوَابُ الدُّنْيَا وَالْآخِرَةِ", "tafsir": "من طلب الدنيا فليعلم أن الله يملك خزائن الدارين، فلماذا لا يطلب ثواب الآخرة الباقي؟", "irab": "من: اسم شرط، ثواب: مفعول به، الله: مضاف إليه، بصيراً: خبر ثانٍ." },
    { "id": 135, "text": "۞ يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنفُسِكُمْ", "tafsir": "الأمر بالعدل المطلق في الشهادة، ولو كانت ضد النفس أو الأهل أو الأغنياء والفقراء.", "irab": "كونوا: فعل أمر ناقص، قوامين: خبر كونوا، القسط: اسم مجرور، خبيراً: خبر كان." },
    { "id": 136, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَىٰ رَسُولِهِ", "tafsir": "دعوة للمؤمنين للثبات والارتقاء في الإيمان بجميع أركانه، والتحذير من مغبة الكفر.", "irab": "آمنوا: فعل أمر، الكتاب: اسم مجرور، نزل: فعل، بعيداً: نعت." },
    { "id": 137, "text": "إِنَّ الَّذِينَ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ ازْدَادُوا كُفْرًا لَّمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ", "tafsir": "من تذبذب في دينه ثم أصر على الكفر وازداد فيه، فلن يغفر الله له ولن يهديه.", "irab": "الذين: اسم إن، كفراً: تمييز، يغفر: مضارع منصوب، سبيلاً: مفعول به ثانٍ." },
    { "id": 138, "text": "بَشِّرِ الْمُنَافِقِينَ بِأَنَّ لَهُمْ عَذَابًا أَلِيمًا", "tafsir": "إخبار المنافقين (بصيغة تهكمية) بأن مصيرهم هو العذاب الموجع.", "irab": "بشر: فعل أمر، المنافقين: مفعول به منصوب بالياء، عذاباً: اسم أن مؤخر." },
    { "id": 139, "text": "الَّذِينَ يَتَّخِذُونَ الْكَافِرِينَ أَوْلِيَاءَ مِن دُونِ الْمُؤْمِنِينَ ۚ أَيَبْتَغُونَ عِندَهُمُ الْعِزَّةَ", "tafsir": "ذم من يطلب العزة والقوة من الكفار، فالعزة لله وحده ولأوليائه المؤمنين.", "irab": "الذين: نعت للمنافقين، الكافرين: مفعول به أول، العزة: مفعول به، جميعاً: حال." },
    { "id": 140, "text": "وَقَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتَابِ أَنْ إِذَا سَمِعْتُمْ آيَاتِ اللَّهِ يُكْفَرُ بِهَا وَيُسْتَهْزَأُ بِهَا", "tafsir": "النهي عن الجلوس مع من يستهزئون بآيات الله، فالموافق لهم كواحد منهم في الإثم.", "irab": "نزل: فعل، آيات: مفعول به، يكفر: مضارع مبني للمجهول، جميعاً: مفعول به ثانٍ." }
    { "id": 141, "text": "الَّذِينَ يَتَرَبَّصُونَ بِكُمْ فَإِن كَانَ لَكُمْ فَتْحٌ مِّنَ اللَّهِ قَالُوا أَلَمْ نَكُن مَّعَكُمْ", "tafsir": "حال المنافقين المتذبذبين؛ ينتظرون الدوائر بالمؤمنين، فإن نصركم الله ادعوا أنهم معكم، وإن نال الكفار نصيباً ظاهروا عليهم.", "irab": "الذين: نعت، فتح: اسم كان، الله: فاعل، سبيلاً: مفعول به ثانٍ." },
    { "id": 142, "text": "إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَىٰ", "tafsir": "صفات المنافقين: محاولة خداع الله، التكاسل عن الصلاة، المراءاة للناس، وقلة ذكر الله.", "irab": "المنافقين: اسم إن، الله: مفعول به، كسالى: حال، قليلاً: مفعول مطلق." },
    { "id": 143, "text": "مُّذَبْذَبِينَ بَيْنَ ذَٰلِكَ لَا إِلَىٰ هَٰؤُلَاءِ وَلَا إِلَىٰ هَٰؤُلَاءِ ۚ وَمَن يُضْلِلِ اللَّهَ فَلَن تَجِدَ لَهُ سَبِيلًا", "tafsir": "حيرة المنافقين وترددهم بين الإيمان والكفر، ومن يتركه الله لضلاله فلا طريق له للهدى.", "irab": "مذبذبين: حال ثانية، الله: فاعل، تجد: مضارع منصوب، سبيلاً: مفعول به." },
    { "id": 144, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْكَافِرِينَ أَوْلِيَاءَ مِن دُونِ الْمُؤْمِنِينَ", "tafsir": "النهي الصريح عن موالاة الكفار وترك المؤمنين، لئلا يكون ذلك حجة لله في عذابكم.", "irab": "لا: ناهية، الكافرين: مفعول به أول، أولياء: مفعول ثانٍ، سلطاناً: مفعول به." },
    { "id": 145, "text": "إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَلَن تَجِدَ لَهُمْ نَصِيرًا", "tafsir": "وعيد شديد للمنافقين بأن مكانهم في قاع جهنم، ولن يجدوا من ينقذهم من عذاب الله.", "irab": "المنافقين: اسم إن، الدرك: اسم مجرور، النار: اسم مجرور، نصيراً: مفعول به." },
    { "id": 146, "text": "إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَاعْتَصَمُوا بِاللَّهِ وَأَخْلَصُوا دِينَهُمْ لِلَّهِ", "tafsir": "استثناء التائبين المصلحين المخلصين؛ فهؤلاء مع المؤمنين وسيجزيهم الله الأجر العظيم.", "irab": "الذين: اسم استثناء، الله: اسم مجرور، المؤمنين: اسم مجرور بالياء، عظيماً: نعت." },
    { "id": 147, "text": "مَّا يَفْعَلُ اللَّهُ بِعَذَابِكُمْ إِن شَكَرْتُمْ وَآمَنْتُمْ ۚ وَكَانَ اللَّهُ شَاكِرًا عَلِيمًا", "tafsir": "الله لا يحب تعذيب عباده، بل يريد شكرهم وإيمانهم، وهو المثيب العليم بأفعالهم.", "irab": "ما: اسم استفهام مبتدأ، الله: فاعل، شاكراً: خبر كان، عليماً: خبر ثانٍ." },
    { "id": 148, "text": "۞ لَّا يُحِبُّ اللَّهُ الْجَهْرَ بِالسُّوءِ مِنَ الْقَوْلِ إِلَّا مَن ظُلِمَ ۚ وَكَانَ اللَّهُ سَمِيعًا بَصِيرًا", "tafsir": "النهي عن ذكر مساوئ الناس علناً إلا للمظلوم الذي يشكو ظالمه، فالله سميع للأقوال.", "irab": "الجهر: مفعول به، القول: اسم مجرور، مَن: اسم موصول فاعل، بصيراً: خبر ثانٍ." },
    { "id": 149, "text": "إِن تُبْدُوا خَيْرًا أَوْ تُخْفُوهُ أَوْ تَعْفُوا عَن سُوءٍ فَإِنَّ اللَّهَ كَانَ عَفُوًّا قَدِيرًا", "tafsir": "حث على إظهار الخير أو إسراره والعفو عن المسيء، اقتداءً بصفات الله في العفو والقدرة.", "irab": "تبدوا: فعل الشرط، خيراً: مفعول به، الله: اسم إن، قديراً: خبر ثانٍ." },
    { "id": 150, "text": "إِنَّ الَّذِينَ يَكْفُرُونَ بِاللَّهِ وَرُسُلِهِ وَيُرِيدُونَ أَن يُفَرِّقُوا بَيْنَ اللَّهِ وَرُسُلِهِ", "tafsir": "ذم من يؤمن ببعض الرسل ويكفر ببعضهم؛ فهذا تفريق في أصول الإيمان لا يقبله الله.", "irab": "الذين: اسم إن، الله: اسم مجرور، يفرقوا: مضارع منصوب، بعض: اسم مجرور." },
    { "id": 151, "text": "أُولَٰئِكَ هُمُ الْكَافِرُونَ حَقًّا ۚ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُّهِينًا", "tafsir": "تأكيد أن من فرق بين الرسل هو كافر يقيناً، وله العذاب المذل يوم القيامة.", "irab": "أولئك: مبتدأ، هم: ضمير فصل، الكافرون: خبر، مهيناً: نعت." },
    { "id": 152, "text": "وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ وَلَمْ يُفَرِّقُوا بَيْنَ أَحَدٍ مِّنْهُمْ أُولَٰئِكَ سَوْفَ يُؤْتِيهِمْ أُجُورَهُمْ", "tafsir": "وعد الله بالأجر الكامل لمن آمن بكل الرسل دون تفرقة، فالله غفور لذنوب عباده.", "irab": "الذين: مبتدأ، أحد: اسم مجرور، أجورهم: مفعول به ثانٍ، رحيماً: خبر ثانٍ." },
    { "id": 153, "text": "يَسْأَلُكَ أَهْلُ الْكِتَابِ أَن تُنَزِّلَ عَلَيْهِمْ كِتَابًا مِّنَ السَّمَاءِ ۚ فَقَدْ سَأَلُوا مُوسَىٰ أَكْبَرَ مِن ذَٰلِكَ", "tafsir": "تعنت أهل الكتاب بطلب كتاب مرئي، ورد الله بأنهم طلبوا من موسى رؤية الله جهرة فعوقبوا.", "irab": "أهل: فاعل، كتاباً: مفعول به، موسى: مفعول به، مبيناً: نعت." },
    { "id": 154, "text": "وَرَفَعْنَا فَوْقَهُمُ الطُّورَ بِمِيثَاقِهِمْ وَقُلْنَا لَهُمُ ادْخُلُوا الْبَابَ سُجَّدًا", "tafsir": "تذكير بتهديدهم بالجبل ليأخذوا العهد، وعصيانهم لأمر دخول الباب سجداً واعتدائهم في السبت.", "irab": "رفعنا: فعل وفاعل، الطور: مفعول به، سجداً: حال، السبت: اسم مجرور." },
    { "id": 155, "text": "فَبِمَا نَقْضِهِم مِّيثَاقَهُمْ وَكُفْرِهِم بِآيَاتِ اللَّهِ وَقَتْلِهِمُ الْأَنبِيَاءَ بِغَيْرِ حَقٍّ", "tafsir": "لعن الله لليهود بسبب نقض العهود، الكفر بالآيات، قتل الأنبياء، وادعائهم أن قلوبهم مغلقة.", "irab": "نقضهم: اسم مجرور، ميثاقهم: مفعول به للمصدر، الأنبياء: مفعول به، قليلاً: مفعول مطلق." },
    { "id": 156, "text": "وَبِكُفْرِهِمْ وَقَوْلِهِمْ عَلَىٰ مَرْيَمَ بُهْتَانًا عَظِيمًا", "tafsir": "عقوبة الله لهم بسبب كفرهم وافترائهم الكذب القبيح على مريم عليها السلام.", "irab": "قولهم: معطوف، مريم: اسم مجرور بالفتحة، بهتاناً: مفعول به، عظيماً: نعت." },
    { "id": 157, "text": "وَقَوْلِهِمْ إِنَّا قَتَلْنَا الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ رَسُولَ اللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ", "tafsir": "تكذيب ادعائهم قتل عيسى؛ فالله رفعه ولم يُقتل ولم يُصلب، والمدعون في شك من أمرهم.", "irab": "قتلنا: فعل وفاعل، المسيح: مفعول به، ابنه: بدل، يقيناً: مفعول مطلق." },
    { "id": 158, "text": "بَل رَّفَعَهُ اللَّهُ إِلَيْهِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا", "tafsir": "تأكيد رفع الله لعيسى عليه السلام بجسده وروحه، والله ذو العزة والحكمة.", "irab": "رفعه: فعل ومفعول، الله: فاعل، عزيزاً: خبر كان، حكيماً: خبر ثانٍ." },
    { "id": 159, "text": "وَإِن مِّنْ أَهْلِ الْكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ ۖ وَيَوْمَ الْقِيَامَةِ يَكُونُ عَلَيْهِمْ شَهِيدًا", "tafsir": "إيمان كل أهل الكتاب بعيسى عند نزوله قبل موته الحقيقي، وشهادته عليهم يوم القيامة.", "irab": "أهل: اسم مجرور، يوم: ظرف زمان، يكون: فعل مضارع، شهيداً: خبر يكون." },
    { "id": 160, "text": "فَبِظُلْمٍ مِّنَ الَّذِينَ هَادُوا حَرَّمْنَا عَلَيْهِمْ طَيِّبَاتٍ أُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَن سَبِيلِ اللَّهِ كَثِيرًا", "tafsir": "حرم الله بعض الحلال على اليهود عقوبة لظلمهم وصدهم للناس عن طريق الحق.", "irab": "ظلم: اسم مجرور، الذين: مضاف إليه، طيبات: مفعول به، كثيراً: مفعول مطلق." }
    { "id": 161, "text": "وَأَخْذِهِمُ الرِّبَا وَقَدْ نُهُوا عَنْهُ وَأَكْلِهِمْ أَمْوَالَ النَّاسِ بِالْبَاطِلِ ۚ وَأَعْتَدْنَا لِلْكَافرِينَ مِنْهُمْ عَذَابًا أَلِيمًا", "tafsir": "عقوبة اليهود بسبب تعاملهم بالربا وأكلهم أموال الناس بغير حق، وإعداد العذاب الأليم للكافرين منهم.", "irab": "أخذهم: معطوف، الربا: مفعول به للمصدر، الناس: مضاف إليه، أليماً: نعت." },
    { "id": 162, "text": "لَّٰكِنِ الرَّاسِخُونَ فِي الْعِلْمِ مِنْهُمْ وَالْمُؤْمِنُونَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ", "tafsir": "ثناء على العلماء المتمكنين والمؤمنين المخلصين الذين يؤمنون بجميع كتب الله ورسله واليوم الآخر.", "irab": "الراسخون: مبتدأ، العلم: اسم مجرور، المقيمين: نعت (أو مفعول به لفعل محذوف)، عظيماً: نعت." },
    { "id": 163, "text": "۞ إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا إِلَىٰ نُوحٍ وَالنَّبِيِّينَ مِن بَعْدِهِ", "tafsir": "تأكيد أن وحي الله للنبي محمد ﷺ هو امتداد لوحيه للأنبياء السابقين كنوح وإبراهيم وعيسى وغيرهم.", "irab": "أوحينا: فعل وفاعل، نوح: اسم مجرور، زبوراً: مفعول به ثانٍ." },
    { "id": 164, "text": "وَرُسُلًا قَدْ قَصَصْنَاهُمْ عَلَيْكَ مِن قَبْلُ وَرُسُلًا لَّمْ نَقْصُصْهُمْ عَلَيْكَ ۚ وَكَلَّمَ اللَّهُ مُوسَىٰ تَكْلِيمًا", "tafsir": "هناك رسل أخبر الله النبي ﷺ بقصصهم وهناك من لم يذكرهم، مع تمييز موسى بتكليم الله له مباشرة.", "irab": "رسلاً: مفعول به لفعل محذوف، الله: فاعل، موسى: مفعول به، تكليماً: مفعول مطلق." },
    { "id": 165, "text": "رُّسُلًا مُّبَشِّرِينَ وَمُنذِرِينَ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى اللَّهِ حُجَّةٌ بَعْدَ الرُّسُلِ", "tafsir": "الغاية من إرسال الرسل هي التبشير والإنذار لقطع حجة الناس أمام الله يوم الحساب.", "irab": "رسلاً: بدل من رسلاً السابقة، مبشرين: حال، حجة: اسم يكون مؤخر، حكيماً: خبر ثانٍ." },
    { "id": 166, "text": "لَّٰكِنِ اللَّهُ يَشْهَدُ بِمَا أَنزَلَ إِلَيْكَ ۖ أَنزَلَهُ بِعِلْمِهِ ۖ وَالْمَلَائِكَةُ يَشْهَدُونَ", "tafsير": "شهادة الله والملائكة بصدق القرآن المُنزل بعلم الله، وكفى بشهادة الله حجة.", "irab": "الله: مبتدأ، يشهد: جملة الخبر، بعلمه: اسم مجرور، شهيداً: حال." },
    { "id": 167, "text": "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَن سَبِيلِ اللَّهِ قَدْ ضَلُّوا ضَلَالًا بَعِيدًا", "tafsir": "وعيد لمن كفر وصد الناس عن الإسلام؛ فقد تاهوا في طريق الضلال تيهاً شديداً.", "irab": "الذين: اسم إن، الله: مضاف إليه، ضلالاً: مفعول مطلق، بعيداً: نعت." },
    { "id": 168, "text": "إِنَّ الَّذِينَ كَفَرُوا وَظَلَمُوا لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيقًا", "tafsir": "من أصر على الكفر والظلم فلن ينال مغفرة الله ولن يرشده لطريق الجنة.", "irab": "الذين: اسم إن، الله: اسم يكن، يغفر: مضارع منصوب، طريقاً: مفعول به ثانٍ." },
    { "id": 169, "text": "إِلَّا طَرِيقَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا", "tafsir": "لا طريق لهؤلاء إلا نار جهنم خالدين فيها للأبد، وهذا الجزاء هين يسير على الله.", "irab": "طريق: بدل، جهنم: مضاف إليه، خالدين: حال، يسيراً: خبر كان." },
    { "id": 170, "text": "يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمُ الرَّسُولُ بِالْحَقِّ مِن رَّبِّكُمْ فَآمِنُوا خَيْرًا لَّكُمْ", "tafsir": "دعوة عامة لكل الناس للإيمان بالنبي محمد ﷺ ففي ذلك نفعهم، فالله هو مالك كل شيء.", "irab": "الرسول: فاعل، خيرًا: خبر لفعل محذوف، الله: اسم كان، حكيماً: خبر ثانٍ." },
    { "id": 171, "text": "يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ", "tafsir": "النهي عن الغلو في الدين وادعاء ألوهية عيسى، فهو رسول الله وكلمته، والتأكيد على وحدانية الله.", "irab": "أهل: منادى، الحق: مفعول به، الله: مبتدأ، وكيلًا: تمييز." },
    { "id": 172, "text": "لَّن يَسْتَنكِفَ الْمَسِيحُ أَن يَكُونَ عَبْدًا لِّلَّهِ وَلَا الْمَلَائِكَةُ الْمُقَرَّبُونَ", "tafsir": "المسيح والملائكة لا يترفعون عن عبادة الله، ومن استكبر عن عبادته فسيحشره الله للحساب.", "irab": "المسيح: فاعل، عبداً: خبر يكون، المقربون: نعت، جميعاً: حال." },
    { "id": 173, "text": "فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُوَفِّيهِمْ أُجُورَهُمْ وَيَزِيدُهُم مِّن فَضْلِهِ", "tafsir": "جزاء المؤمنين هو الثواب الكامل والزيادة من فضل الله، وعقوبة المستكبرين هي العذاب الأليم.", "irab": "الذين: مبتدأ، أجورهم: مفعول به ثانٍ، نصيراً: مفعول به ثانٍ." },
    { "id": 174, "text": "يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُم بُرْهَانٌ مِّن رَّبِّكُمْ وَأَنزَلْنَا إِلَيْكُمْ نُورًا مُّبِينًا", "tafsir": "القرآن هو الحجة القاطعة والنور الهادي للناس أجمعين.", "irab": "برهان: فاعل، ربكم: اسم مجرور، نوراً: مفعول به، مبيناً: نعت." },
    { "id": 175, "text": "فَأَمَّا الَّذِينَ آمَنُوا بِاللَّهِ وَاعْتَصَمُوا بِهِ فَسَيُدْخِلُهُمْ فِي رَحْمَةٍ مِّنْهُ وَفَضْلٍ", "tafsir": "من آمن واعتصم بدين الله فسيدخل الجنة (الرحمة والفضل) ويهديه الطريق المستقيم.", "irab": "الذين: مبتدأ، الله: اسم مجرور، رحمة: اسم مجرور، مستقيماً: نعت." },
    { "id": 176, "text": "يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلَالَةِ ۚ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ", "tafsir": "خاتمة السورة بأحكام الكلالة (من مات ولا ولد له ولا والد)، وتفصيل ميراث الإخوة والأخوات.", "irab": "الله: مبتدأ، امرؤ: فاعل لفعل محذوف، ولد: اسم ليس مؤخر، عليماً: خبر ثانٍ." }
] },
    { "id": 5, "name": "المائدة", "verses": [    { "id": 1, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ ۚ أُحِلَّتْ لَكُم بَهِيمَةُ الْأَنْعَامِ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ", "tafsir": "الأمر بالوفاء بالعهود والمواثيق، وبيان ما يحل وما يحرم من الأنعام، والتأكيد على أن الله يحكم بما يريد.", "irab": "يا أيها: منادى، أوفوا: فعل أمر، العقود: اسم مجرور، الأنعام: مضاف إليه." },
    { "id": 2, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحِلُّوا شَعَائِرَ اللَّهِ وَلَا الشَّهْرَ الْحَرَامَ وَلَا الْهَدْيَ", "tafsir": "الأمر باحترام شعائر الحج والأشهر الحرم، والنهي عن الاعتداء، والحث على التعاون على البر والتقوى.", "irab": "لا: ناهية، شعائر: مفعول به، الشهر: معطوف، العقاب: مضاف إليه." },
    { "id": 3, "text": "حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ", "tafsir": "تفصيل المحرمات من الأطعمة (الميتة، الدم، الخنزير...)، وإعلان كمال الدين وإتمام النعمة ورضا الله بالإسلام ديناً.", "irab": "حرمت: فعل مبني للمجهول، الميتة: نائب فاعل، الإسلام: مفعول به ثانٍ، غفور: خبر كان." },
    { "id": 4, "text": "يَسْأَلُونَكَ مَاذَا أُحِلَّ لَهُمْ ۖ قُلْ أُحِلَّ لَكُمُ الطَّيِّبَاتُ ۙ وَمَا عَلَّمْتُم مِّنَ الْجَوَارِحِ مُكَلِّبِينَ", "tafsir": "إباحة الطيبات من الطعام وصيد الحيوانات المدربة (كالكلاب والصقور) مع ذكر اسم الله عليها.", "irab": "ماذا: اسم استفهام مبتدأ، الطيبات: نائب فاعل، الجوارح: اسم مجرور، الحساب: مضاف إليه." },
    { "id": 5, "text": "الْيَوْمَ أُحِلَّ لَكُمُ الطَّيِّبَاتُ ۖ وَطَعَامُ الَّذِينَ أُوتُوا الْكِتَابَ حِلٌّ لَّكُمْ وَطَعَامُكُمْ حِلٌّ لَّهُمْ", "tafsir": "إباحة ذبائح أهل الكتاب والزواج من المحصنات منهم، مع التأكيد على وجوب المهور والعفة.", "irab": "اليوم: ظرف زمان، طعام: مبتدأ، حل: خبر، خاسرين: اسم مجرور بالياء." },
    { "id": 6, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ", "tafsir": "تفصيل أحكام الطهارة: الوضوء (غسل الوجوه، الأيدي، الرؤوس، الأرجل)، والغسل من الجنابة، والتيمم عند الضرورة.", "irab": "قمتم: فعل وفاعل، وجوهكم: مفعول به، المرافق: اسم مجرور، تشكرون: مضارع مرفوع." },
    { "id": 7, "text": "وَاذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ وَمِيثَاقَهُ الَّذِي وَاثَقَكُم بِهِ إِذْ قُلْتُمْ سَمِعْنَا وَأَطَعْنَا", "tafsir": "تذكير المؤمنين بعهد الله عليهم بالطاعة، والحث على التقوى لأن الله عليم بما تخفيه القلوب.", "irab": "اذكروا: فعل أمر، نعمة: مفعول به، ميثاقه: معطوف، الصدور: مضاف إليه." },
    { "id": 8, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ", "tafsir": "الأمر بالعدل التام والشهادة بالحق، والنهي عن أن يحملكم بغض قوم على ظلمهم.", "irab": "قوامين: خبر كونوا، القسط: اسم مجرور، تقوى: مضاف إليه، تعملون: مضارع مرفوع." },
    { "id": 9, "text": "وَعَدَ اللَّهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ ۙ لَهُم مَّغْفِرَةٌ وَأَجْرٌ عَظِيمٌ", "tafsir": "وعد إلهي للمؤمنين الصالحين بمغفرة الذنوب والحصول على الثواب الكبير.", "irab": "وعد: فعل، الله: فاعل، مغفرة: مبتدأ مؤخر، عظيم: نعت." },
    { "id": 10, "text": "وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ", "tafsir": "جزاء الكافرين والمكذبين بآيات الله هو الخلود في نار الجحيم.", "irab": "الذين: مبتدأ، كفروا: فعل وفاعل، أولئك: مبتدأ ثان، الجحيم: مضاف إليه." },
    { "id": 11, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ هَمَّ قَوْمٌ أَن يَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ", "tafsir": "تذكير بنصر الله وحمايته للمؤمنين من مكر الأعداء الذين أرادوا الفتك بهم، والحث على التوكل.", "irab": "نعمة: مفعول به، قوم: فاعل، أيديهم: مفعول به، فليتوكل: مضارع مجزوم." },
    { "id": 12, "text": "وَلَقَدْ أَخَذَ اللَّهُ مِيثَاقَ بَنِي إِسْرَائِيلَ وَبَعَثْنَا مِنْهُمُ اثْنَيْ عَشَرَ نَقِيبًا", "tafsير": "تذكير بعهد الله مع بني إسرائيل وإرسال النقباء، وشرط النصر بالصلاة والزكاة والإيمان بالرسل.", "irab": "أخذ: فعل، ميثاق: مفعول به، نقيباً: تمييز، سبيلاً: مفعول به ثانٍ." },
    { "id": 13, "text": "فَبِمَا نَقْضِهِم مِّيثَاقَهُمْ لَعَنَّاهُمْ وَجَعَلْنَا قُلُوبَهُمْ قَاسِيَةً ۖ يُحَرِّفُونَ الْكَلِمَ عَن مَّوَاضِعِهِ", "tafsir": "عقوبة نقض العهد: اللعنة وقسوة القلب وتحريف الكلام، وكشف غدرهم المستمر.", "irab": "نقضهم: اسم مجرور، ميثاقهم: مفعول به للمصدر، الكلم: مفعول به، محسنين: مفعول به." },
    { "id": 14, "text": "وَمِنَ الَّذِينَ قَالُوا إِنَّا نَصَارَىٰ أَخَذْنَا مِيثَاقَهُمْ فَنَسُوا حَظًّا مِّمَّا ذُكِّرُوا بِهِ", "tafsir": "ميثاق النصارى ونقضهم له، مما أدى لوقوع العداوة والبغضاء بينهم إلى يوم القيامة.", "irab": "نصارى: خبر إن، ميثاقهم: مفعول به، حظاً: مفعول به، يصنعون: مضارع مرفوع." },
    { "id": 15, "text": "يَا أَهْلَ الْكِتَابِ قَدْ جَاءَكُمْ رَسُولُنَا يُبَيِّنُ لَكُمْ كَثِيرًا مِّمَّا كُنتُمْ تُخْفُونَ مِنَ الْكِتَابِ", "tafsir": "دعوة لأهل الكتاب للإيمان بالنبي محمد ﷺ الذي جاء ليبين ما أخفوه من كتبهم، ومعه النور والحق.", "irab": "رسولنا: فاعل، كثيراً: مفعول به، الكتاب: اسم مجرور، مبين: نعت." }
    { "id": 16, "text": "يَهْدِي بِهِ اللَّهُ مَنِ اتَّبَعَ رِضْوَانَهُ سُبُلَ السَّلَامِ وَيُخْرِجُهُم مِّنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِهِ", "tafsir": "الله يرشد بالقرآن من طلب رضاه إلى طرق السلام والنجاة، ويخرجهم من ظلمات الكفر إلى نور الإيمان.", "irab": "الله: فاعل، مَن: مفعول به، سبل: مفعول به ثانٍ، مستقيم: نعت." },
    { "id": 17, "text": "لَّقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ ۚ قُلْ فَمَن يَمْلِكُ مِنَ اللَّهِ شَيْئًا", "tafsir": "إكفار من ادعى ألوهية المسيح، وتأكيد قدرة الله المطلقة على إهلاك المسيح وأمه ومن في الأرض جميعاً.", "irab": "الذين: فاعل، الله: اسم إن، المسيح: خبر إن، جميعاً: حال." },
    { "id": 18, "text": "وَقَالَتِ الْيَهُودُ وَالنَّصَارَىٰ نَحْنُ أَبْنَاءُ اللَّهِ وَأَحِبَّاؤُهُ ۚ قُلْ فَلِمَ يُعَذِّبُكُم بِذُنُوبِكُم", "tafsir": "رد على ادعاء اليهود والنصارى بأنهم أبناء الله؛ فلو كان ذلك صحيحاً لما عذبهم، بل هم بشر كغيرهم.", "irab": "اليهود: فاعل، نحن: مبتدأ، أبناء: خبر، ذنوبكم: اسم مجرور." },
    { "id": 19, "text": "يَا أَهْلَ الْكِتَابِ قَدْ جَاءكُمْ رَسُولُنَا يُبَيِّنُ لَكُمْ عَلَى فَتْرَةٍ مِّنَ الرُّسُلِ أَن تَقُولُوا مَا جَاءَنَا مِن بَشِيرٍ", "tafsir": "بعث النبي ﷺ بعد انقطاع طويل من الرسل لقطع حجة الناس، فقد جاء البشير النذير لكل البشر.", "irab": "أهل: منادى، رسولنا: فاعل، بشير: فاعل مجرور لفظاً، قدير: خبر." },
    { "id": 20, "text": "وَإِذْ قَالَ مُوسَى لِقَوْمِهِ يَا قَوْمِ اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ جَعَلَ فِيكُمْ أَنبِيَاءَ وَجَعَلَكُم مُّلُوكًا", "tafsir": "تذكير موسى لقومه بنعم الله عليهم من إرسال الأنبياء والتحرر من عبودية فرعون وإعطائهم ما لم يُعط غيرهم.", "irab": "موسى: فاعل، نعمة: مفعول به، أنبياء: مفعول به ثانٍ، أحداً: مفعول به." },
    { "id": 21, "text": "يَا قَوْمِ ادْخُلُوا الأَرْضَ المُقَدَّسَةَ الَّتِي كَتَبَ اللَّهُ لَكُمْ وَلاَ تَرْتَدُّوا عَلَى أَدْبَارِكُمْ فَتَنقَلِبُوا خَاسِرِينَ", "tafsir": "أمر موسى لبني إسرائيل بدخول بيت المقدس، والتحذير من التراجع والجبن الذي يؤدي للخسران.", "irab": "الأرض: مفعول به، التي: نعت، الله: فاعل، خاسرين: حال منصوب بالياء." },
    { "id": 22, "text": "قَالُوا يَا مُوسَى إِنَّ فِيهَا قَوْمًا جَبَّارِينَ وَإِنَّا لَن نَّدْخُلَهَا حَتَّى يَخْرُجُوا مِنْهَا", "tafsir": "اعتذار بني إسرائيل عن القتال خوفاً من قوة العمالقة، ورفضهم الدخول حتى يخرج الأعداء وحدهم.", "irab": "قوماً: اسم إن، جبارين: نعت منصوب بالياء، ندخلها: مضارع منصوب." },
    { "id": 23, "text": "قَالَ رَجُلانِ مِنَ الَّذِينَ يَخَافُونَ أَنْعَمَ اللَّهُ عَلَيْهِمَا ادْخُلُوا عَلَيْهِمُ الْبَابَ", "tafsir": "حث رجلين مؤمنين لقومهما على الشجاعة والتوكل على الله لدخول المدينة، مؤكدين أن النصر حليفهم.", "irab": "رجلان: فاعل مرفوع بالألف، الله: فاعل، الباب: مفعول به، مؤمنين: خبر كنتم." },
    { "id": 24, "text": "قَالُوا يَا مُوسَى إِنَّا لَن نَّدْخُلَهَا أَبَدًا مَّا دَامُوا فِيهَا فَاذْهَبْ أَنتَ وَرَبُّكَ فَقَاتِلا إِنَّا هَاهُنَا قَاعِدُونَ", "tafsir": "وقاحة بني إسرائيل مع نبيهم موسى ورفضهم القاطع للجهاد، وتركهم له ليقاتل هو وربه وحدهما.", "irab": "أبداً: ظرف زمان، أنت: توكيد، ربك: معطوف، قاعدون: خبر إن مرفوع بالواو." },
    { "id": 25, "text": "قَالَ رَبِّ إِنِّي لا أَمْلِكُ إِلاَّ نَفْسِي وَأَخِي فَافْرُقْ بَيْنَنَا وَبَيْنَ الْقَوْمِ الْفَاسِقِينَ", "tafsir": "دعاء موسى لربه وشكواه من قومه، وطلبه التمييز بينه وبين المتمردين الخارجين عن طاعة الله.", "irab": "إني: اسم إن، نفسي: مفعول به، الفاسقين: نعت مجرور بالياء." },
    { "id": 26, "text": "قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيْهِمْ أَرْبَعِينَ سَنَةً يَتِيهُونَ فِي الأَرْضِ فَلاَ تَأْسَ عَلَى الْقَوْمِ الْفَاسِقِينَ", "tafsir": "عقوبة التيه: حرمان بني إسرائيل من دخول الأرض المقدسة 40 سنة، وضياعهم في الصحراء عقاباً لهم.", "irab": "محرمة: خبر إن، أربعين: ظرف زمان، سنة: مضاف إليه، الأرض: اسم مجرور." },
    { "id": 27, "text": "وَاتْلُ عَلَيْهِمْ نَبَأَ ابْنَيْ آدَمَ بِالْحَقِّ إِذْ قَرَّبَا قُرْبَانًا فَتُقُبِّلَ مِن أَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ الآخَرِ", "tafsir": "قصة هابيل وقابيل: تقديم القربان لله، وقبول الله من المتقي ورفضه من الحاسد.", "irab": "نبأ: مفعول به، ابني: مضاف إليه مجرور بالياء، قرباناً: مفعول به، المتقين: اسم مجرور." },
    { "id": 28, "text": "لَئِن بَسَطتَ إِلَيَّ يَدَكَ لِتَقْتُلَنِي مَا أَنَاْ بِبَاسِطٍ يَدِيَ إِلَيْكَ لِأَقْتُلَكَ ۖ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ", "tafsir": "رد هابيل المسالم على تهديد أخيه؛ برفضه مقابلة الإساءة بالإساءة خوفاً من الله.", "irab": "يدك: مفعول به، باسط: خبر أنا مجرور لفظاً، الله: مفعول به، العالمين: مضاف إليه." },
    { "id": 29, "text": "إِنِّي أُرِيدُ أَن تَبُوءَ بِإِثْمِي وَإِثْمِكَ فَتَكُونَ مِنْ أَصْحَابِ النَّارِ ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ", "tafsir": "رغبة هابيل أن يتحمل المعتدي وزر القتل وحده ليكون مصيره النار، جزاءً لظلمه.", "irab": "أن تبوء: مصدر مؤول مفعول به، إثمي: اسم مجرور، النار: مضاف إليه، الظالمين: مضاف إليه." },
    { "id": 30, "text": "فَطَوَّعَتْ لَهُ نَفْسُهُ قَتْلَ أَخِيهِ فَقَتَلَهُ فَأَصْبَحَ مِنَ الْخَاسِرِينَ", "tafsir": "ضعف قابيل أمام وسوسة نفسه فقتل أخاه، فكانت النتيجة ندمه وخسرانه في الدنيا والآخرة.", "irab": "نفسه: فاعل، قتل: مفعول به، أخيه: مضاف إليه، الخاسرين: اسم مجرور بالياء." }
    { "id": 31, "text": "فَبَعَثَ اللَّهُ غُرَابًا يَبْحَثُ فِي الْأَرْضِ لِيُرِيَهُ كَيْفَ يُوَارِي سَوْءَةَ أَخِيهِ", "tafsir": "بعث الله غراباً يحفر في الأرض ليعلم قابيل كيف يدفن جثة أخيه، فندم على عجزه عن فعل ما فعله الغراب.", "irab": "الله: فاعل، غراباً: مفعول به، سوءة: مفعول به، النادمين: اسم مجرور بالياء." },
    { "id": 32, "text": "مِنْ أَجْلِ ذَٰلِكَ كَتَبْنَا عَلَىٰ بَنِي إِسْرَائِيلَ أَنَّهُ مَن قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ", "tafsir": "بيان عظمة جرم القتل؛ فقتل نفس واحدة كقتل الناس جميعاً، وإحياؤها كإحيائهم جميعاً.", "irab": "من أجل: جار ومجرور، مَن: اسم شرط، نفساً: مفعول به، جميعاً: حال." },
    { "id": 33, "text": "إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا", "tafsir": "حد الحرابة: عقوبة المفسدين في الأرض بالقتل أو الصلب أو تقطيع الأطراف أو النفي.", "irab": "جزاء: مبتدأ، الذين: مضاف إليه، الله: مفعول به، فساداً: مفعول لأجله أو حال." },
    { "id": 34, "text": "إِلَّا الَّذِينَ تَابُوا مِن قَبْلِ أَن تَقْدِرُوا عَلَيْهِمْ ۖ فَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "سقوط حد الحرابة عمن تاب من المحاربين قبل إلقاء القبض عليهم، فالله يقبل توبة الصادقين.", "irab": "الذين: اسم استثناء، تقدروا: مضارع منصوب، الله: اسم إن، غفور: خبرها." },
    { "id": 35, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَابْتَغُوا إِلَيْهِ الْوَسِيلَةَ وَجَاهِدُوا فِي سَبِيلِهِ", "tafsir": "الأمر بالتقوى والتقرب إلى الله بالأعمال الصالحة (الوسيلة) والجهاد لنيل الفلاح.", "irab": "اتقوا: فعل أمر، الله: مفعول به، الوسيلة: مفعول به، تفلحون: مضارع مرفوع." },
    { "id": 36, "text": "إِنَّ الَّذِينَ كَفَرُوا لَوْ أَنَّ لَهُم مَّا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لِيَفْتَدُوا بِهِ", "tafsir": "الكفار يوم القيامة لا ينفعهم فداء ولو ملكوا الأرض ومثلها معها، وعذابهم دائم أليم.", "irab": "الذين: اسم إن، ما: اسم أن، الأرض: اسم مجرور، عذاب: مبتدأ مؤخر." },
    { "id": 37, "text": "يُرِيدُونَ أَن يَخْرُجُوا مِنَ النَّارِ وَمَا هُم بِخَارِجِينَ مِنْهَا ۖ وَلَهُمْ عَذَابٌ مُّقِيمٌ", "tafsir": "تمني الكفار الخروج من النار عبث؛ فهم خالدون فيها أبداً، وعذابهم لا ينقطع.", "irab": "يخرجوا: مضارع منصوب، النار: اسم مجرور، خارجين: خبر ما مجرور لفظاً، مقيم: نعت." },
    { "id": 38, "text": "وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُوا أَيْدِيَهُمَا جَزَاءً بِمَا كَسَبَا نَكَالًا مِّنَ اللَّهِ", "tafsir": "حد السرقة: قطع يد السارق والسارقة جزاءً لفعلهما وردعاً لغيرهما، والله عزيز حكيم.", "irab": "السارق: مبتدأ، اقطعوا: فعل أمر، أيديهما: مفعول به، نكالاً: مفعول لأجله." },
    { "id": 39, "text": "فَمَن تَابَ مِن بَعْدِ ظُلْمِهِ وَأَصْلَحَ فَإِنَّ اللَّهَ يَتُوبُ عَلَيْهِ ۗ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "من تاب من السارقين وأصلح عمله قبل القدرة عليه قبل الله توبته، والله غفور لمن تاب.", "irab": "من: اسم شرط، تابه: فعل الشرط، الله: اسم إن، يتوب: جملة الخبر." },
    { "id": 40, "text": "أَلَمْ تَعْلَمْ أَنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ يُعَذِّبُ مَن يَشَاءُ وَيَغْفِرُ لِمَن يَشَاءُ", "tafsir": "تأكيد ملكية الله المطلقة وتصرفه في عباده بالمغفرة أو العذاب وفق مشيئته وقدرته.", "irab": "تعلم: مضارع مجزوم، الله: اسم أن، ملك: مبتدأ، الأرض: معطوف، قدير: خبر." },
    { "id": 41, "text": "يَا أَيُّهَا الرَّسُولُ لَا يَحْزُنكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ مِنَ الَّذِينَ قَالُوا آمَنَّا", "tafsir": "تسلية للنبي ﷺ من مكر المنافقين واليهود الذين يحرفون الكلم ويسمعون للكذب، والله مضلهم.", "irab": "الرسول: منادى، يحزنك: مضارع مجزوم، الذين: فاعل، خزي: مبتدأ مؤخر." },
    { "id": 42, "text": "سَمَّاعُونَ لِلْكَذِبِ أَكَّالُونَ لِلسُّحْتِ ۚ فَإِن جَاءُوكَ فَاحْكُم بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ", "tafsir": "صفات اليهود: سماعون للباطل وأكالون للمال الحرام، والتخيير للنبي ﷺ في الحكم بينهم بالعدل.", "irab": "سماعون: خبر لمبتدأ محذوف، للسحت: جار ومجرور، المقسطين: مفعول به منصوب بالياء." },
    { "id": 43, "text": "وَكَيْفَ يُحَكِّمُونَكَ وَعِندَهُمُ التَّوْرَاةُ فِيهَا حُكْمُ اللَّهِ ثُمَّ يَتَوَلَّوْنَ مِن بَعْدِ ذَٰلِكَ", "tafsir": "تعجيب من تحكيم اليهود للنبي ﷺ وهم يملكون التوراة التي فيها حكم الله ثم يعرضون عنها.", "irab": "كيف: اسم استفهام، التوراة: مبتدأ مؤخر، حكم: مبتدأ، الله: مضاف إليه." },
    { "id": 44, "text": "إِنَّا أَنزَلْنَا التَّوْرَاةَ فِيهَا هُدًى وَنُورٌ ۚ يَحْكُمُ بِهَا النَّبِيُّونَ الَّذِينَ أَسْلَمُوا", "tafsir": "بيان قيمة التوراة الأصلية وهدايتها، ووجوب الحكم بما أنزل الله، والوعيد لمن حكم بغيره.", "irab": "أنزلنا: فعل وفاعل، التوراة: مفعول به، هدى: مبتدأ مؤخر، الكافرون: خبر." },
    { "id": 45, "text": "وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنَ بِالْعَيْنِ وَالْأَنفَ بِالْأَنفِ", "tafsir": "أحكام القصاص في التوراة (النفس والعين والسن والجروح)، والترغيب في التصدق بالعفو.", "irab": "كتبنا: فعل وفاعل، النفس: اسم أن، العين: معطوف، الظالمون: خبر." }
    { "id": 46, "text": "وَقَفَّيْنَا عَلَىٰ آثَارِهِم بِعِيسَى ابْنِ مَرْيَمَ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرَاةِ", "tafsir": "إرسال عيسى عليه السلام متبعاً لرسل بني إسرائيل ومصدقاً للتوراة، ومعه الإنجيل هدى ونوراً.", "irab": "قفينا: فعل وفاعل، عيسى: اسم مجرور بالفتحة، مصدقاً: حال، هدى: مبتدأ مؤخر." },
    { "id": 47, "text": "وَلْيَحْكُمْ أَهْلُ الْإِنجِيلِ بِمَا أَنزَلَ اللَّهُ فِيهِ ۚ وَمَن لَّمْ يَحْكُم بِمَا أَنزَلَ اللَّهُ فَأُولَٰئِكَ هُمُ الْفَاسِقُونَ", "tafsir": "أمر الله لأتباع عيسى بالحكم بما في الإنجيل، والتحذير من ترك حكم الله ووصف فاعله بالفسوق.", "irab": "ليحكم: اللام للأمر وفعل مضارع مجزوم، أهل: فاعل، الفاسقون: خبر." },
    { "id": 48, "text": "وَأَنزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ الْكِتَابِ وَمُهَيْمِنًا عَلَيْهِ", "tafsir": "القرآن هو الكتاب المهيمن والشاهد على الكتب السابقة، والأمر بالحكم به وحده دون اتباع أهواء الناس.", "irab": "أنزلنا: فعل وفاعل، الكتاب: مفعول به، مهيمناً: معطوف على مصدقاً (حال)، جميعاً: حال." },
    { "id": 49, "text": "وَأَنِ احْكُم بَيْنَهُم بِمَا أَنزَلَ اللَّهُ وَلَا تَتَّبِعْ أَهْوَاءَهُمْ وَاحْذَرْهُمْ أَن يَفْتِنُوكَ عَن بَعْضِ مَا أَنزَلَ اللَّهُ إِلَيْكَ", "tafsir": "تأكيد للنبي ﷺ بضرورة الحكم بالقرآن والحذر من كيد الأعداء الذين يريدون صرفه عن بعض شرائع الله.", "irab": "احكم: فعل أمر، أهواءهم: مفعول به، الله: فاعل، يفتنوك: مضارع منصوب بحذف النون." },
    { "id": 50, "text": "أَفَحُكْمَ الْجَاهِلِيَّةِ يَبْغُونَ ۚ وَمَنْ أَحْسَنُ مِنَ اللَّهِ حُكْمًا لِّقَوْمٍ يُوقِنُونَ", "tafsir": "إنكار لطلب أحكام الجاهلية الباطلة، فلا أحد أعدل ولا أحسن حكماً من الله لمن أيقن بآياته.", "irab": "حكم: مفعول به مقدم، الجاهلية: مضاف إليه، مَن: اسم استفهام مبتدأ، حكماً: تمييز." },
    { "id": 51, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْيَهُودَ وَالنَّصَارَىٰ أَوْلِيَاءَ ۘ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ", "tafsir": "النهي عن موالاة اليهود والنصارى ونصرتهم على المؤمنين، فمن والاهم أصبح منهم، والله لا يهدي الظالمين.", "irab": "اليهود: مفعول به أول، أولياء: مفعول به ثانٍ، الله: اسم إن، الظالمين: مفعول به." },
    { "id": 52, "text": "فَتَرَى الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ يُسَارِعُونَ فِيهِمْ يَقُولُونَ نَخْشَىٰ أَن تُصِيبَنَا دَائِرَةٌ", "tafsir": "حال المنافقين الذين يوالون الكفار خوفاً من تقلبات الزمن، وسيندمون عند نصر الله للمؤمنين.", "irab": "ترى: فعل مضارع، الذين: مفعول به، مرض: مبتدأ مؤخر، نادمين: خبر أصبح." },
    { "id": 53, "text": "وَيَقُولُ الَّذِينَ آمَنُوا أَهَٰؤُلَاءِ الَّذِينَ أَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ ۙ إِنَّهُمْ لَمَعَكُمْ", "tafsir": "تعجب المؤمنين من كذب المنافقين وأيمانهم المغلظة التي لم تنفعهم، فخسرت أعمالهم.", "irab": "يقول: مضارع، الذين: فاعل، الله: اسم مجرور، خاسرين: حال." },
    { "id": 54, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا مَن يَرْتَدَّ مِنكُمْ عَن دِينِهِ فَسَوْفَ يَأْتِي اللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُ", "tafsir": "تحذير من الردة، ووعد بأن الله سيأتي بجيل مؤمن يحبهم ويحبونه، أعزة على الكفار أذلة على المؤمنين.", "irab": "من: اسم شرط، يرتد: فعل الشرط، الله: فاعل، واسع: خبر." },
    { "id": 55, "text": "إِنَّمَا وَلِيُّكُمُ اللَّهُ وَرَسُولُهُ وَالَّذِينَ آمَنُوا الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ رَاكِعُونَ", "tafsir": "حصر الولاية والنصرة الحقيقية في الله ورسوله والمؤمنين المتمسكين بالصلاة والزكاة.", "irab": "وليكم: مبتدأ، الله: خبر، الذين: معطوف، راكعون: خبر المبتدأ (هم)." },
    { "id": 56, "text": "وَمَن يَتَوَلَّ اللَّهَ وَرَسُولَهُ وَالَّذِينَ آمَنُوا فَإِنَّ حِزْبَ اللَّهِ هُمُ الْغَالِبُونَ", "tafsir": "من جعل ولاءه لله ورسوله والمؤمنين فهو من حزب الله الناجحين الغالبين في النهاية.", "irab": "مَن: اسم شرط، يتول: فعل الشرط مجزوم، حزب: اسم إن، الغالبون: خبر حزب." },
    { "id": 57, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الَّذِينَ اتَّخَذُوا دِينَكُمْ هُزُوًا وَلَعِبًا مِّنَ الَّذِينَ أُوتُوا الْكِتَابَ", "tafsir": "تأكيد النهي عن موالاة من يسخرون من الدين من أهل الكتاب والكفار، ووجوب تقوى الله.", "irab": "لا: ناهية، دينكم: مفعول به أول، هزواً: مفعول به ثانٍ، مؤمنين: خبر كنتم." },
    { "id": 58, "text": "وَإِذَا نَادَيْتُمْ إِلَى الصَّلَاةِ اتَّخَذُوهَا هُزُوًا وَلَعِبًا ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْقِلُونَ", "tafsir": "سخرية الكفار من الأذان والصلاة دليل على جهلهم وعدم عقلهم للحقائق الإيمانية.", "irab": "ناديتم: فعل وفاعل، الصلاة: اسم مجرور، قوم: خبر أن، يعقلون: فعل مضارع." },
    { "id": 59, "text": "قُلْ يَا أَهْلَ الْكِتَابِ هَلْ تَنقِمُونَ مِنَّا إِلَّا أَنْ آمَنَّا بِاللَّهِ وَمَا أُنزِلَ إِلَيْنَا", "tafsir": "مواجهة أهل الكتاب: هل تعيبون علينا سوى إيماننا بالله وبما أنزل إلينا، وأن أغلبكم فاسقون؟", "irab": "هل: استفهام، تنقمون: مضارع مرفوع، الله: اسم مجرور، فاسقون: خبر أن." },
    { "id": 60, "text": "قُلْ هَلْ أُنَبِّئُكُم بِشَرٍّ مِّن ذَٰلِكَ مَثُوبَةً عِندَ اللَّهِ ۚ مَن لَّعَنَهُ اللَّهُ وَغَضِبَ عَلَيْهِ", "tafsir": "بيان من هم الأشرار حقاً: من لعنهم الله وغضب عليهم ومسخهم قردة وخنازير وعبدوا الطاغوت.", "irab": "هل: استفهام، مثوبة: تمييز، الله: فاعل، الطاغوت: مفعول به، سبيلاً: تمييز." }
    { "id": 61, "text": "وَإِذَا جَاءُوكُمْ قَالُوا آمَنَّا وَقَد دَّخَلُوا بِالْكُفْرِ وَهُمْ قَدْ خَرَجُوا بِهِ ۚ وَاللَّهُ أَعْلَمُ بِمَا كَانُوا يَكْتُمُونَ", "tafsir": "حال المنافقين الذين يدعون الإيمان كذباً، فهم دخلوا عندك بالكفر وخرجوا به كما هم، والله مطلع على سرائرهم.", "irab": "آمنا: فعل وفاعل، الكفر: اسم مجرور، الله: مبتدأ، يكتمون: مضارع مرفوع." },
    { "id": 62, "text": "وَتَرَىٰ كَثِيرًا مِّنْهُمْ يُسَارِعُونَ فِي الْإِثْمِ وَالْعُدْوَانِ وَأَكْلِهِمُ السُّحْتَ ۚ لَبِئْسَ مَا كَانُوا يَعْمَلُونَ", "tafsir": "ذم اندفاع الكثير من اليهود نحو المعاصي والظلم وأكل المال الحرام، وقبح صنيعهم هذا.", "irab": "كثيراً: مفعول به، السحت: مفعول به للمصدر، يعملون: مضارع مرفوع." },
    { "id": 63, "text": "لَوْلَا يَنْهَاهُمُ الرَّبَّانِيُّونَ وَالْأَحْبَارُ عَن قَوْلِهِمُ الْإِثْمَ وَأَكْلِهِمُ السُّحْتَ ۚ لَبِئْسَ مَا كَانُوا يَصْنَعُونَ", "tafsir": "توبيخ لعلماء أهل الكتاب لسكوتهم عن منكرات عوامهم وعدم نهيهم عن الكذب وأكل الحرام.", "irab": "الربانيون: فاعل مرفوع بالواو، الإثم: مفعول به، يصنعون: مضارع مرفوع." },
    { "id": 64, "text": "وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَةٌ ۚ غُلَّتْ أَيْدِيهِمْ وَلُعِنُوا بِمَا قَالُوا", "tafsir": "رد على تطاول اليهود ووصفهم الله بالبخل؛ بل يداه مبسوطتان بالعطاء، وتوعدهم بالعذاب والفتنة واللعنة.", "irab": "اليهود: فاعل، يد: مبتدأ، الله: مضاف إليه، مبسوطتان: خبر مرفوع بالألف." },
    { "id": 65, "text": "وَلَوْ أَنَّ أَهْلَ الْكِتَابِ آمَنُوا وَاتَّقَوْا لَكَفَّرْنَا عَنْهُمْ سَيِّئَاتِهِمْ وَلَأَدْخَلْنَاهُمْ جَنَّاتِ النَّعِيمِ", "tafsir": "وعد الله لأهل الكتاب بالجنة وتكفير الذنوب والنعيم المقيم إذا آمنوا واتقوا ربه.", "irab": "أهل: اسم أن، سيئاتهم: مفعول به، جنات: مفعول به ثانٍ." },
    { "id": 66, "text": "وَلَوْ أَنَّهُمْ أَقَامُوا التَّوْرَاةَ وَالْإِنجِيلَ وَمَا أُنزِلَ إِلَيْهِم مِّن رَّبِّهِمْ لَأَكَلُوا مِن فَوْقِهِمْ", "tafsir": "لو امتثلوا لأوامر كتبهم المنزلة لرزقهم الله من كل جانب، مع بيان انقسامهم لمقتصد وفاسق.", "irab": "أقاموا: فعل وفاعل، التوراة: مفعول به، مقتصدة: نعت، ساء: فعل ذم." },
    { "id": 67, "text": "۞ يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنزِلَ إِلَيْكَ مِن رَّبِّكَ ۖ وَإِن لَّمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُ", "tafsir": "أمر للنبي ﷺ بالتبليغ التام للوحي، ووعده بالحماية من كيد الناس، فالله لا يهدي الكافرين.", "irab": "الرسول: منادى، بلغ: فعل أمر، رسالته: مفعول به، الله: فاعل يعصمك." },
    { "id": 68, "text": "قُلْ يَا أَهْلَ الْكِتَابِ لَسْتُمْ عَلَىٰ شَيْءٍ حَتَّىٰ تُقِيمُوا التَّوْرَاةَ وَالْإِنجِيلَ", "tafsir": "إعلام أهل الكتاب بأن دينهم لا قيمة له حتى يعملوا بكتبهم ويؤمنوا بالقرآن المُنزل للنبي ﷺ.", "irab": "أهل: منادى، شيء: اسم مجرور، التوراة: مفعول به، طغياناً: مفعول به ثانٍ." },
    { "id": 69, "text": "إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئُونَ وَالنَّصَارَىٰ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ", "tafsir": "معيار النجاة للجميع هو الإيمان الصادق بالله واليوم الآخر والعمل الصالح، فلا خوف عليهم ولا حزن.", "irab": "الذين: اسم إن، الصابئون: مبتدأ، مَن: اسم شرط، يحزنون: مضارع مرفوع." },
    { "id": 70, "text": "لَقَدْ أَخَذْنَا مِيثَاقَ بَنِي إِسْرَائِيلَ وَأَرْسَلْنَا إِلَيْهِمْ رُسُلًا ۖ كُلَّمَا جَاءَهُمْ رَسُولٌ", "tafsir": "نقض بني إسرائيل للعهود وتكذيبهم للرسل وقتلهم لبعضهم كلما خالف الوحي أهواءهم.", "irab": "ميثاق: مفعول به، رسلاً: مفعول به، رسول: فاعل، فريقاً: مفعول به مقدم." },
    { "id": 71, "text": "وَحَسِبُوا أَلَّا تَكُونَ فِتْنَةٌ فَعَمُوا وَصَمُّوا ثُمَّ تَابَ اللَّهُ عَلَيْهِمْ", "tafsir": "ظنوا أنهم لن يعاقبوا على أفعالهم فتمادوا في الضلال، ورغم توبة الله عليهم عاد الكثير منهم للعمى.", "irab": "فتنة: اسم تكون، الله: فاعل، بصير: خبر، يعملون: مضارع مرفوع." },
    { "id": 72, "text": "لَقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ ۖ وَقَالَ الْمَسِيحُ يَا بَنِي إِسْرَائِيلَ", "tafsir": "إكفار القائلين بألوهية عيسى، ونقض قولهم بكلام عيسى نفسه الذي أمر بعبادة الله وحده.", "irab": "الذين: فاعل، الله: اسم إن، المسيح: خبر إن، أنصار: مبتدأ مؤخر." },
    { "id": 73, "text": "لَّقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ ۘ وَمَا مِنْ إِلَٰهٍ إِلَّا إِلَٰهٌ وَاحِدٌ", "tafsir": "إكفار القائلين بالتثليث، وتأكيد وحدانية الله المطلقة، والوعيد لمن لم ينته عن هذا الكذب.", "irab": "ثالث: خبر إن، إله: مبتدأ مجرور لفظاً، أليم: نعت." },
    { "id": 74, "text": "أَفَلَا يَتُوبُونَ إِلَى اللَّهِ وَيَسْتَغْفِرُونَهُ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ", "tafsir": "دعوة إلهية رحيمة للمشركين بالتوبة والاستغفار، فالله واسع المغفرة لمن رجع إليه.", "irab": "يتوبون: مضارع مرفوع، الله: اسم مجرور، الله: مبتدأ، غفور: خبر." },
    { "id": 75, "text": "مَّا الْمَسِيحُ ابْنُ مَرْيَمَ إِلَّا رَسُولٌ قَدْ خَلَتْ مِن قَبْلِهِ الرُّسُلُ وَأُمُّهُ صِدِّيقَةٌ", "tafsir": "بيان حقيقة عيسى عليه السلام؛ فهو رسول بشر كغيره، وأمه امرأة صالحة، وكلاهما كانا يحتاجان للطعام كالبشر.", "irab": "المسيح: مبتدأ، رسول: خبر، أمه: مبتدأ، صديقة: خبر، يؤفكون: مضارع مبني للمجهول." }
    { "id": 76, "text": "قُلْ أَتَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَمْلِكُ لَكُمْ ضَرًّا وَلَا نَفْعًا ۚ وَاللَّهُ هُوَ السَّمِيعُ الْعَلِيمُ", "tafsir": "إنكار على من يعبد غير الله كالمسيح، فهم لا يملكون نفعاً ولا ضراً، والله هو السميع للأقوال العليم بالأفعال.", "irab": "أتعبدون: همزة استفهام ومضارع مرفوع، الله: اسم مجرور، ضراً: مفعول به، السميع: خبر." },
    { "id": 77, "text": "قُلْ يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ غَيْرَ الْحَقِّ وَلَا تَتَّبِعُوا أَهْوَاءَ قَوْمٍ قَدْ ضَلُّوا", "tafsir": "النهي عن المبالغة وتجاوز الحق في الدين، وتحذير من اتباع ضلالات الأمم السابقة الذين ضلوا وأضلوا كثيراً.", "irab": "لا: ناهية، الحق: مضاف إليه، أهواء: مفعول به، كثيراً: مفعول به." },
    { "id": 78, "text": "لُعِنَ الَّذِينَ كَفَرُوا مِن بَنِي إِسْرَائِيلَ عَلَىٰ لِسَانِ دَاوُودَ وَعِيسَى ابْنِ مَرْيَمَ", "tafsir": "طرد الكفار من بني إسرائيل من رحمة الله بدعاء أنبيائهم عليهم بسبب عصيانهم وتجاوزهم لحدود الله.", "irab": "لعن: فعل مبني للمجهول، الذين: نائب فاعل، داوود: اسم مجرور، يعتدون: مضارع مرفوع." },
    { "id": 79, "text": "كَانُوا لَا يَتَنَاهَوْنَ عَن مُّنكَرٍ فَعَلُوهُ ۚ لَبِئْسَ مَا كَانُوا يَفْعَلُونَ", "tafsir": "من أسباب لعنهم أنهم كانوا يسكتون عن المنكر ولا ينصح بعضهم بعضاً، وقبح صنيعهم هذا.", "irab": "كانوا: فعل ناقص واسمه، لا: نافية، منكر: اسم مجرور، يفعلون: مضارع مرفوع." },
    { "id": 80, "text": "تَرَىٰ كَثِيرًا مِّنْهُمْ يَتَوَلَّوْنَ الَّذِينَ كَفَرُوا ۚ لَبِئْسَ مَا قَدَّمَتْ لَهُمْ أَنفُسُهُمْ", "tafsir": "موالاة كثير من اليهود للمشركين نكاية بالمسلمين، وهو فعل قبيح استحقوا به غضب الله والخلود في النار.", "irab": "ترى: فعل مضارع، كثيراً: مفعول به، أنفسهم: فاعل، خالدون: خبر." },
    { "id": 81, "text": "وَلَوْ كَانُوا يُؤْمِنُونَ بِاللَّهِ وَالنَّبِيِّ وَمَا أُنزِلَ إِلَيْهِ مَا اتَّخَذُوهُمْ أَوْلِيَاءَ", "tafsir": "لو كان إيمانهم صادقاً لما والوا أعداء الله، ولكن نفاقهم وفجورهم هو الغالب.", "irab": "الله: اسم مجرور، النبي: معطوف، أولياء: مفعول به ثانٍ، فاسقون: خبر." },
    { "id": 82, "text": "لَتَجِدَنَّ أَشَدَّ النَّاسِ عَدَاوَةً لِّلَّذِينَ آمَنُوا الْيَهُودَ وَالَّذِينَ أَشْرَكُوا", "tafsir": "بيان عداوة اليهود والمشركين للمؤمنين، وفي المقابل مودة النصارى الذين فيهم علماء وعباد لا يستكبرون.", "irab": "أشد: مفعول به، عداوة: تمييز، اليهود: مفعول به ثانٍ، يستكبرون: مضارع مرفوع." },
    { "id": 83, "text": "وَإِذَا سَمِعُوا مَا أُنزِلَ إِلَى الرَّسُولِ تَرَىٰ أَعْيُنَهُمْ تَفِيضُ مِنَ الدَّمْعِ مِمَّا عَرَفُوا مِنَ الْحَقِّ", "tafsir": "تأثر النصارى الصادقين بسماع القرآن وبكاؤهم خشية وإيماناً بصدقه.", "irab": "أعينهم: مفعول به، الدمع: اسم مجرور، الحق: اسم مجرور، الشاهدين: اسم مجرور بالياء." },
    { "id": 84, "text": "وَمَا لَنَا لَا نُؤْمِنُ بِاللَّهِ وَمَا جَاءَنَا مِنَ الْحَقِّ وَنَطْمَعُ أَن يُدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصَّالِحِينَ", "tafsir": "قول النصارى الذين آمنوا: أي مانع يمنعنا من الإيمان بالله والحق ونحن نرجو صحبة الصالحين في الجنة؟", "irab": "نؤمن: مضارع مرفوع، الله: اسم مجرور، ربنا: فاعل، الصالحين: نعت مجرور بالياء." },
    { "id": 85, "text": "فَأَثَابَهُمُ اللَّهُ بِمَا قَالُوا جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا", "tafsir": "جزاء صدقهم في القول والإيمان هو الجنة والخلود فيها، وهذا ثواب المحسنين.", "irab": "أثابهم: فعل ومفعول، الله: فاعل، جنات: مفعول به ثانٍ، المحسنين: مضاف إليه." },
    { "id": 86, "text": "وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ", "tafsir": "المصير المقابل هو نار الجحيم لمن جحد بالحق وكذب بآيات الله.", "irab": "الذين: مبتدأ، كذبوا: فعل وفاعل، أولئك: مبتدأ ثان، الجحيم: مضاف إليه." },
    { "id": 87, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحَرِّمُوا طَيِّبَاتِ مَا أُحِلَّ اللَّهُ لَكُمْ وَلَا تَعْتَدُوا", "tafsir": "النهي عن التشدد في الدين بتحريم الحلال من المأكل والمشرب، والنهي عن تجاوز حدود الله.", "irab": "لا: ناهية، طيبات: مفعول به، الله: فاعل، المعتدين: مفعول به منصوب بالياء." },
    { "id": 88, "text": "وَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلَالًا طَيِّبًا ۚ وَاتَّقُوا اللَّهَ الَّذِي أَنتُم بِهِ مُؤْمِنُونَ", "tafsir": "الأمر بالتمتع بالرزق الحلال الطيب المقرون بتقوى الله الذي تؤمنون به.", "irab": "كلوا: فعل أمر، الله: فاعل، حلالاً: حال أو مفعول به، مؤمنون: خبر." },
    { "id": 89, "text": "لَا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَٰكِن يُؤَاخِذُكُم بِمَا عَقَّدتُّمُ الْأَيْمَانَ", "tafsir": "أحكام الأيمان: العفو عن لغو اليمين، ووجوب الكفارة عند الحنث في اليمين المقصودة (إطعام، كسوة، عتق، أو صيام).", "irab": "الله: فاعل، الأيمان: مفعول به، مساكين: مضاف إليه، عظيماً: نعت." },
    { "id": 90, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالْأَنصَابُ وَالْأَزْلَامُ رِجْسٌ مِّنْ عَمَلِ الشَّيْطَانِ", "tafsir": "التحريم القطعي للخمر والقمار والأصنام والأزلام، ووصفها بأنها قذارة من عمل الشيطان يجب اجتنابها للفلاح.", "irab": "الخمر: مبتدأ، رجس: خبر، الشيطان: مضاف إليه، تفلحون: مضارع مرفوع." }
    { "id": 91, "text": "إِنَّمَا يُرِيدُ الشَّيْطَانُ أَن يُوقِعَ بَيْنَكُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ فِي الْخَمْرِ وَالْمَيْسِرِ", "tafsir": "الشيطان يستخدم الخمر والقمار لزرع الحقد بينكم وصدكم عن ذكر الله، فهل أنتم منتهون؟", "irab": "إنما: حصر، الشيطان: فاعل، العداوة: مفعول به، منتهون: خبر مرفوع بالواو." },
    { "id": 92, "text": "وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَاحْذَرُوا ۚ فَإِن تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّمَا عَلَىٰ رَسُولِنَا الْبَلَاغُ الْمُبِينُ", "tafsir": "الأمر بوجوب الطاعة والحذر من المخالفة، فإن أعرضتم فاعلموا أن مهمة الرسول هي التبليغ الواضح فقط.", "irab": "أطيعوا: فعل أمر، الله: مفعول به، توليتم: فعل وفاعل، البلاغ: مبتدأ مؤخر." },
    { "id": 93, "text": "لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا إِذَا مَا اتَّقَوا", "tafsir": "لا إثم على من شرب الخمر قبل تحريمها بشرط التقوى والإيمان والعمل الصالح المستمر.", "irab": "ليس: فعل ناقص، الذين: اسم مجرور، جناح: اسم ليس مؤخر، محسنين: مفعول به." },
    { "id": 94, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَيَبْلُوَنَّكُمُ اللَّهُ بِشَيْءٍ مِّنَ الصَّيْدِ تَنَالُهُ أَيْدِيكُمْ وَرِمَاحُكُمْ", "tafsir": "ابتلاء المحرمين بالصيد القريب منهم لاختبار تقواهم وخشيتهم لله في الغيب.", "irab": "ليبلونكم: مضارع مبني على الفتح، الله: فاعل، الصيد: اسم مجرور، أليم: نعت." },
    { "id": 95, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْتُلُوا الصَّيْدَ وَأَنتُمْ حُرُمٌ ۚ وَمَن قَتَلَهُ مِنكُم مُّتَعَمِّدًا", "tafsir": "تحريم الصيد على المحرم بحج أو عمرة، ووجوب الفدية (مثل ما قتل) أو الإطعام أو الصيام لمن خالف.", "irab": "لا: ناهية، تقتلوا: مضارع مجزوم، حرُم: خبر، متعمداً: حال، عزيز: خبر." },
    { "id": 96, "text": "أُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ وَطَعَامُهُ مَتَاعًا لَّكُمْ وَلِلسَّيَّارَةِ ۖ وَحُرِّمَ عَلَيْكُمْ صَيْدُ الْبَرِّ مَا دُمْتُمْ حُرُمًا", "tafsir": "إباحة صيد البحر للمحرم والمسافر، واستمرار تحريم صيد البر ما دام الإنسان محرماً.", "irab": "أحل: مبني للمجهول، صيد: نائب فاعل، متاعاً: مفعول لأجله، حرماً: خبر دمتم." },
    { "id": 97, "text": "جَعَلَ اللَّهُ الْكَعْبَةَ الْبَيْتَ الْحَرَامَ قِيَامًا لِّلنَّاسِ وَالشَّهْرَ الْحَرَامَ وَالْهَدْيَ", "tafsir": "جعل الله الكعبة والأماكن المقدسة وسيلة لاستقامة حياة الناس وأمنهم ومصالحهم.", "irab": "جعل: فعل، الله: فاعل، الكعبة: مفعول به أول، قياماً: مفعول به ثانٍ." },
    { "id": 98, "text": "اعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ وَأَنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "tafsir": "تذكير بقوة عقاب الله للعاصين، وسعة مغفرته ورحمته للتائبين المطيعين.", "irab": "اعلموا: فعل أمر، الله: اسم أن، شديد: خبر أن، غفور: خبر أن." },
    { "id": 99, "text": "مَّا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ ۗ وَاللَّهُ يَعْلَمُ مَا تُبْدُونَ وَمَا تَكْتُمُونَ", "tafsir": "وظيفة النبي ﷺ هي التبليغ فقط، والله مطلع على كل ما تظهرونه أو تخفونه من أعمال.", "irab": "الرسول: اسم مجرور، البلاغ: مبتدأ مؤخر، الله: مبتدأ، تبدون: مضارع مرفوع." },
    { "id": 100, "text": "قُل لَّا يَسْتَوِي الْخَبِيثُ وَالطَّيِّبُ وَلَوْ أَعْجَبَكَ كَثْرَةُ الْخَبِيثِ", "tafsir": "لا يتساوى الرديء والحسن في الميزان الإلهي ولو كثر الرديء، فالعبرة بالجودة والتقوى.", "irab": "لا: نافية، يستوي: فعل مضارع، الخبيث: فاعل، تفلحون: مضارع مرفوع." },
    { "id": 101, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَسْأَلُوا عَنْ أَشْيَاءَ إِن تُبْدَ لَكُمْ تَسُؤْكُمْ", "tafsir": "النهي عن كثرة السؤال في أمور لم ينزل فيها وحي لكي لا تُفرض وتشق عليكم، وعفو الله عما سلف.", "irab": "لا: ناهية، أشياء: اسم مجرور بالفتحة، تسؤكم: جواب الشرط، حليم: خبر ثانٍ." },
    { "id": 102, "text": "قَدْ سَأَلَهَا قَوْمٌ مِّن قَبْلِكُمْ ثُمَّ أَصْبَحُوا بِهَا كَافِرِينَ", "tafsir": "أمم سابقة سألوا أنبياءهم أسئلة مماثلة فلما جاءتهم الأوامر جحدوا بها ولم ينفذوها.", "irab": "سألها: فعل ومفعول، قوم: فاعل، كافرين: خبر أصبح منصوب بالياء." },
    { "id": 103, "text": "مَا جَعَلَ اللَّهُ مِن بَحِيرَةٍ وَلَا سَائِبَةٍ وَلَا وَصِيلَةٍ وَلَا حَامٍ", "tafsir": "إبطال معتقدات الجاهلية في تحريم بعض الأنعام (البحيرة والسائبة...)، وتأكيد أنها كذب على الله.", "irab": "جعل: فعل، الله: فاعل، بحيرة: اسم مجرور لفظاً مفعول به، كاذبون: خبر." },
    { "id": 104, "text": "وَإِذَا قِيلَ لَهُمْ تَعَالَوْا إِلَىٰ مَا أَنزَلَ اللَّهُ وَإِلَى الرَّسُولِ قَالُوا حَسْبُنَا مَا وَجَدْنَا عَلَيْهِ آبَاءَنَا", "tafsir": "عناد المشركين؛ يكتفون بتقليد آبائهم الضالين ويرفضون اتباع الوحي الإلهي الصادق.", "irab": "قيل: مبني للمجهول، حسبنا: مبتدأ، آباءنا: مفعول به، يعلمون: مضارع مرفوع." },
    { "id": 105, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنفُسَكُمْ ۖ لَا يَضُرُّكُم مَّن ضَلَّ إِذَا اهْتَدَيْتُمْ", "tafsir": "التأكيد على المسؤولية الفردية؛ فإذا التزمتم بالحق فلا يضركم ضلال الآخرين، والمرجع لله للحساب.", "irab": "عليكم: فعل أمر (بمعنى الزموا)، أنفسكم: مفعول به، تعملون: مضارع مرفوع."
    { "id": 106, "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا شَهَادَةُ بَيْنِكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ حِينَ الْوَصِيَّةِ اثْنَانِ ذَوَا عَدْلٍ مِّنكُمْ", "tafsir": "أحكام الوصية عند الموت؛ بوجوب الإشهاد عليها من عدلين، وكيفية حلف اليمين عند الشك في أمانتهما.", "irab": "شهادة: مبتدأ، اثنان: خبر مرفوع بالألف، ذوا: نعت، الموت: فاعل." },
    { "id": 107, "text": "فَإِنْ عُثِرَ عَلَىٰ أَنَّهُمَا اسْتَحَقَّا إِثْمًا فَآخَرَانِ يَقُومَانِ مَقَامَهُمَا مِنَ الَّذِينَ اسْتَحَقَّ عَلَيْهِمُ الْأَوْلَيَانِ", "tafsir": "إذا ظهرت خيانة الشهود الأوائل، يقوم أقرب الناس للميت بالشهادة بدلاً عنهما بعد حلف اليمين.", "irab": "عثر: فعل مبني للمجهول، إثماً: مفعول به، الأوليان: بدل مرفوع بالألف." },
    { "id": 108, "text": "ذَٰلِكَ أَدْنَىٰ أَن يَأْتُوا بِالشَّهَادَةِ عَلَىٰ وَجْهِهَا أَوْ يَخَافُوا أَن تُرَدَّ أَيْمَانٌ بَعْدَ أَيْمَانِهِمْ", "tafsir": "هذا التشريع يضمن دقة الشهادة خوفاً من الفضيحة أو رد اليمين، فالله لا يهدي الفاسقين.", "irab": "ذلك: مبتدأ، أدنى: خبر، الشهادة: اسم مجرور، الفاسقين: مضاف إليه." },
    { "id": 109, "text": "يَوْمَ يَجْمَعُ اللَّهُ الرُّسُلَ فَيَقُولُ مَاذَا أُجِبْتُمْ ۖ قَالُوا لَا عِلْمَ لَنَا ۖ إِنَّكَ أَنتَ عَلَّامُ الْغُيُوبِ", "tafsir": "مشهد يوم القيامة حين يسأل الله الرسل عن استجابة أممهم، فيردون بتفويض العلم لله وحده.", "irab": "يوم: ظرف زمان، الله: فاعل، الرسل: مفعول به، الغيوب: مضاف إليه." },
    { "id": 110, "text": "إِذْ قَالَ اللَّهُ يَا عِيسَى ابْنَ مَرْيَمَ اذْكُرْ نِعْمَتِي عَلَيْكَ وَعَلَىٰ وَالِدَتِكَ إِذْ أَيَّدتُّكَ بِرُوحِ الْقُدُسِ", "tafsir": "تذكير عيسى بمعجزاته: التكلم في المهد، علم الكتاب، خلق الطير، إبراء الأكمه والأبرص، وإحياء الموتى بإذن الله.", "irab": "عيسى: منادى، نعمتي: مفعول به، القدس: مضاف إليه، الطير: مضاف إليه." },
    { "id": 111, "text": "وَإِذْ أَوْحَيْتُ إِلَى الْحَوَارِيِّينَ أَنْ آمِنُوا بِي وَبِرَسُولِي قَالُوا آمَنَّا وَاشْهَدْ بِأَنَّنَا مُسْلِمُونَ", "tafsir": "إلهام الله لأتباع عيسى (الحواريين) بالإيمان والتوحيد، وإقرارهم بالإسلام لله.", "irab": "أوحيت: فعل وفاعل، الحواريين: اسم مجرور بالياء، مسلمون: خبر إن مرفوع بالواو." },
    { "id": 112, "text": "إِذْ قَالَ الْحَوَارِيُّونَ يَا عِيسَى ابْنَ مَرْيَمَ هَلْ يَسْتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ", "tafsir": "طلب الحواريين من عيسى معجزة المائدة النازلة من السماء ليطمئنوا، وأمرهم بالتقوى.", "irab": "الحواريون: فاعل، مائدة: مفعول به، السماء: اسم مجرور، مؤمنين: خبر كنتم." },
    { "id": 113, "text": "قَالُوا نُرِيدُ أَن نَّأْكُلَ مِنْهَا وَتَطْمَئِنَّ قُلُوبُنَا وَنَعْلَمَ أَن قَدْ صَدَقْتَنَا", "tafsir": "أسباب طلب المائدة: الأكل منها، طمأنينة القلب، والتأكد من صدق الرسالة والشهادة عليها.", "irab": "نريد: مضارع مرفوع، قلوبنا: فاعل، الشاهدين: اسم مجرور بالياء." },
    { "id": 114, "text": "قَالَ عِيسَى ابْنُ مَرْيَمَ اللَّهُمَّ رَبَّنَا أَنزِلْ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ تَكُونُ لَنَا عِيدًا", "tafsir": "دعاء عيسى ربه بإنزال المائدة لتكون عيداً وشكراً وآية، وطلب الرزق من الله خير الرازقين.", "irab": "اللهم: منادى، أنزل: فعل دعاء، عيداً: خبر تكون، الرازقين: مضاف إليه." },
    { "id": 115, "text": "قَالَ اللَّهُ إِنِّي مُنَزِّلُهَا عَلَيْكُمْ ۖ فَمَن يَكْفُرْ بَعْدُ مِنكُمْ فَإِنِّي أُعَذِّبُهُ عَذَابًا لَّا أُعَذِّبُهُ أَحَدًا مِّنَ الْعَالَمِينَ", "tafsir": "استجابة الله للدعاء مع التحذير الشديد: من يكفر بعد هذه المعجزة فله عذاب لا مثيل له.", "irab": "إني: اسم إن، منزله: خبر إن، عذاباً: مفعول مطلق، العالمين: اسم مجرور." },
    { "id": 116, "text": "وَإِذْ قَالَ اللَّهُ يَا عِيسَى ابْنَ مَرْيَمَ أَأَنتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَٰهَيْنِ مِن دُونِ اللَّهِ", "tafsir": "سؤال الله لعيسى (توبيخاً لمن عبده) هل أمرت الناس بعبادتك؟ فيرد عيسى بتنزيه الله والبراءة من ذلك.", "irab": "أنت: مبتدأ، إلهين: مفعول به ثانٍ، غيوب: مضاف إليه." },
    { "id": 117, "text": "مَا قُلْتُ لَهُمْ إِلَّا مَا أَمَرْتَنِي بِهِ أَنِ اعْبُدُوا اللَّهَ رَبِّي وَرَبَّكُمْ", "tafsir": "دفاع عيسى عن نفسه: لم أقل إلا التوحيد، وأنت الشهيد المطلع على كل شيء.", "irab": "قلت: فعل وفاعل، الله: مفعول به، شهيد: خبر." },
    { "id": 118, "text": "إِن تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ ۖ وَإِن تَغْفِرْ لَهُمْ فَإِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ", "tafsir": "تفويض الأمر لله؛ فعباده تحت مشيئته، وإن غفر فهو العزيز الذي لا يغلب، الحكيم في تدبيره.", "irab": "تعذبهم: فعل الشرط، عبادك: خبر إن، العزيز: خبر إن." },
    { "id": 119, "text": "قَالَ اللَّهُ هَٰذَا يَوْمُ يَنفَعُ الصَّادِقِينَ صِدْقُهُمْ ۚ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهارُ", "tafsir": "حكم الله النهائي: يوم القيامة ينفع الصادقين إيمانهم، ولهم الجنة والرضا الإلهي والفوز العظيم.", "irab": "يوم: خبر، الصادقين: مفعول به مقدم، صدقهم: فاعل، العظيم: نعت." },
    { "id": 120, "text": "لِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا فِيهِنَّ ۚ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ", "tafsir": "خاتمة السورة: لله الملكية المطلقة للكون وما فيه، وهو القادر على كل شيء بلا حدود.", "irab": "لله: خبر مقدم، ملك: مبتدأ مؤخر، هو: مبتدأ، قدير: خبر." }
] },
    { "id": 6, "name": "الأنعام", "verses": [    { "id": 1, "text": "الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَجَعَلَ الظُّلُمَاتِ وَالنُّورَ ۖ ثُمَّ الَّذِينَ كَفَرُوا بِرَبِّهِمْ يَعْدِلُونَ", "tafsir": "الثناء لله خالق الكون ومنظم النور والظلام، ومع وضوح عظمته يشرك به الكفار غيره.", "irab": "الحمد: مبتدأ، لله: خبر، السماوات: مفعول به، النور: معطوف." },
    { "id": 2, "text": "هُوَ الَّذِي خَلَقَكُم مِّن طِينٍ ثُمَّ قَضَىٰ أَجَلًا ۖ وَأَجَلٌ مُّسَمًّى عِندَهُ ۖ ثُمَّ أَنتُمْ تَمْتَرُونَ", "tafsir": "الله أوجدكم من طين وحدد لكل إنسان عمراً، وهناك أجل للبعث معلوم عنده، ومع ذلك تشكون.", "irab": "هو: مبتدأ، خلقكم: فعل ومفعول، أجلاً: مفعول به، تمترون: مضارع مرفوع." },
    { "id": 3, "text": "وَهُوَ اللَّهُ فِي السَّمَاوَاتِ وَفِي الْأَرْضِ ۖ يَعْلَمُ سِرَّكُمْ وَجَهْرَكُمْ وَيَعْلَمُ مَا تَكْسِبُونَ", "tafsir": "الله هو المعبود وحده في الكون كله، مطلع على أسراركم وأفعالكم وما تجنونه من أعمال.", "irab": "هو: مبتدأ، الله: خبر، سركم: مفعول به، تكسبون: مضارع مرفوع." },
    { "id": 4, "text": "وَمَا تَأْتِيهِم مِّنْ آيَةٍ مِّنْ آيَاتِ رَبِّهِمْ إِلَّا كَانُوا عَنْهَا مُعْرِضِينَ", "tafsir": "كلما جاءت الكفار علامة تدل على صدق الرسول، قابلوها بالإعراض والصد والرفض.", "irab": "آية: فاعل مجرور لفظاً، آيات: اسم مجرور، معرضين: خبر كانوا." },
    { "id": 5, "text": "فَقَدْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ ۖ فَسَوْفَ يَأْتِيهِمْ أَنبَاءُ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ", "tafsir": "كذبوا بالقرآن، فسينالون عاقبة استهزائهم وتكذيبهم حين يقع عليهم العذاب.", "irab": "كذبوا: فعل وفاعل، الحق: اسم مجرور، أنباء: فاعل، يستهزئون: مضارع مرفوع." },
    { "id": 6, "text": "أَلَمْ يَرَوْا كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ مَّكَّنَّاهُمْ فِي الْأَرْضِ مَا لَمْ نُمَكِّن لَّكُمْ", "tafsir": "عبرة من الأمم السابقة التي كانت أقوى وأكثر مالاً، فأهلكهم الله بذنوبهم واستبدلهم بغيرهم.", "irab": "أهلكنا: فعل وفاعل، قرن: اسم مجرور، الأرض: اسم مجرور، الأنهار: فاعل." },
    { "id": 7, "text": "وَلَوْ نَزَّلْنَا عَلَيْكَ كِتَابًا فِي قِرْطَاسٍ فَلَمَسُوهُ بِأَيْدِيهِمْ لَقَالَ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُّبِينٌ", "tafsir": "لو أنزل الله عليهم كتاباً مكتوباً يلمسونه، لقالوا بعنادهم إنه سحر وخداع.", "irab": "نزلنا: فعل وفاعل، كتاباً: مفعول به، الذين: فاعل، سحر: خبر، مبين: نعت." },
    { "id": 8, "text": "وَقَالُوا لَوْلَا أُنزِلَ عَلَيْهِ مَلَكٌ ۖ وَلَوْ أَنزَلْنَا مَلَكًا لَّقُضِيَ الْأَمْرُ ثُمَّ لَا يُنظَرُونَ", "tafsir": "طلبوا رؤية ملك مع النبي، ولو نزل الملك لرأوه لكان ذلك إهلاكاً فورياً لهم إن لم يؤمنوا.", "irab": "أنزل: مبني للمجهول، ملك: نائب فاعل، الأمر: نائب فاعل، ينظرون: مضارع مبني للمجهول." },
    { "id": 9, "text": "وَلَوْ جَعَلْنَاهُ مَلَكًا لَّجَعَلْنَاهُ رَجُلًا وَلَلَبَسْنَا عَلَيْهِم مَّا يَلْبِسُونَ", "tafsir": "لو أرسل الله ملكاً لجعله في هيئة رجل ليتمكنوا من مخاطبته، ولظلت حيرتهم كما هي.", "irab": "جعلناه: فعل وفاعلان ومفعولان، رجلاً: مفعول به ثانٍ، يلبسون: مضارع مرفوع." },
    { "id": 10, "text": "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ فَحَاقَ بِالَّذِينَ سَخِرُوا مِنْهُم مَّا كَانُوا بِهِ يَسْتَهْزِئُونَ", "tafsir": "تسلية للنبي ﷺ؛ فقد استهزأت الأمم السابقة برسلها فأصابهم العذاب الذي كانوا يسخرون منه.", "irab": "استهزئ: مبني للمجهول، رسل: اسم مجرور، حاق: فعل، الذين: اسم مجرور." },
    { "id": 11, "text": "قُلْ سِيرُوا فِي الْأَرْضِ ثُمَّ انظُرُوا كَيْفَ كَانَ عاقِبَةُ الْمُكَذِّبِينَ", "tafsir": "دعوة للتأمل في بقايا الأمم المكذبة ليروا كيف كانت نهايتهم الأليمة بالدمار.", "irab": "سيروا: فعل أمر، الأرض: اسم مجرور، عاقبة: اسم كان، المكذبين: مضاف إليه." },
    { "id": 12, "text": "قُل لِّمَن مَّا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ قُل لِّلَّهِ ۚ كَتَبَ عَلَىٰ نَفْسِهِ الرَّحْمَةَ", "tafsir": "كل ما في الكون ملك لله، وقد أوجب على نفسه الرحمة، وسيجمع الناس للحساب يقيناً.", "irab": "لله: خبر مقدم، ما: مبتدأ مؤخر، الرحمة: مفعول به، القيامة: مضاف إليه." },
    { "id": 13, "text": "وَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ", "tafsir": "كل كائن استقر في الزمان (ليل ونهار) هو ملك لله الخالق، المطلع على كل مسموع ومعلوم.", "irab": "له: خبر مقدم، ما: مبتدأ مؤخر، الليل: اسم مجرور، العليم: خبر ثانٍ." },
    { "id": 14, "text": "قُلْ أَغَيْرَ اللَّهِ أَتَّخِذُ وَلِيًّا فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ يُطْعِمُ وَلَا يُطْعَمُ", "tafsir": "إنكار اتخاذ ولي غير الله خالق الكون الذي يرزق الجميع ولا يحتاج لرزق أحد، والأمر بالإسلام.", "irab": "الله: مضاف إليه، ولياً: مفعول به ثانٍ مقدم، السماوات: مضاف إليه، يطعم: مضارع مرفوع." },
    { "id": 15, "text": "قُلْ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ", "tafsir": "إعلان الخوف من عذاب يوم القيامة في حال مخالفة أمر الله وعصيانه.", "irab": "أخاف: فعل مضارع، عذاب: مفعول به، يوم: مضاف إليه، عظيم: نعت." },
    { "id": 16, "text": "مَّن يُصْرَفْ عَنْهُ يَوْمَئِذٍ فَقَدْ رَحِمَهُ ۚ وَذَٰلِكَ الْفَوْزُ الْمُبِينُ", "tafsir": "من ينجو من عذاب ذلك اليوم فقد نال رحمة الله الخاصة، وهذا هو النجاح الواضح الحقيقي.", "irab": "من: اسم شرط، يصرف: جواب الشرط مبني للمجهول، الفوز: خبر، المبين: نعت." },
    { "id": 17, "text": "وَإِن يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُ إِلَّا هُوَ ۖ وَإِن يَمْسَسْكَ بِخَيْرٍ فَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ", "tafsir": "الضر والنفع بيد الله وحده؛ فلا أحد يزيل الضر سواه، ولا راد لفضله وقدرته المطلقة.", "irab": "يمسسك: فعل الشرط، الله: فاعل، كاشف: اسم لا، قدير: خبر." },
    { "id": 18, "text": "وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِ ۚ وَهُوَ الْحَكِيمُ الْخَبِيرُ", "tafsir": "الله هو الغالب المتصرف في خلقه، صاحب الحكمة البالغة والخبرة بكل تفاصيل العباد.", "irab": "هو: مبتدأ، القاهر: خبر، فوق: ظرف، الحكيم: خبر ثانٍ، الخبير: خبر ثالث." },
    { "id": 19, "text": "قُلْ أَيُّ شَيْءٍ أَكْبَرُ شَهَادَةً ۖ قُلِ اللَّهُ ۖ شَهِيدٌ بَيْنِي وَبَيْنَكُمْ", "tafsir": "أعظم شهادة هي شهادة الله بصدق الوحي، والقرآن جاء لينذر الناس، والنهي عن الشرك.", "irab": "أي: مبتدأ، شهادة: تمييز، الله: خبر، شهيد: خبر ثانٍ، نذيراً: مفعول به ثانٍ." },
    { "id": 20, "text": "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَعْرِفُونَهُ كَمَا يَعْرِفُونَ أَبْنَاءَهُمُ ۘ الَّذِينَ خَسِرُوا أَنفُسَهُمْ فَهُمْ لَا يُؤْمِنُونَ", "tafsir": "أهل الكتاب يعرفون صدق النبي ﷺ بوضوح تام، لكن المعرضين أهلكوا أنفسهم بالكفر.", "irab": "الذين: مبتدأ، الكتاب: مفعول به ثانٍ، أبناءهم: مفعول به، يؤمنون: مضارع مرفوع." }
    { "id": 21, "text": "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِآيَاتِهِ ۗ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ", "tafsir": "لا أحد أشد ظلماً ممن اختلق الكذب على الله أو جحد بآياته المنزلة، وعاقبة هؤلاء هي الخسران.", "irab": "مَن: اسم استفهام مبتدأ، كذباً: مفعول به، الظالمون: فاعل مرفوع بالواو." },
    { "id": 22, "text": "وَيَوْمَ نَحْشُرُهُمْ جَمِيعًا ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُوا أَيْنَ شُرَكَاؤُكُمُ الَّذِينَ كُنتُمْ تَزْعُمُونَ", "tafsir": "مشهد يوم الحشر حين يسأل الله المشركين توبيخاً: أين آلهتكم التي ادعيتم أنها تنفعكم؟", "irab": "يوم: ظرف زمان، جميعاً: حال، أين: اسم استفهام، شركاؤكم: مبتدأ مؤخر." },
    { "id": 23, "text": "ثُمَّ لَمْ تَكُن فِتْنَتُهُمْ إِلَّا أَن قَالُوا وَاللَّهِ رَبِّنَا مَا كُنَّا مُشْرِكِينَ", "tafsir": "لم يجد المشركون مخرجاً عند الحساب إلا الحلف بالله كذباً بأنهم لم يشركوا به شيئاً.", "irab": "فتنتهم: اسم تكن، الله: اسم مجرور (قسم)، مشركين: خبر كنا منصوب بالياء." },
    { "id": 24, "text": "انظُرْ كَيْفَ كَذَبُوا عَلَىٰ أَنفُسِهِمْ ۚ وَضَلَّ عَنْهُم مَّا كَانُوا يَفْتَرُونَ", "tafsir": "تعجب من كذبهم حتى على أنفسهم يوم القيامة، واختفاء كل الأوهام والأصنام التي كانوا يعبدونها.", "irab": "كيف: اسم استفهام، أنفسهم: اسم مجرور، ضل: فعل، ما: فاعل." },
    { "id": 25, "text": "وَمِنْهُم مَّن يَسْتَمِعُ إِلَيْكَ ۖ وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَن يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا", "tafsir": "بعض الكفار يسمعون القرآن لكن الله جعل على قلوبهم غطاءً يمنع فهمه عقوبة لإعراضهم.", "irab": "منهم: خبر مقدم، مَن: مبتدأ مؤخر، أكنة: مفعول به، وقراً: معطوف." },
    { "id": 26, "text": "وَهُمْ يَنْهَوْنَ عَنْهُ وَيَنْأَوْنَ عَنْهُ ۖ وَإِن يُهْلِكُونَ إِلَّا أَنفُسَهُمْ وَمَا يَشْعُرُونَ", "tafsir": "هؤلاء يمنعون الناس عن اتباع النبي ﷺ ويبتعدون هم أيضاً، وما يضرون إلا أنفسهم بهذا الصد.", "irab": "هم: مبتدأ، ينهون: مضارع مرفوع، أنفسهم: مفعول به، يشعرون: مضارع مرفوع." },
    { "id": 27, "text": "وَلَوْ تَرَىٰ إِذْ وُقِفُوا عَلَى النَّارِ فَقَالُوا يَا لَيْتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِآيَاتِ رَبِّنَا", "tafsir": "مشهد الكفار وهم على شفير النار يتمنون العودة للدنيا ليؤمنوا بآيات الله ويكونوا من المطيعين.", "irab": "ترى: فعل مضارع، النار: اسم مجرور، نرد: مضارع مرفوع، مؤمنين: خبر نكون." },
    { "id": 28, "text": "بَلْ بَدَا لَهُم مَّا كَانُوا يُخْفُونَ مِن قَبْلُ ۖ وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ", "tafsir": "ظهرت لهم الحقيقة التي جحدوها، ولو عادوا للدنيا لكرروا نفس الكفر لعنادهم الشديد.", "irab": "بدا: فعل، ما: فاعل، نهوا: فعل مبني للمجهول، كاذبون: خبر." },
    { "id": 29, "text": "وَقَالُوا إِنْ هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ", "tafsir": "إنكار المشركين للبعث وادعاؤهم أن الحياة هي هذه الدنيا فقط ولا حساب بعدها.", "irab": "هي: مبتدأ، حياتنا: خبر، نحن: مبتدأ، بمبعوثين: خبر مجرور لفظاً بالياء." },
    { "id": 30, "text": "وَلَوْ تَرَىٰ إِذْ وُقِفُوا عَلَىٰ رَبِّهِمْ ۚ قَالَ أَلَيْسَ هَٰذَا بِالْحَقِّ ۚ قَالُوا بَلَىٰ وَرَبِّنَا", "tafsir": "وقوفهم أمام الله للحساب وسؤالهم عن حقيقة البعث، فيعترفون بالحقيقة حين يذوقون العذاب.", "irab": "ربهم: اسم مجرور، هذا: مبتدأ، الحق: خبر مجرور لفظاً، العذاب: مفعول به." },
    { "id": 31, "text": "قَدْ خَسِرَ الَّذِينَ كَذَّبُوا بِلِقَاءِ اللَّهِ ۖ حَتَّىٰ إِذَا جَاءَتْهُمُ السَّاعَةُ بَغْتَةً", "tafsir": "خسر المكذبون بالآخرة، وحين تأتيهم القيامة فجأة يندمون على تقصيرهم ويحملون أوزارهم الثقيلة.", "irab": "الذين: فاعل، الله: مضاف إليه، الساعة: فاعل، أوزارهم: مفعول به." },
    { "id": 32, "text": "وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا لَعِبٌ وَلَهْوٌ ۖ وَلَلدَّارُ الْآخِرَةُ خَيْرٌ لِّلَّذِينَ يَتَّقُونَ", "tafsir": "حقيقة الدنيا أنها زائلة لا تدوم، والآخرة هي الباقية والخير الحقيقي لمن خشى الله.", "irab": "الحياة: مبتدأ، لعب: خبر، الدار: مبتدأ، خير: خبر، يعقلون: مضارع مرفوع." },
    { "id": 33, "text": "قَدْ نَعْلَمُ إِنَّهُ لَيَحْزُنُكَ الَّذِي يَقُولُونَ ۖ فَإِنَّهُمْ لَا يُكَذِّبُونَكَ وَلَٰكِنَّ الظَّالِمِينَ بِآيَاتِ اللَّهِ يَجْحَدُونَ", "tafsir": "تسلية للنبي ﷺ؛ فالله يعلم حزنه من قولهم، والحقيقة أنهم يصدقونه سراً لكنهم يعاندون آيات الله ظرماً.", "irab": "نعلم: فعل مضارع، الظالمين: اسم لكن منصوب بالياء، الله: مضاف إليه." },
    { "id": 34, "text": "وَلَقَدْ كُذِّبَتْ رُسُلٌ مِّن قَبْلِكَ فَصَبَرُوا عَلَىٰ مَا كُذِّبُوا وَأُوذُوا حَتَّىٰ أَتَاهُمْ نَصْرُنَا", "tafsir": "كل الرسل السابقين واجهوا التكذيب والأذى وصبروا حتى جاءهم نصر الله، وهذه سنة الله.", "irab": "رسل: نائب فاعل، نصرنا: فاعل، كلمات: مضاف إليه، المرسلين: مضاف إليه مجرور بالياء." },
    { "id": 35, "text": "وَإِن كَانَ كَبُرَ عَلَيْكَ إِعْرَاضُهُمْ فَإِنِ اسْتَطَعْتَ أَن تَبْتَغِيَ نَفَقًا فِي الْأَرْضِ أَوْ سُلَّمًا فِي السَّمَاءِ", "tafsir": "توجيه للنبي ﷺ أن إعراضهم قدر محتوم، ولو أوتيت معجزة خارقة ما آمنوا إلا بمشيئة الله.", "irab": "إعراضهم: فاعل، استطعت: فعل وفاعل، نفقاً: مفعول به، الجاهلين: اسم مجرور بالياء." },
    { "id": 36, "text": "۞ إِنَّمَا يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ ۘ وَالْمَوْتَىٰ يَبْعَثُهُمُ اللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ", "tafsir": "الاستجابة للحق تكون من أصحاب القلوب اليقظة، أما الكفار فهم كالموتى سيحشرهم الله للحساب.", "irab": "الذين: فاعل، الموتى: مفعول به مقدم، الله: فاعل، يرجعون: مضارع مبني للمجهول." },
    { "id": 37, "text": "وَقَالُوا لَوْلَا نُزِّلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ ۚ قُلْ إِنَّ اللَّهَ قَادِرٌ عَلَىٰ أَن يُنَزِّلَ آيَةً", "tafsir": "طلبوا معجزة حسنة، والله قادر على ذلك لكنه يؤخرها لحكمة، وأكثرهم لا يدركون سنن الله.", "irab": "آية: نائب فاعل، الله: اسم إن، قادر: خبر إن، أكثرهم: مبتدأ، يعلمون: جملة الخبر." },
    { "id": 40, "text": "وَمَا مِن دَابَّةٍ فِي الْأَرْضِ وَلَا طَائِرٍ يَطِيرُ بِجَنَاحَيْهِ إِلَّا أُمَمٌ أَمْثَالُكُمْ", "tafsير": "كل الكائنات هي أمم منظمة كالبشر، قد سجل الله أحوالها في اللوح المحفوظ ثم تحشر إليه.", "irab": "دابة: مبتدأ مجرور لفظاً، الأرض: اسم مجرور، أمم: خبر، ربهم: اسم مجرور." },
    { "id": 39, "text": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا صُمٌّ وَبُكْمٌ فِي الظُّلُمَاتِ ۗ مَن يَشَأِ اللَّهُ يُضْلِلْهُ", "tafsir": "المكذبون كالصم البكم في الظلام لا يبصرون الحق، فالله يضل من يشاء ويهدي من يشاء.", "irab": "الذين: مبتدأ، صم: خبر، الله: فاعل، يضلله: جواب الشرط، مستقيم: نعت." },
    { "id": 40, "text": "قُلْ أَرَأَيْتَكُمْ إِنْ أَتَاكُمْ عَذَابُ اللَّهِ أَوْ أَتَتْكُمُ السَّاعَةُ أَغَيْرَ اللَّهِ تَدْعُونَ", "tafsir": "سؤال للمشركين: عند الشدائد والأهوال هل تطلبون النجدة من غير الله؟ إن كنتم صادقين.", "irab": "أرأيتكم: فعل وفاعل ومفعول، عذاب: فاعل، الساعة: فاعل، غير: مفعول به مقدم." }
    { "id": 41, "text": "بَلْ إِيَّاهُ تَدْعُونَ فَيَكْشِفُ مَا تَدْعُونَ إِلَيْهِ إِن شَاءَ وَتَنسَوْنَ مَا تُشْرِكُونَ", "tafsir": "عند الشدائد تلجؤون إلى الله وحده فيكشف ضركم إن أراد، وتتركون آلهتكم المزعومة.", "irab": "إياه: مفعول به مقدم، تدعون: مضارع مرفوع، ما: مفعول به، تشركون: مضارع مرفوع." },
    { "id": 42, "text": "وَلَقَدْ أَرْسَلْنَا إِلَىٰ أُمَمٍ مِّن قَبْلِكَ فَأَخَذْنَاهُم بِالْبَأْسَاءِ وَالضَّرَّاءِ لَعَلَّهُمْ يَتَضَرَّعُونَ", "tafsir": "أرسل الله رسلاً لأمم سابقة وابتلاهم بالفقر والمرض لعلهم يخضعون لربهم وينيبون.", "irab": "أرسلنا: فعل وفاعل، أمم: اسم مجرور، البأساء: اسم مجرور، يتضرعون: مضارع مرفوع." },
    { "id": 43, "text": "فَلَوْلَا إِذْ جَاءَهُم بَأْسُنَا تَضَرَّعُوا وَلَٰكِن قَسَتْ قُلُوبُهُمْ وَزَيَّنَ لَهُمُ الشَّيْطَانُ مَا كَانُوا يَعْمَلُونَ", "tafsir": "لم يتضرعوا عند البلاء بل قست قلوبهم، وخدعهم الشيطان بتحسين أعمالهم القبيحة.", "irab": "بأسنا: فاعل، تضرعوا: فعل وفاعل، قلوبهم: فاعل، الشيطان: فاعل." },
    { "id": 44, "text": "فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ حَتَّىٰ إِذَا فَرِحُوا بِمَا أُوتُوا", "tafsir": "حين أعرضوا عن المواعظ فتح الله لهم الدنيا استدراجاً، ثم أخذهم بالعذاب فجأة وهم يائسون.", "irab": "فتحنا: فعل وفاعل، أبواب: مفعول به، كل: مضاف إليه، مبلسون: خبر مرفوع بالواو." },
    { "id": 45, "text": "فَقُطِعَ دَابِرُ الْقَوْمِ الَّذِينَ ظَلَمُوا ۚ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ", "tafsir": "تم استئصال الظالمين تماماً، والثناء لله وحده الذي نصر رسله وأهلك أعداءه.", "irab": "قطع: مبني للمجهول، دابر: نائب فاعل، الذين: نعت، العالمين: مضاف إليه." },
    { "id": 46, "text": "قُلْ أَرَأَيْتُمْ إِنْ أَخَذَ اللَّهُ سَمْعَكُمْ وَأَبْصَارَكُمْ وَخَتَمَ عَلَىٰ قُلُوبِهِم مَّنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُم بِهِ", "tafsir": "تحدي للمشركين: لو سلب الله حواسكم وختم على قلوبكم، هل من معبود غيره يقدر على ردها؟", "irab": "أرأيتم: فعل وفاعل، الله: فاعل، سمعكم: مفعول به، إله: مبتدأ، غير: نعت." },
    { "id": 47, "text": "قُلْ أَرَأَيْتَكُمْ إِنْ أَتَاكُمْ عَذَابُ اللَّهِ بَغْتَةً أَوْ جَهْرَةً هَلْ يُهْلَكُ إِلَّا الْقَوْمُ الظَّالِمُونَ", "tafsir": "لو جاءكم عذاب الله فجأة أو علانية، فلن ينال الهلاك إلا من ظلم نفسه بالشرك.", "irab": "أتاكم: فعل ومفعول، عذاب: فاعل، يهنك: مضارع مبني للمجهول، الظالمون: نعت." },
    { "id": 48, "text": "وَمَا نُرْسِلُ الْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَ ۖ فَمَنْ آمَنَ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ", "tafsir": "وظيفة الرسل هي التبشير بالجنة والتحذير من النار، والنجاة لمن آمن وأصلح عمله.", "irab": "نرسل: فعل مضارع، المرسلين: مفعول به، مبشرين: حال، خوف: مبتدأ." },
    { "id": 49, "text": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا يَمَسُّهُمُ الْعَذَابُ بِمَا كَانُوا يَفْسُقُونَ", "tafsir": "من جحد بآيات الله وعصى أمره فسيصيبه العذاب بسبب خروجه عن طاعة ربه.", "irab": "الذين: مبتدأ، كذبوا: فعل وفاعل، العذاب: فاعل، يفسقون: مضارع مرفوع." },
    { "id": 50, "text": "قُل لَّا أَقُولُ لَكُمْ عِندِي خَزَائِنُ اللَّهِ وَلَا أَعْلَمُ الْغَيْبَ وَلَا أَقُولُ لَكُمْ إِنِّي مَلَكٌ", "tafsir": "إعلان بشرية النبي ﷺ؛ فهو لا يملك خزائن الرزق ولا يعلم الغيب، بل يتبع ما يوحى إليه فقط.", "irab": "أقول: مضارع، خزائن: مبتدأ مؤخر، الغيب: مفعول به، ملك: خبر إني." },
    { "id": 51, "text": "وَأَنذِرْ بِهِ الَّذِينَ يَخَافُونَ أَن يُحْشَرُوا إِلَىٰ رَبِّهِمْ ۙ لَيْسَ لَهُم مِّن دُونِهِ وَلِيٌّ وَلَا شَفِيعٌ", "tafsir": "الأمر بإنذار من يخشى البعث والوقوف بين يدي الله، فليس لهم ناصر ولا واسطة غيره.", "irab": "أنذر: فعل أمر، الذين: مفعول به، ولي: اسم ليس مؤخر، تتقون: مضارع مرفوع." },
    { "id": 52, "text": "وَلَا تَطْرُدِ الَّذِينَ يَدْعُونَ رَبَّهُم بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ", "tafsir": "النهي عن إبعاد فقراء المؤمنين المخلصين في عبادة الله طلباً لمرضاة صناديد قريش.", "irab": "لا: ناهية، تطرد: مضارع مجزوم، الذين: مفعول به، وجهه: مفعول به." },
    { "id": 53, "text": "وَكَذَٰلِكَ فَتَنَّا بَعْضَهُم بِبَعْضٍ لِّيَقُولُوا أَهَٰؤُلَاءِ مَنَّ اللَّهُ عَلَيْهِم مِّن بَيْنِنَا", "tafsir": "جعل الله بعض الناس اختباراً لبعض، ليختبر المتكبرين بسبق الفقراء للإيمان.", "irab": "فتنا: فعل وفاعل، الله: فاعل، بيننا: اسم مجرور، الشاكرين: اسم مجرور بالياء." },
    { "id": 54, "text": "وَإِذَا جَاءَكَ الَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا فَقُلْ سَلَامٌ عَلَيْكُمْ ۖ كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ الرَّحْمَةَ", "tafsir": "إكرام المؤمنين بالسلام والبشارة برحمة الله التي تسع من تاب من ذنبه وأصلح.", "irab": "جاءك: فعل ومفعول، الذين: فاعل، سلام: مبتدأ، الرحمة: مفعول به." },
    { "id": 55, "text": "وَكَذَٰلِكَ نُفَصِّلُ الْآيَاتِ وَلِتَسْتَبِينَ سَبِيلُ الْمُجْرِمِينَ", "tafsir": "بيان واضح للآيات ليظهر طريق الحق وطريق الباطل بوضوح للمؤمنين.", "irab": "نفصل: مضارع، الآيات: مفعول به، سبيل: فاعل، المجرمين: مضاف إليه." },
    { "id": 56, "text": "قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ الَّذِينَ تَدْعُونَ مِن دُونِ اللَّهِ", "tafsir": "البراءة من عبادة الأوثان واتباع الأهواء، فمن اتبعهم فقد ضل عن طريق الهدى.", "irab": "نهيت: مبني للمجهول والتاء نائب فاعل، أعبد: مضارع منصوب، أهواءهم: مفعول به." },
    { "id": 57, "text": "قُلْ إِنِّي عَلَىٰ بَيِّنَةٍ مِّن رَّبِّي وَكَذَّبْتُم بِهِ ۚ مَا عِندِي مَا تَسْتَعْجِلُونَ بِهِ", "tafsir": "النبي ﷺ على يقين من ربه، والعذاب ليس بيده بل بيد الله الذي يحكم بالعدل.", "irab": "بينة: اسم مجرور، عندي: ظرف، ما: مبتدأ مؤخر، الفاصلين: مضاف إليه بالياء." },
    { "id": 58, "text": "قُل لَّوْ أَنَّ عِندِي مَا تَسْتَعْجِلُونَ بِهِ لَقُضِيَ الْأَمْرُ بَيْنِي وَبَيْنَكُمْ", "tafsir": "لو كان تعجيل العذاب بيد النبي ﷺ لأوقعه بهم، لكن الله أعلم بالوقت المناسب للظالمين.", "irab": "لو: شرطية، عندي: ظرف، الأمر: نائب فاعل، الله: مبتدأ، الظالمين: اسم مجرور." },
    { "id": 59, "text": "۞ وَعِندَهُ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَا إِلَّا هُوَ ۚ وَيَعْلَمُ مَا فِي الْبَرِّ وَالْبَحْرِ", "tafsir": "الله وحده يملك مفاتيح الغيب ويعلم كل شيء في البر والبحر، ولا تسقط ورقة إلا بعلمه.", "irab": "عنده: خبر مقدم، مفاتح: مبتدأ مؤخر، البر: اسم مجرور، مبين: نعت." },
    { "id": 60, "text": "وَهُوَ الَّذِي يَتَوَفَّاكُم بِاللَّيْلِ وَيَعْلَمُ مَا جَرَحْتُم بِالنَّهَارِ ثُمَّ يَبْعَثُكُمْ فِيهِ", "tafsir": "الله هو الذي ينيمكم بالليل ويعلم أعمالكم بالنهار، ثم يوقظكم لتكملوا آجالكم ثم ترجعون إليه.", "irab": "يتوفاكم: مضارع مرفوع، ما: مفعول به، أجل: فاعل، مسمى: نعت." }
    { "id": 61, "text": "وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِ ۖ وَيُرْسِلُ عَلَيْكُمْ حَفَظَةً حَتَّىٰ إِذَا جَاءَ أَحَدَكُمُ الْمَوْتُ تَوَفَّتْهُ رُسُلُنَا", "tafsir": "الله هو الغالب المتصرف في خلقه، يرسل ملائكة تحصي أعمالكم، حتى إذا دنا الأجل قبضت الرسل روحه بلا تقصير.", "irab": "هو: مبتدأ، القاهر: خبر، حفظة: مفعول به، الموت: فاعل، رُسلنا: فاعل." },
    { "id": 62, "text": "ثُمَّ رُدُّوا إِلَى اللَّهِ مَوْلَاهُمُ الْحَقِّ ۚ أَلَا لَهُ الْحُكْمُ وَهُوَ أَسْرَعُ الْحَاسِبِينَ", "tafsir": "ثم يرجع العباد إلى الله الحاكم العادل ليحاسبهم، وله وحده القضاء وهو الأسرع في الحساب.", "irab": "رُدّوا: مبني للمجهول، الله: اسم مجرور، الحق: نعت، الحكم: مبتدأ مؤخر، الحاسبين: مضاف إليه." },
    { "id": 63, "text": "قُلْ مَن يُنَجِّيكُم مِّن ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ تَدْعُونَهُ تَضَرُّعًا وَخُفْيَةً", "tafsir": "من الذي يخلصكم من مخاوف البر والبحر حين تنادونه بذل وخفاء واعدين بالشكر إن نجوتم؟", "irab": "مَن: اسم استفهام مبتدأ، تضرعاً: حال أو مفعول لأجله، الشاكرين: اسم مجرور بالياء." },
    { "id": 64, "text": "قُلِ اللَّهُ يُنَجِّيكُم مِّنْهَا وَمِن كُلِّ كَرْبٍ ثُمَّ أَنتُمْ تُشْرِكُونَ", "tafsir": "الله وحده هو الذي يخلصكم من هذه المخاوف ومن كل ضيق، ومع ذلك تعودون للإشراك به.", "irab": "الله: مبتدأ، ينجيكم: مضارع مرفوع، كرب: اسم مجرور، تشركون: مضارع مرفوع." },
    { "id": 65, "text": "قُلْ هُوَ الْقَادِرُ عَلَىٰ أَن يَبْعَثَ عَلَيْكُمْ عَذَابًا مِّن فَوْقِكُمْ أَوْ مِن تَحْتِ أَرْجُلِكُمْ", "tafsir": "الله قادر على إرسال العذاب من السماء أو الأرض أو بجعلكم فرقاً يذيق بعضكم بأس بعض.", "irab": "هو: مبتدأ، القادر: خبر، عذاباً: مفعول به، شيعاً: حال، يفقهون: مضارع مرفوع." },
    { "id": 66, "text": "وَكَذَّبَ بِهِ قَوْمُكَ وَهُوَ الْحَقُّ ۚ قُل لَّسْتُ عَلَيْكُم بِوَكِيلٍ", "tafsir": "كذبت قريش بالقرآن وهو الحق الثابت، فقل لهم: لست حفيظاً عليكم ولا مسؤولاً عن أعمالكم.", "irab": "كذب: فعل، قومك: فاعل، الحق: خبر، بوكيل: الباء زائدة ووكيل خبر ليس مجرور لفظاً." },
    { "id": 67, "text": "لِّكُلِّ نَبَإٍ مُّسْتَقَرٌّ ۚ وَسَوْفَ تَعْلَمُونَ", "tafsir": "لكل خبر أو وعيد وقت محدد يقع فيه لا يتخلف، وسوف تعرفون عاقبة تكذيبكم.", "irab": "لكل: خبر مقدم، نبأ: مضاف إليه، مستقر: مبتدأ مؤخر، تعلمون: مضارع مرفوع." },
    { "id": 68, "text": "وَإِذَا رَأَيْتَ الَّذِينَ يَخُوضُونَ فِي آيَاتِنَا فَأَعْرِضْ عَنْهُمْ حَتَّىٰ يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ", "tafsir": "إذا رأيت المستهزئين بآيات الله فاترك مجالسهم حتى يغيروا حديثهم، ولا تجلس مع الظالمين إن نسيت.", "irab": "رأيت: فعل وفاعل، الذين: مفعول به، أعرض: فعل أمر، الظالمين: مضاف إليه." },
    { "id": 69, "text": "وَمَا عَلَى الَّذِينَ يَتَّقُونَ مِنْ حِسَابِهِم مِّن شَيْءٍ وَلَٰكِن ذِكْرَىٰ لَعَلَّهُمْ يَتَّقُونَ", "tafsir": "ليس على المتقين إثم من خوض هؤلاء، ولكن عليهم نصحهم وتذكيرهم لعلهم يحذرون الله.", "irab": "الذين: اسم مجرور، حسابهم: اسم مجرور، ذكرى: مبتدأ مؤخر، يتقون: مضارع مرفوع." },
    { "id": 70, "text": "وَذَرِ الَّذِينَ اتَّخَذُوا دِينَهُمْ لَعِبًا وَلَهْوًا وَغَرَّتْهُمُ الْحَيَاةُ الدُّنْيَا", "tafsir": "اترك الذين استهانوا بالدين وانخدعوا بالدنيا، وذكّر بالقرآن لئلا تهلك نفس بما كسبت من المعاصي.", "irab": "ذر: فعل أمر، دينهم: مفعول به أول، لعباً: مفعول به ثانٍ، أليم: نعت." },
    { "id": 71, "text": "قُلْ أَنَدْعُو مِن دُونِ اللَّهِ مَا لَا يَنفَعُنَا وَلَا يَضُرُّنَا وَنُرَدُّ عَلَىٰ أَعْقَابِنَا بَعْدَ إِذْ هَدَانَا اللَّهُ", "tafsir": "إنكار عبادة الأوثان بعد الهداية للإسلام، فمن فعل ذلك كان كالحيران الذي ضل طريقه في الصحراء.", "irab": "أندعو: همزة استفهام ومضارع، الله: مضاف إليه، ما: مفعول به، الله: فاعل." },
    { "id": 72, "text": "وَأَنْ أَقِيمُوا الصَّلَاةَ وَاتَّقُوهُ ۚ وَهُوَ الَّذِي إِلَيْهِ تُحْشَرُونَ", "tafsir": "الأمر بالمحافظة على الصلاة وخشية الله وحده، فهو الذي ستجمعون إليه يوم القيامة للحساب.", "irab": "أقيموا: فعل أمر، الصلاة: مفعول به، هو: مبتدأ، تحشرون: مضارع مبني للمجهول." },
    { "id": 73, "text": "وَهُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۖ وَيَوْمَ يَقُولُ كُن فَيَكُونُ", "tafsir": "الله خلق الكون بالحكمة، وأمره نافذ بكلمة 'كن'، وهو عالم الغيب والشهادة الحكيم الخبير.", "irab": "هو: مبتدأ، السماوات: مفعول به بالكسرة، يوم: ظرف، يكون: مضارع تام." },
    { "id": 74, "text": "وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ آزَرَ أَتَتَّخِذُ أَصْنَامًا آلِهَةً ۖ إِنِّي أَرَاكَ وَقَوْمَكَ فِي ضَلَالٍ مُّبِينٍ", "tafsir": "بداية قصة إبراهيم عليه السلام وإنكاره على أبيه وقومه عبادة الأصنام ووصفهم بالضلال الواضح.", "irab": "إبراهيم: فاعل، آزر: بدل، أصناماً: مفعول به أول، آلهة: مفعول به ثانٍ، مبين: نعت." },
    { "id": 75, "text": "وَكَذَٰلِكَ نُرِي إِبْرَاهِيمَ مَلَكُوتَ السَّمَاوَاتِ وَالْأَرْضِ وَلِيَكُونَ مِنَ الْمُوقِنِينَ", "tafsir": "أطلع الله إبراهيم على عظيم صنعه في الكون ليزداد يقيناً وثباتاً على التوحيد.", "irab": "نري: مضارع مرفوع، إبراهيم: مفعول به أول، ملكوت: مفعول به ثانٍ، الموقنين: اسم مجرور بالياء." },
    { "id": 76, "text": "فَلَمَّا جَنَّ عَلَيْهِ اللَّيْلُ رَأَىٰ كَوْكَبًا ۖ قَالَ هَٰذَا رَبِّي ۖ فَلَمَّا أَفَلَ قَالَ لَا أُحِبُّ الْآفِلِينَ", "tafsir": "بدأ إبراهيم يحاج قومه؛ فرأى كوكباً ثم غاب، فقال: لا يمكن للمعبود أن يغيب ويختفي.", "irab": "الليل: فاعل، كوكباً: مفعول به، هذا: مبتدأ، ربي: خبر، الآفلين: مفعول به بالياء." },
    { "id": 77, "text": "فَلَمَّا رَأَى الْقَمَرَ بَازِغًا قَالَ هَٰذَا رَبِّي ۖ فَلَمَّا أَفَلَ قَالَ لَئِن لَّمْ يَهْدِنِي رَبِّي لَأَكُونَنَّ مِنَ الْقَوْمِ الضَّالِّينَ", "tafsir": "رأى القمر بازغاً فاستبعد ألوهيته لغيابه، وأقر بحاجته لهداية الله لئلا يكون من الضالين.", "irab": "القمر: مفعول به، بازغاً: حال، يهدي: مضارع مجزوم، الضالين: نعت مجرور بالياء." },
    { "id": 78, "text": "فَلَمَّا رَأَى الشَّمْسَ بَازِغَةً قَالَ هَٰذَا رَبِّي هَٰذَا أَكْبَرُ ۖ فَلَمَّا أَفَلَتْ قَالَ يَا قَوْمِ إِنِّي بَرِيءٌ مِّمَّا تُشْرِكُونَ", "tafsir": "رأى الشمس أكبرهم فلما غابت أعلن براءته من عبادة كل ما يغيب ويشرك مع الله.", "irab": "الشمس: مفعول به، بازغة: حال، أكبر: خبر، بريء: خبر إني، تشركون: مضارع مرفوع." },
    { "id": 79, "text": "إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا ۖ وَمَا أَنَا مِنَ الْمُشْرِكِينَ", "tafsir": "إعلان إبراهيم إخلاص العبادة لله خالق الكون وحده، مائلاً عن الشرك ومبتعداً عن المشركين.", "irab": "وجهت: فعل وفاعل، وجهي: مفعول به، حنيفاً: حال، المشركين: اسم مجرور بالياء." },
    { "id": 80, "text": "وَحَاجَّهُ قَوْمُهُ ۚ قَالَ أَتُحَاجُّونِّي فِي اللَّهِ وَقَدْ هَدَانِ ۚ وَلَا أَخَافُ مَا تُشْرِكُونَ بِهِ", "tafsir": "جادل قوم إبراهيم نبيهم، فرد عليهم بقوة إيمانه: كيف تجادلونني في الله وقد هداني؟ ولا أخشى أصنامكم.", "irab": "حاجّه: فعل ومفعول، قومه: فاعل، الله: اسم مجرور، تشركون: مضارع مرفوع." }
    { "id": 81, "text": "وَكَيْفَ أَخَافُ مَا أَشْرَكْتُمْ وَلَا تَخَافُونَ أَنَّكُمْ أَشْرَكْتُم بِاللَّهِ مَا لَمْ يُنَزِّلْ بِهِ عَلَيْكُمْ سُلْطَانًا", "tafsir": "رد إبراهيم على تهديد قومه: كيف أخشى أصنامكم وأنتم لا تخشون الله الذي أشركتم به بلا دليل؟", "irab": "كيف: اسم استفهام، أخاف: مضارع مرفوع، سلطاناً: مفعول به، الأمن: مضاف إليه." },
    { "id": 82, "text": "الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُم بِظُلْمٍ أُولَٰئِكَ لَهُمُ الْأَمْنُ وَهُم مُّهْتَدُونَ", "tafsir": "المؤمنون الذين لم يخلطوا إيمانهم بشرك هم وحدهم الآمنون من عذاب الله والمهتدون للحق.", "irab": "الذين: مبتدأ، إيمانهم: مفعول به، أولئك: مبتدأ ثانٍ، الأمن: خبر المبتدأ الثاني." },
    { "id": 83, "text": "وَتِلْكَ حُجَّتُنَا آتَيْنَاهَا إِبْرَاهِيمَ عَلَىٰ قَوْمِهِ ۚ نَرْفَعُ دَرَجَاتٍ مَّن نَّشَاءُ", "tafsir": "هذه الحجة القوية أعطاها الله لإبراهيم ليغلب بها قومه، والله يرفع من يشاء بالعلم والحكمة.", "irab": "تلك: مبتدأ، حجتنا: خبر، إبراهيم: مفعول به ثانٍ، درجات: مفعول به ثانٍ." },
    { "id": 84, "text": "وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ ۚ كُلًّا هَدَيْنَا ۚ وَنُوحًا هَدَيْنَا مِن قَبْلُ", "tafsir": "منة الله على إبراهيم بذرية صالحة من الأنبياء، وتذكير بهداية نوح وذريته من المحسنين.", "irab": "وهبنا: فعل وفاعل، إسحاق: مفعول به، كلاً: مفعول به مقدم، المحسنين: مضاف إليه." },
    { "id": 85, "text": "وَزَكَرِيَّا وَيَحْيَىٰ وَعِيسَىٰ وَإِلْيَاسَ ۖ كُلٌّ مِّنَ الصَّالِحِينَ", "tafsir": "ذكر لمجموعة أخرى من الأنبياء الكرام، وكلهم كانوا من أهل الصلاح والتقوى.", "irab": "زكريا: معطوف منصوب، كل: مبتدأ، الصالحين: اسم مجرور بالياء." },
    { "id": 86, "text": "وَإِسْمَاعِيلَ وَالْيَسَعَ وَيُونُسَ وَلُوطًا ۚ وَكُلًّا فَضَّلْنَا عَلَى الْعَالَمِينَ", "tafsir": "تكملة لأسماء الأنبياء الذين اصطفاهم الله وفضلهم على أهل زمانهم بالرسالة.", "irab": "إسماعيل: معطوف، كلاً: مفعول به مقدم، العالمين: اسم مجرور بالياء." },
    { "id": 87, "text": "وَمِنْ آبَائِهِمْ وَذُرِّيَّاتِهِمْ وَإِخْوَانِهِمْ ۖ وَاجْتَبَيْنَاهُمْ وَهَدَيْنَاهُمْ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ", "tafsir": "اصطفى الله أيضاً من آباء هؤلاء الأنبياء وذرياتهم، وأرشدهم جميعاً لطريق الحق.", "irab": "آبائهم: اسم مجرور، اجتبيناهم: فعل وفاعل ومفعول، مستقيم: نعت." },
    { "id": 88, "text": "ذَٰلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَن يَشَاءُ مِنْ عِبَادِهِ ۚ وَلَوْ أَشْرَكُوا لَحَبِطَ عَنْهُمْ مَا كَانُوا يَعْمَلُونَ", "tafsir": "هذا هو طريق الله الموصل لرضاه، ولو أشرك هؤلاء الأنبياء (فرضاً) لبطلت أعمالهم جميعاً.", "irab": "ذلك: مبتدأ، هدى: خبر، مَن: مفعول به، يعملون: مضارع مرفوع." },
    { "id": 89, "text": "أُولَٰئِكَ الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ وَالْحُكْمَ وَالنُّبُوَّةَ ۚ فَإِن يَكْفُرْ بِهَا هَٰؤُلَاءِ", "tafsir": "هؤلاء هم أهل الوحي والحكمة، فإن كفر أهل مكة بدعوتك فقد وكلنا بها قوماً مؤمنين ثابتين.", "irab": "أولئك: مبتدأ، الكتاب: مفعول به ثانٍ، هؤلاء: فاعل، بكافرين: خبر مجرور لفظاً." },
    { "id": 90, "text": "أُولَٰئِكَ الَّذِينَ هَدَى اللَّهُ ۖ فَبِهُدَاهُمُ اقْتَدِهْ ۗ قُل لَّا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا", "tafsir": "أمر للنبي ﷺ باتباع نهج الأنبياء في التوحيد، والتأكيد أن الرسالة تذكرة للعالمين بلا مقابل.", "irab": "الذين: خبر، اقتده: فعل أمر، أجراً: مفعول به ثانٍ، العالمين: مضاف إليه." },
    { "id": 91, "text": "وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ إِذْ قَالُوا مَا أَنزَلَ اللَّهُ عَلَىٰ بَشَرٍ مِّن شَيْءٍ", "tafsir": "المشركون لم يعظموا الله حق تعظيمه حين أنكروا الوحي، والرد عليهم بكتاب موسى الذي يعرفونه.", "irab": "قدروا: فعل وفاعل، الله: مفعول به، شيء: اسم مجرور، خبيراً: خبر." },
    { "id": 92, "text": "وَهَٰذَا كِتَابٌ أَنزَلْنَاهُ مُبَارَكٌ مُّصَدِّقُ الَّذِي بَيْنَ يَدَيْهِ وَلِتُنذِرَ أُمَّ الْقُرَىٰ", "tafsir": "القرآن كتاب مبارك يصدق الكتب السابقة، نزل لينذر أهل مكة ومن حولها بيوم الحساب.", "irab": "هذا: مبتدأ، كتاب: خبر، مبارك: نعت، أم: مفعول به، يحافظون: مضارع مرفوع." },
    { "id": 93, "text": "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ قَالَ أُوحِيَ إِلَيَّ وَلَمْ يُوحَ إِلَيْهِ شَيْءٌ", "tafsir": "وعيد شديد لمن ادعى النبوة كذباً؛ فمصيرهم عذاب الهون وسكرات الموت حين تضربهم الملائكة.", "irab": "مَن: مبتدأ، كذباً: مفعول به، الملائكة: مبتدأ، أيديكم: مفعول به، الهون: مضاف إليه." },
    { "id": 94, "text": "وَلَقَدْ جِئْتُمُونَا فُرَادَىٰ كَمَا خَلَقْنَاكُمْ أَوَّلَ مَرَّةٍ وَتَرَكْتُم مَّا خَوَّلْنَاكُمْ وَرَاءَ ظُهُورِكُمْ", "tafsir": "خطاب للكفار عند الموت: جئتم للحساب وحدكم بلا مال ولا أعوان، وانقطع أملكم في الشفعاء.", "irab": "جئتمونا: فعل وفاعل ومفعول، فرادى: حال، ما: مفعول به، شركاء: خبر." },
    { "id": 95, "text": "۞ إِنَّ اللَّهَ فَالِقُ الْحَبِّ وَالنَّوَىٰ ۖ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَمُخْرِجُ الْمَيِّتِ مِنَ الْحَيِّ", "tafsir": "قدرة الله في شق الحب والنوى لإنبات الزرع، وإخراج الكائن الحي من النطفة الميتة والعكس.", "irab": "الله: اسم إن، فالق: خبر إن، الحي: مفعول به، تؤفكون: مضارع مبني للمجهول." },
    { "id": 96, "text": "فَالِقُ الْإِصْبَاحِ وَجَعَلَ اللَّيْلَ سَكَنًا وَالشَّمْسَ وَالْقَمَرَ حُسْبَانًا", "tafsir": "الله يشق ضياء الفجر من ظلمة الليل، وجعل الليل للراحة والشمس والقمر لمعرفة الوقت بحساب دقيق.", "irab": "فالق: خبر ثانٍ، الليل: مفعول به أول، سكناً: مفعول به ثانٍ، العزيز: مضاف إليه." },
    { "id": 97, "text": "وَهُوَ الَّذِي جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ", "tafsir": "من نعمه جعل النجوم علامات للمسافرين في البر والبحر، تفصيلاً للآيات لأهل العلم.", "irab": "هو: مبتدأ، النجوم: مفعول به، ظلمات: اسم مجرور، يعلمون: مضارع مرفوع." },
    { "id": 98, "text": "وَهُوَ الَّذِي أَنشَأَكُم مِّن نَّفْسٍ وَاحِدَةٍ فَمُسْتَقَرٌّ وَمُسْتَوْدَعٌ", "tafsir": "خلق البشر جميعاً من آدم، وجعل لهم مكاناً للاستقرار في الدنيا أو الأرحام ومستودعاً في القبور.", "irab": "أنشأكم: فعل وفاعل ومفعول، نفس: اسم مجرور، مستقر: مبتدأ مؤخر، يفقهون: مضارع مرفوع." },
    { "id": 99, "text": "وَهُوَ الَّذِي أَنزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ نَبَاتَ كُلِّ شَيْءٍ", "tafsir": "نظام الري الإلهي بإنزال المطر لإخراج كل أنواع الزروع والثمار المبهجة، علامة للمؤمنين.", "irab": "أنزل: فعل، ماءً: مفعول به، نبات: مفعول به، الثمر: اسم مجرور، يؤمنون: مضارع مرفوع." },
    { "id": 100, "text": "وَجَعَلُوا لِلَّهِ شُرَكَاءَ الْجِنَّ وَخَلَقَهُمْ ۖ وَخَرَقُوا لَهُ بَنِينَ وَبَنَاتٍ بِغَيْرِ عِلْمٍ", "tafsir": "ضلال المشركين بجعل الجن شركاء لله وافتراء البنين والبنات عليه كذباً، سبحانه عما يصفون.", "irab": "جعلوا: فعل وفاعل، لله: مفعول ثانٍ، الجن: مفعول أول، بنين: مفعول به، يصفون: مضارع مرفوع." }
    { "id": 101, "text": "بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ ۖ أَنَّىٰ يَكُونُ لَهُ وَلَدٌ وَلَمْ تَكُن لَّهُ صَاحِبَةٌ", "tafsir": "الله هو موجد الكون على غير مثال سابق، فكيف يكون له ولد وهو المنزه عن الزوجة وخالق كل شيء؟", "irab": "بديع: خبر لمبتدأ محذوف، السماوات: مضاف إليه، ولد: اسم يكون مؤخر، عليم: خبر ثانٍ." },
    { "id": 102, "text": "ذَٰلِكُمُ اللَّهُ رَبُّكُمْ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ خَالِقُ كُلِّ شَيْءٍ فَاعْبُدُوهُ", "tafsir": "هذا هو الله ربكم المتفرد بالألوهية وخلق كل شيء، فاستحق العبادة وحده وهو الحفيظ على خلقه.", "irab": "ذلكم: مبتدأ، الله: خبر، خالق: خبر ثانٍ، اعبدوه: فعل أمر وفاعل ومفعول، وكيل: خبر." },
    { "id": 103, "text": "لَّا تُدْرِكُهُ الْأَبْصَارُ وَهُوَ يُدْرِكُ الْأَبْصَارَ ۖ وَهُوَ اللَّطِيفُ الْخَبِيرُ", "tafsir": "الله لا تحيط به الأبصار لعظمته، بينما هو يحيط بكل خلقه، وهو اللطيف بعباده الخبير بأحوالهم.", "irab": "الأبصار: فاعل، هو: مبتدأ، اللطيف: خبر، الخبير: خبر ثانٍ." },
    { "id": 104, "text": "قَدْ جَاءَكُم بَصَائِرُ مِن رَّبِّكُمْ ۖ فَمَنْ أَبْصَرَ فَلِنَفْسِهِ ۖ وَمَنْ عَمِيَ فَعَلَيْهَا", "tafsir": "جاءتكم البراهين الواضحة؛ فمن اهتدى نفع نفسه، ومن أعرض ضرها، والرسول ليس رقيباً عليكم.", "irab": "بصائر: فاعل، مَن: اسم شرط مبتدأ، نفسه: اسم مجرور، حفيظاً: خبر مجرور لفظاً." },
    { "id": 105, "text": "وَكَذَٰلِكَ نُصَرِّفُ الْآيَاتِ وَلِيَقُولُوا دَرَسْتَ وَلِنُبَيِّنَهُ لِقَوْمٍ يَعْلَمُونَ", "tafsir": "نوعنا الحجج لتقوم الحجة على المعاندين الذين يدعون أنك تعلمت، ولنوضح الحق لأهل العلم.", "irab": "نصرف: مضارع، الآيات: مفعول به، قوم: اسم مجرور، يعلمون: مضارع مرفوع." },
    { "id": 106, "text": "اتَّبِعْ مَا أُوحِيَ إِلَيْكَ مِن رَّبِّكَ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ وَأَعْرِضْ عَنِ الْمُشْرِكِينَ", "tafsir": "أمر للنبي ﷺ بالتمسك بالوحي والتوحيد، وعدم الالتفات لمجادلات المشركين.", "irab": "اتبع: فعل أمر، ما: مفعول به، الله: مبتدأ، أعرض: فعل أمر، المشركين: اسم مجرور بالياء." },
    { "id": 107, "text": "وَلَوْ شَاءَ اللَّهُ مَا أَشْرَكُوا ۗ وَمَا جَعَلْنَاكَ عَلَيْهِمْ حَفِيظًا ۖ وَمَا أَنتَ عَلَيْهِم بِوَكِيلٍ", "tafsir": "لو أراد الله لجبرهم على الإيمان، لكنه جعلهم مخيرين، وأنت لست مسؤولاً عن كفرهم.", "irab": "الله: فاعل، حفيظاً: مفعول به ثانٍ، أنت: مبتدأ، بوكيل: خبر مجرور لفظاً." },
    { "id": 108, "text": "وَلَا تَسُبُّوا الَّذِينَ يَدْعُونَ مِن دُونِ اللَّهِ فَيَسُبُّوا اللَّهَ عَدْوًا بِغَيْرِ علم", "tafsir": "النهي عن سب آلهة المشركين لئلا يردوا بسب الله جهلاً، فلكل أمة عملهم والحساب على الله.", "irab": "لا: ناهية، تسبوا: مضارع مجزوم، الله: مفعول به، عدواً: مفعول لأجله، يعملون: مضارع." },
    { "id": 109, "text": "وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِن جَاءَتْهُمْ آيَةٌ لَّيُؤْمِنُنَّ بِهَا", "tafsir": "حلف المشركون بصدق المعجزات، والرد أن المعجزات بيد الله، وما يدرى المؤمنين أنهم لن يؤمنوا لو جاءت.", "irab": "الله: اسم مجرور، آية: فاعل، يؤمنن: مضارع مبني على الفتح، يشعركم: مضارع مرفوع." },
    { "id": 110, "text": "وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ", "tafsir": "عقوبة الله لهم بصرف قلوبهم عن الحق كما رفضوه أول مرة، وتركهم في ضلالهم يتخبطون.", "irab": "نقلب: مضارع، أفئدتهم: مفعول به، يعمهون: مضارع مرفوع." },
    { "id": 111, "text": "۞ وَلَوْ أَنَّنَا نَزَّلْنَا إِلَيْهِمُ الْمَلَائِكَةَ وَكَلَّمَهُمُ الْمَوْتَىٰ وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَيْءٍ قُبُلًا", "tafsir": "لو تحققت كل معجزاتهم برؤية الملائكة وسماع الموتى ما آمنوا إلا بمشيئة الله لشدة عنادهم.", "irab": "نزلنا: فعل وفاعل، الملائكة: مفعول به، الموتى: فاعل، يجهلون: مضارع مرفوع." },
    { "id": 112, "text": "وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا شَيَاطِينَ الْإِنسِ وَالْجِنِّ يُوحِي بَعْضُهُمْ إِلَىٰ بَعْضٍ", "tafsir": "سنة الله بوجود أعداء للأنبياء من شياطين الجن والإنس يزينون الباطل بالقول الخادع.", "irab": "جعلنا: فعل وفاعل، عدواً: مفعول به ثانٍ، شياطين: مفعول به أول، غروراً: مفعول به ثانٍ." },
    { "id": 113, "text": "وَلِتَصْغَىٰ إِلَيْهِ أَفْئِدَةُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ وَلِيَرْضَوْهُ", "tafsir": "هذا القول الخادع تميل إليه قلوب الكفار ليرضوه ويستمروا في ارتكاب المعاصي.", "irab": "لتصغى: مضارع منصوب، أفئدة: فاعل، الآخرة: اسم مجرور، مقترفون: خبر مرفوع." },
    { "id": 114, "text": "أَفَغَيْرَ اللَّهِ أَبْتَغِي حَكَمًا وَهُوَ الَّذِي أَنزَلَ إِلَيْكُمُ الْكِتَابَ مُفَصَّلًا", "tafsir": "كيف أطلب غير الله حكماً وقد أنزل القرآن مفصلاً؟ وأهل الكتاب يعلمون صدقه فلا تشك في ذلك.", "irab": "غير: مفعول به مقدم، حكماً: تمييز، الكتاب: مفعول به، الممترين: اسم مجرور بالياء." },
    { "id": 115, "text": "وَتَمَّتْ كَلِمَتُ رَبِّكَ صِدْقًا وَعَدْلًا ۚ لَّا مُبَدِّلَ لِكَلِمَاتِهِ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ", "tafsir": "كلمات الله كاملة في صدق الخبر وعدل الأحكام، ولا مغير لشرعه وقدره.", "irab": "تمت: فعل، كلمة: فاعل، صدقاً: تمييز، مبدل: اسم لا، العليم: خبر ثانٍ." },
    { "id": 116, "text": "وَإِن تُطِعْ أَكْثَرَ مَن فِي الْأَرْضِ يُضِلُّوكَ عَن سَبِيلِ اللَّهِ", "tafsir": "تحذير من اتباع الكثرة في الضلال؛ فهم يتبعون الظنون والأكاذيب لا الحق.", "irab": "تطع: فعل الشرط، أكثر: مفعول به، يضلوك: جواب الشرط، يخرصون: مضارع مرفوع." },
    { "id": 117, "text": "إِنَّ رَبَّكَ هُوَ أَعْلَمُ مَن يَضِلُّ عَن سَبِيلِهِ ۖ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ", "tafsir": "الله هو العالم الحقيقي بمن انحرف عن طريقه وبمن استقام عليه.", "irab": "ربك: اسم إن، هو: ضمير فصل، أعلم: خبر إن، المهتدين: اسم مجرور بالياء." },
    { "id": 118, "text": "فَكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ إِن كُنتُم بِآيَاتِهِ مُؤْمِنِينَ", "tafsir": "إباحة أكل ما ذبح وذكر اسم الله عليه علامة على الإيمان الصادق بآياته.", "irab": "كلوا: فعل أمر، اسم: نائب فاعل، الله: مضاف إليه، مؤمنين: خبر كنتم." },
    { "id": 119, "text": "وَمَا لَكُمْ أَلَّا تَأْكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ وَقَدْ فَصَّلَ لَكُم مَّا حَرَّمَ عَلَيْكُمْ", "tafsir": "لا عذر في ترك الأكل مما ذكر اسم الله عليه، فالمحرمات بينة، والتحذير من المضلين بأهوائهم.", "irab": "تأكلوا: مضارع منصوب، ما: مفعول به، اعتداء: مضاف إليه، المعتدين: مفعول به." },
    { "id": 120, "text": "وَذَرُوا ظَاهِرَ الْإِثْمِ وَبَاطِنَهُ ۚ إِنَّ الَّذِينَ يَكْسِبُونَ الْإِثْمَ سَيُجْزَوْنَ بِمَا كَانُوا يَقْتَرِفُونَ", "tafsir": "الأمر بترك جميع المعاصي ما ظهر منها وما خفي، والوعيد بالعقاب لكل من كسب الإثم.", "irab": "ذروا: فعل أمر، الإثم: مضاف إليه، الذين: اسم إن، يقترفون: مضارع مرفوع." }
    { "id": 121, "text": "وَلَا تَأْكُلُوا مِمَّا لَمْ يُذْكَرَ اسْمُ اللَّهِ عَلَيْهِ وَإِنَّهُ لَفِسْقٌ", "tafsir": "النهي عن أكل ما ذبح ولم يذكر اسم الله عليه، والتحذير من اتباع وسوسة الشياطين في الجدال بالباطل.", "irab": "لا: ناهية، تأكلوا: مضارع مجزوم، اسم: نائب فاعل، فسق: خبر إن، المشركين: خبر." },
    { "id": 122, "text": "أَوَمَن كَانَ مَيْتًا فَأَحْيَيْنَاهُ وَجَعَلْنَا لَهُ نُورًا يَمْشِي بِهِ فِي النَّاسِ", "tafsir": "مقارنة بين المؤمن الذي أحيا الله قلبه بالإيمان وجعل له نوراً، وبين الكافر المتخبط في ظلمات لا يخرج منها.", "irab": "مَن: مبتدأ، ميتاً: خبر كان، نوراً: مفعول به ثانٍ، الكافرين: اسم مجرور بالياء." },
    { "id": 123, "text": "وَكَذَٰلِكَ جَعَلْنَا فِي كُلِّ قَرْيَةٍ أَكَابِرَ مُجْرِمِيهَا لِيَمْكُرُوا فِيهَا", "tafsir": "سنة الله في وجود زعماء للضلال يمكرون، لكن مكرهم يرتد عليهم وحدهم وهم لا يشعرون.", "irاب": "جعلنا: فعل وفاعل، أكابر: مفعول به، مجرميها: مضاف إليه، أنفسهم: مفعول به." },
    { "id": 124, "text": "وَإِذَا جَاءَتْهُمْ آيَةٌ قَالُوا لَن نُّؤْمِنَ حَتَّىٰ نُؤْتَىٰ مِثْلَ مَا أُوتِيَ رُسُلُ اللَّهِ", "tafsir": "تعنت الكفار بطلب معجزات خاصة كرسل الله، والله أعلم بمن يستحق الرسالة، وسينالهم الصغار والعذاب.", "irab": "آية: فاعل، نؤمن: مضارع منصوب، الله: فاعل، صغار: مبتدأ مؤخر، يمكرون: مضارع." },
    { "id": 125, "text": "فَمَن يُرِدِ اللَّهَ أَن يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلَامِ", "tafsir": "من أراد الله هدايته وسع صدره للإيمان، ومن أراد ضلاله ضاق صدره عن الحق كمن يصعد في السماء.", "irab": "مَن: اسم شرط، يرد: فعل الشرط، صدره: مفعول به، ضيقاً: خبر ثانٍ، يتذكرون: مضارع." },
    { "id": 126, "text": "وَهَٰذَا صِرَاطُ رَبِّكَ مُسْتَقِيمًا ۗ قَدْ فَصَّلْنَا الْآيَاتِ لِقَوْمٍ يَذَّكَّرُونَ", "tafsir": "هذا الدين هو الطريق المستقيم، وقد وضح الله معالمه لمن أراد الاتعاظ والتذكر.", "irab": "هذا: مبتدأ، صراط: خبر، مستقيماً: حال، الآيات: مفعول به، يذكرون: مضارع." },
    { "id": 127, "text": "۞ لَهُمْ دَارُ السَّلَامِ عِندَ رَبِّهِمْ ۖ وَهُوَ وَلِيُّهُم بِمَا كَانُوا يَعْمَلُونَ", "tafsir": "جزاء المهتدين الجنة (دار السلام)، والله هو ناصرهم وحافظهم بسبب أعمالهم الصالحة.", "irab": "لهم: خبر مقدم، دار: مبتدأ مؤخر، ربهِم: مضاف إليه، وليُّهم: خبر، يعملون: مضارع." },
    { "id": 128, "text": "وَيَوْمَ يَحْشُرُهُمْ جَمِيعًا يَا مَعْشَرَ الْجِنِّ قَدِ اسْتَكْثَرْتُم مِّنَ الْإِنسِ", "tafsir": "يوم الحساب يخاطب الله الجن بضلالهم للإنس، واعتراف الإنس بتبادل المصالح الزائلة، ومأواهم النار جميعاً.", "irab": "يوم: ظرف زمان، الجن: مضاف إليه، النار: مبتدأ، حكيم: خبر، عليم: خبر ثانٍ." },
    { "id": 129, "text": "وَكَذَٰلِكَ نُوَلِّي بَعْضَ الظَّالِمِينَ بَعْضًا بِمَا كَانُوا يَكْسِبُونَ", "tafsir": "سنة الله في تسليط الظلمة بعضهم على بعض بسبب ما جنوه من معاصي وظلم.", "irab": "نولي: مضارع، بعض: مفعول به أول، بعضاً: مفعول به ثانٍ، يكسبون: مضارع." },
    { "id": 130, "text": "يَا مَعْشَرَ الْجِنِّ وَالْإِنسِ أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنكُمْ يَقُصُّونَ عَلَيْكُمْ آيَاتِي", "tafsir": "إقامة الحجة على الثقلين بإرسال الرسل، واعترافهم بتبليغ الحق وغرور الدنيا لهم وكفرهم.", "irab": "معشر: منادى، رسل: فاعل، آياتي: مفعول به، الدنيا: فاعل، كافرين: خبر كانوا." },
    { "id": 131, "text": "ذَٰلِكَ أَن لَّمْ يَكُن رَّبُّكَ مُهْلِكَ الْقُرَىٰ بِظُلْمٍ وَأَهْلُهَا غَافِلُونَ", "tafsir": "الله لا يهلك الأمم بظلمها إلا بعد إنذارها بالرسل لئلا يكونوا غافلين عن الحق.", "irab": "ربك: اسم يكن، مهلك: خبر يكن، القرى: مضاف إليه، غافلون: خبر المبتدأ (أهلها)." },
    { "id": 132, "text": "وَلِكُلٍّ دَرَجَاتٌ مِّمَّا عَمِلُوا ۚ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا يَعْمَلُونَ", "tafsir": "لكل عامل من مؤمن وكافر رتبة بحسب عمله، والله مطلع على كل التفاصيل.", "irab": "درجات: مبتدأ مؤخر، ربك: مبتدأ، بغافل: الباء زائدة وغافل خبر مجرور لفظاً." },
    { "id": 133, "text": "وَرَبُّكَ الْغَنِيُّ ذُو الرَّحْمَةِ ۚ إِن يَشَأْ يُذْهِبْكُمْ وَيَسْتَخْلِفْ مِن بَعْدِكُم مَّا يَشَاءُ", "tafsir": "الله هو الغني الرحيم، قادر على إفناء البشر واستخلاف غيرهم كما أوجدكم من نسل آخرين.", "irab": "ربك: مبتدأ، الغني: خبر، ذو: خبر ثانٍ، يشأ: فعل الشرط، يذهبكم: جواب الشرط." },
    { "id": 134, "text": "إِنَّ مَا تُوعَدُونَ لَآتٍ ۖ وَمَا أَنتُم بِمُعْجِزِينَ", "tafsir": "ما وعدتم به من بعث وحساب واقع لا محالة، ولن تعجزوا الله بالهرب من قدره.", "irab": "ما: اسم إن، لآتٍ: اللام للمزحلقة وآتٍ خبر إن، أنتم: مبتدأ، بمُعجزين: خبر مجرور لفظاً." },
    { "id": 135, "text": "قُلْ يَا قَوْمِ اعْمَلُوا عَلَىٰ مَكَانَتِكُمْ إِنِّي عَامِلٌ ۖ فَسَوْفَ تَعْلَمُونَ", "tafsir": "تهديد للمخالفين: استمروا على طريقكم وسأستمر على ديني، وسوف ترون من له العاقبة الحسنة.", "irab": "اعملوا: فعل أمر، إني عامل: إن واسمها وخبرها، الدار: مضاف إليه، الظالمون: فاعل." },
    { "id": 136, "text": "وَجَعَلُوا لِلَّهِ مِمَّا ذَرَأَ مِنَ الْحَرْثِ وَالْأَنْعَامِ نَصِيبًا فَقَالُوا هَٰذَا لِلَّهِ بِزَعْمِهِمْ", "tafsir": "ضلال المشركين في تقسيم الزروع والأنعام بين الله وأصنامهم، فما كان للأصنام لا يصل لله وما لله يصل للأصنام.", "irab": "جعلوا: فعل وفاعل، نصيباً: مفعول به، الله: اسم مجرور، يحكمون: مضارع." },
    { "id": 137, "text": "وَكَذَٰلِكَ زَيَّنَ لِكَثِيرٍ مِّنَ الْمُشْرِكِينَ قَتْلَ أَوْلَادِهِمْ شُرَكَاؤُهُمْ", "tafsir": "تزيين الشياطين للمشركين قتل أولادهم (الوأد) لإهلاكهم وتلبيس دينهم عليهم.", "irab": "زين: فعل، قتل: مفعول به، شركاؤهم: فاعل، الله: فاعل، يفترون: مضارع." },
    { "id": 138, "text": "وَقَالُوا هَٰذِهِ أَنْعَامٌ وَحَرْثٌ حِجْرٌ لَّا يَطْعَمُهَا إِلَّا مَن نَّشَاءُ بِزَعْمِهِمْ", "tafsir": "تحريم المشركين لبعض الأنعام والزروع كذباً على الله، فسيجزيهم الله على افترائهم.", "irab": "أنعام: خبر، حجر: نعت، يطعمها: مضارع ومفعول، يفترون: مضارع." },
    { "id": 139, "text": "وَقَالُوا مَا فِي بُطُونِ هَٰذِهِ الْأَنْعَامِ خَالِصَةٌ لِّذُكُورِنَا وَمُحَرَّمٌ عَلَىٰ أَزْوَاجِنَا", "tafsir": "تحريم أجنة الأنعام على النساء وتحليلها للرجال، فسيحاسبهم الله على هذا التشريع الباطل.", "irab": "خالصة: خبر، ذكورنا: اسم مجرور، أزواجنا: اسم مجرور، حكيم: خبر، عليم: خبر ثانٍ." },
    { "id": 140, "text": "قَدْ خَسِرَ الَّذِينَ قَتَلُوا أَوْلَادَهُمْ سَفَهًا بِغَيْرِ عِلْمٍ وَحَرَّمُوا مَا رَزَقَهُمُ اللَّهُ افْتِرَاءً عَلَى اللَّهِ", "tafsir": "خسارة من قتل أولاده وحرم ما أحل الله افتراءً عليه، فقد ضلوا ضلالاً بعيداً.", "irab": "الذين: فاعل، أولادهم: مفعول به، سَفهاً: مفعول لأجله، مهتدين: خبر كانوا." },
    { "id": 141, "text": "۞ وَهُوَ الَّذِي أَنشَأَ جَنَّاتٍ مَّعْرُوشَاتٍ وَغَيْرَ مَعْرُوشَاتٍ", "tafsir": "الله هو خالق البساتين والزروع المختلفة، والأمر بالأكل منها وإيتاء حقها (الزكاة) عند الحصاد.", "irab": "أنشأ: فعل، جنات: مفعول به، حصاده: مضاف إليه، الله: فاعل، المسرفين: مفعول به." },
    { "id": 142, "text": "وَمِنَ الْأَنْعَامِ حَمُولَةً وَفَرْشًا ۚ كُلُوا مِمَّا رَزَقَكُمُ اللَّهُ وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ", "tafsir": "خلق الأنعام للنقل والفرش واللحم، والنهي عن اتباع الشيطان في تحريم ما أحل الله.", "irab": "حَمولة: معطوف، خطوات: مفعول به منصوب بالكسرة، مبين: نعت." },
    { "id": 143, "text": "ثَمَانِيَةَ أَزْوَاجٍ ۖ مِّنَ الضَّأْنِ اثْنَيْنِ وَمِنَ الْمَعْزِ اثْنَيْنِ", "tafsir": "تفصيل الأنواع الثمانية (ضأن، معز، إبل، بقر)، وتحدي المشركين بذكر دليل على تحريم أي منها.", "irab": "أزواج: مضاف إليه، اثنين: مفعول به، الذكرين: مفعول به مقدم، صادقين: خبر كنتم." },
    { "id": 144, "text": "وَمِنَ الْإِبِلِ اثْنَيْنِ وَمِنَ الْبَقَرِ اثْنَيْنِ ۗ قُلْ آلذَّكَرَيْنِ حَرَّمَ أَمِ الْأُنثَيَيْنِ", "tafsir": "تكملة التحدي بذكر الإبل والبقر، واستنكار افترائهم على الله بالتحريم دون شهادة أو علم.", "irab": "الإبل: اسم مجرور، مَن: اسم استفهام مبتدأ، الله: مفعول به، الظالمين: مفعول به." },
    { "id": 145, "text": "قُل لَّا أَجِدُ فِي مَا أُوحِيَ إِلَيَّ مُحَرَّمًا عَلَىٰ طَاعِمٍ يَطْعَمُهُ إِلَّا أَن يَكُونَ مَيْتَةً", "tafsir": "حصر المحرمات في: الميتة، الدم المسفوح، لحم الخنزير، وما ذبح لغير الله، مع عفو الله عن المضطر.", "irab": "محرماً: مفعول به، ميتة: خبر يكون، الخنزير: مضاف إليه، رحيم: خبر ثانٍ." },
    { "id": 146, "text": "وَعَلَى الَّذِينَ هَادُوا حَرَّمْنَا كُلَّ ذِي ظُفُرٍ ۖ وَمِنَ الْبَقَرِ وَالْغَنَمِ حَرَّمْنَا عَلَيْهِمْ شُحُومَهُمَا", "tafsir": "عقوبة اليهود بتحريم ذوات الظفر وشحوم البقر والغنم عليهم بسبب بغيهم.", "irab": "حرمنا: فعل وفاعل، شحومهما: مفعول به، صادقون: خبر إن." },
    { "id": 147, "text": "فَإِن كَذَّبُوكَ فَقُل رَّبُّكُمْ ذُو رَحْمَةٍ وَاسِعَةٍ وَلَا يُرَدُّ بَأْسُهُ عَنِ الْقَوْمِ الْمُجْرِمِينَ", "tafsir": "إذا كذبوك فأعلمهم برحمة الله الواسعة مع تحذيرهم من بأسه الذي لا يرد عن المجرمين.", "irab": "كذبوك: فعل وفاعل ومفعول، ربكم: مبتدأ، بأسُه: نائب فاعل، المجرمين: اسم مجرور." },
    { "id": 148, "text": "سَيَقُولُ الَّذِينَ أَشْرَكُوا لَوْ شَاءَ اللَّهُ مَا أَشْرَكْنَا وَلَا آبَاؤُنَا", "tafsir": "حجة المشركين بالقدر، ورد الله عليهم بأن المكذبين قبلهم قالوا مثلهم حتى ذاقوا العذاب.", "irab": "يقول: مضارع، الله: فاعل، آباؤنا: معطوف، بأسنا: مفعول به، يخرصون: مضارع." },
    { "id": 149, "text": "قُلْ فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ ۖ فَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ", "tafsir": "الحجة القاطعة لله وحده، ولو أراد لجبر الخلق كلهم على الهداية.", "irab": "الحجة: مبتدأ مؤخر، البالغة: نعت، شاء: فعل الشرط، أجمعين: حال منصوب بالياء." },
    { "id": 150, "text": "قُلْ هَلُمَّ شُهَدَاءَكُمُ الَّذِينَ يَشْهَدُونَ أَنَّ اللَّهَ حَرَّمَ هَٰذَا", "tafsir": "تحدي المشركين بإحضار شهود على تحريمهم، والنهي عن اتباع أهواء المكذبين بالآخرة.", "irab": "هلم: فعل أمر، شهداءكم: مفعول به، الله: اسم إن، الآخرة: اسم مجرور، يعدلون: مضارع." },
    { "id": 151, "text": "۞ قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ أَلَّا تُشْرِكُوا بِهِ شَيْئًا", "tafsir": "الوصايا العشر: النهي عن الشرك، بر الوالدين، النهي عن قتل الأولاد، وعن الفواحش وقتل النفس.", "irab": "تعالوا: فعل أمر، أتل: مضارع مجزوم، شيئاً: مفعول به، تعقلون: مضارع مرفوع." },
    { "id": 152, "text": "وَلَا تَقْرَبُوا مَالَ الْيَتِيمِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ حَتَّىٰ يَبْلُغَ أَشُدَّهُ", "tafsir": "حماية مال اليتيم، العدل في الكيل والميزان، والصدق في القول والوفاء بالعهد.", "irab": "لا: ناهية، اليتيم: مضاف إليه، الكيل: مفعول به، عهده: مفعول به، تذكرون: مضارع." },
    { "id": 153, "text": "وَأَنَّ هَٰذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ ۖ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَن سَبِيلِهِ", "tafsir": "الأمر باتباع طريق الله الواحد والنهي عن طرق الضلال والبدع التي تفرق الناس عن الحق.", "irab": "هذا: مبتدأ، صراطي: خبر، مستقيماً: حال، اتبعوه: فعل أمر، تتقون: مضارع." },
    { "id": 154, "text": "ثُمَّ آتَيْنَا مُوسَى الْكِتَابَ تَمَامًا عَلَى الَّذِي أَحْسَنَ وَتَفْصِيلًا لِّكُلِّ شَيْءٍ", "tafsir": "إيتاء موسى التوراة مكملة ومفصلة لكل أحكامهم وهدى ورحمة لعلهم يؤمنون بالبعث.", "irab": "آتينا: فعل وفاعل، موسى: مفعول به أول، الكتاب: مفعول ثانٍ، يلقون: مضارع." },
    { "id": 155, "text": "وَهَٰذَا كِتَابٌ أَنزَلْنَاهُ مُبَارَكٌ فَاتَّبِعُوهُ وَاتَّقُوا لَعَلَّكُمْ تُرْحَمُونَ", "tafsir": "القرآن كتاب مبارك؛ فاتبعوا أوامره واجتنبوا نواهيه لتنالوا رحمة الله.", "irab": "كتاب: خبر، أنزلناه: فعل وفاعل ومفعول، اتبعوه: فعل أمر، ترحمون: مضارع مبني للمجهول." },
    { "id": 156, "text": "أَن تَقُولُوا إِنَّمَا أُنزِلَ الْكِتَابُ عَلَىٰ طَائِفَةَيْنِ مِن قَبْلِنَا", "tafsir": "إنزال القرآن لئلا يحتج أهل مكة بأن الوحي نزل فقط على اليهود والنصارى وكانوا غافلين عنه.", "irاب": "تقولوا: مضارع منصوب، أنزل: مبني للمجهول، الكتاب: نائب فاعل، غافلين: خبر كنا." },
    { "id": 157, "text": "أَوْ تَقُولُوا لَوْ أَنَّا أُنزِلَ عَلَيْنَا الْكِتَابُ لَكُنَّا أَهْدَىٰ مِنْهُمْ", "tafsir": "أو يحتجوا بأنهم لو نزل عليهم كتاب لكانوا أكثر هداية، فقد جاءكم الحق فمن أظلم ممن كذب؟", "irab": "الكتاب: نائب فاعل، أهدى: خبر كنا، مَن: مفعول به، العذاب: مفعول به ثانٍ." },
    { "id": 158, "text": "هَلْ يَنظُرُونَ إِلَّا أَن تَأْتِيَهُمُ الْمَلَائِكَةُ أَوْ يَأْتِيَ رَبُّكَ أَوْ يَأْتِيَ بَعْضُ آيَاتِ رَبِّكَ", "tafsir": "انتظار الكفار لعلامات الساعة الكبرى، فإذا جاءت لم ينفع نفساً إيمانها إن لم تؤمن من قبل.", "irab": "الملائكة: فاعل، ربك: فاعل، آيات: فاعل، إيمانها: فاعل، تعملون: مضارع." },
    { "id": 159, "text": "إِنَّ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكَانُوا شِيَعًا لَّسْتَ مِنْهُمْ فِي شَيْءٍ", "tafsir": "البراءة من الذين فرقوا دينهم بالبدع والتحزب، فأمرهم إلى الله وهو سيحاسبهم.", "irab": "الذين: اسم إن، شيعاً: خبر كانوا، شيء: اسم مجرور، يفعلون: مضارع." },
    { "id": 160, "text": "مَن جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا ۖ وَمَن جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَىٰ إِلَّا مِثْلَهَا", "tafsir": "كرم الله بمضاعفة أجر الحسنة لعشرة أضعاف، وعدله بمجازاة السيئة بمثلها دون ظلم.", "irab": "مَن: مبتدأ، الحسنة: اسم مجرور، عشر: مبتدأ مؤخر، يجزى: مضارع مبني للمجهول." },
    { "id": 161, "text": "قُلْ إِنَّنِي هَدَانِي رَبِّي إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ دِينًا قِيَمًا", "tafsir": "إعلان النبي ﷺ هداية ربه له للدين القويم ملة إبراهيم حنيفاً والموحد لله.", "irab": "هداني: فعل ومفعول، ربي: فاعل، مستقيم: نعت، ديناً: حال، حنيفاً: حال." },
    { "id": 162, "text": "قُلْ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ", "tafsir": "إخلاص كل العبادات والحياة والموت لله وحده رب العالمين.", "irab": "صلاتي: اسم إن، لله: خبر إن، رب: نعت، العالمين: مضاف إليه." },
    { "id": 163, "text": "لَا شَرِيكَ لَهُ ۖ وَبِذَٰلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ", "tafsir": "نفي الشريك عن الله، والتزام بأمر التوحيد وأن النبي ﷺ هو أول المستسلمين لأمر ربه.", "irab": "شريك: اسم لا، أُمِرْتُ: مبني للمجهول والتاء نائب فاعل، أنا: مبتدأ، أول: خبر." },
    { "id": 164, "text": "قُلْ أَغَيْرَ اللَّهِ أَبْتَغِي رَبًّا وَهُوَ رَبُّ كُلِّ شَيْءٍ", "tafsir": "استنكار طلب رب غير الله، وكل نفس مسؤولة عن فعلها، ولا تزر وازرة وزر أخرى، والمرجع لله.", "irab": "غير: مفعول به مقدم، الله: مضاف إليه، رب: مضاف إليه، وازرة: فاعل، تختلفون: مضارع." },
    { "id": 165, "text": "وَهُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ الْأَرْضِ وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ", "tafsir": "الله جعلكم خلفاء في الأرض وفاوت بينكم في الأرزاق والدرجات ليبتليكم، وهو غفور رحيم.", "irab": "جعلكم: فعل ومفعولان، الأرض: مضاف إليه، درجات: حال، العقاب: مضاف إليه." }
] },
    { "id": 7, "name": "الأعراف", "verses": [] },
    { "id": 8, "name": "الأنفال", "verses": [] },
    { "id": 9, "name": "التوبة", "verses": [] },
    { "id": 10, "name": "يونس", "verses": [] },
    { "id": 11, "name": "هود", "verses": [] },
    { "id": 12, "name": "يوسف", "verses": [] },
    { "id": 13, "name": "الرعد", "verses": [] },
    { "id": 14, "name": "إبراهيم", "verses": [] },
    { "id": 15, "name": "الحجر", "verses": [] },
    { "id": 16, "name": "النحل", "verses": [] },
    { "id": 17, "name": "الإسراء", "verses": [] },
    { "id": 18, "name": "الكهف", "verses": [] },
    { "id": 19, "name": "مريم", "verses": [] },
    { "id": 20, "name": "طه", "verses": [] },
    { "id": 21, "name": "الأنبياء", "verses": [] },
    { "id": 22, "name": "الحج", "verses": [] },
    { "id": 23, "name": "المؤمنون", "verses": [] },
    { "id": 24, "name": "النور", "verses": [] },
    { "id": 25, "name": "الفرقان", "verses": [] },
    { "id": 26, "name": "الشعراء", "verses": [] },
    { "id": 27, "name": "النمل", "verses": [] },
    { "id": 28, "name": "القصص", "verses": [] },
    { "id": 29, "name": "العنكبوت", "verses": [] },
    { "id": 30, "name": "الروم", "verses": [] },
    { "id": 31, "name": "لقمان", "verses": [] },
    { "id": 32, "name": "السجدة", "verses": [] },
    { "id": 33, "name": "الأحزاب", "verses": [] },
    { "id": 34, "name": "سبأ", "verses": [] },
    { "id": 35, "name": "فاطر", "verses": [] },
    { "id": 36, "name": "يس", "verses": [] },
    { "id": 37, "name": "الصافات", "verses": [] },
    { "id": 38, "name": "ص", "verses": [] },
    { "id": 39, "name": "الزمر", "verses": [] },
    { "id": 40, "name": "غافر", "verses": [] },
    { "id": 41, "name": "فصلت", "verses": [] },
    { "id": 42, "name": "الشورى", "verses": [] },
    { "id": 43, "name": "الزخرف", "verses": [] },
    { "id": 44, "name": "الدخان", "verses": [] },
    { "id": 45, "name": "الجاثية", "verses": [] },
    { "id": 46, "name": "الأحقاف", "verses": [] },
    { "id": 47, "name": "محمد", "verses": [] },
    { "id": 48, "name": "الفتح", "verses": [] },
    { "id": 49, "name": "الحجرات", "verses": [] },
    { "id": 50, "name": "ق", "verses": [] },
    { "id": 51, "name": "الذاريات", "verses": [] },
    { "id": 52, "name": "الطور", "verses": [] },
    { "id": 53, "name": "النجم", "verses": [] },
    { "id": 54, "name": "القمر", "verses": [] },
    { "id": 55, "name": "الرحمن", "verses": [] },
    { "id": 56, "name": "الواقعة", "verses": [] },
    { "id": 57, "name": "الحديد", "verses": [] },
    { "id": 58, "name": "المجادلة", "verses": [] },
    { "id": 59, "name": "الحشر", "verses": [] },
    { "id": 60, "name": "الممتحنة", "verses": [] },
    { "id": 61, "name": "الصف", "verses": [] },
    { "id": 62, "name": "الجمعة", "verses": [] },
    { "id": 63, "name": "المنافقون", "verses": [] },
    { "id": 64, "name": "التغابن", "verses": [] },
    { "id": 65, "name": "الطلاق", "verses": [] },
    { "id": 66, "name": "التحريم", "verses": [] },
    { "id": 67, "name": "الملك", "verses": [] },
    { "id": 68, "name": "القلم", "verses": [] },
    { "id": 69, "name": "الحاقة", "verses": [] },
    { "id": 70, "name": "المعارج", "verses": [] },
    { "id": 71, "name": "نوح", "verses": [] },
    { "id": 72, "name": "الجن", "verses": [] },
    { "id": 73, "name": "المزمل", "verses": [] },
    { "id": 74, "name": "المدثر", "verses": [] },
    { "id": 75, "name": "القيامة", "verses": [] },
    { "id": 76, "name": "الإنسان", "verses": [] },
    { "id": 77, "name": "المرسلات", "verses": [] },
    { "id": 78, "name": "النبأ", "verses": [] },
    { "id": 79, "name": "النازعات", "verses": [] },
    { "id": 80, "name": "عبس", "verses": [] },
    { "id": 81, "name": "التكوير", "verses": [] },
    { "id": 82, "name": "الانفطار", "verses": [] },
    { "id": 83, "name": "المطففين", "verses": [] },
    { "id": 84, "name": "الانشقاق", "verses": [] },
    { "id": 85, "name": "البروج", "verses": [] },
    { "id": 86, "name": "الطارق", "verses": [] },
    { "id": 87, "name": "الأعلى", "verses": [] },
    { "id": 88, "name": "الغاشية", "verses": [] },
    { "id": 89, "name": "الفجر", "verses": [] },
    { "id": 90, "name": "البلد", "verses": [] },
    { "id": 91, "name": "الشمس", "verses": [] },
    { "id": 92, "name": "الليل", "verses": [] },
    { "id": 93, "name": "الضحى", "verses": [] },
    { "id": 94, "name": "الشرح", "verses": [] },
    { "id": 95, "name": "التين", "verses": [] },
    { "id": 96, "name": "العلق", "verses": [] },
    { "id": 97, "name": "القدر", "verses": [] },
    { "id": 98, "name": "البينة", "verses": [] },
    { "id": 99, "name": "الزلزلة", "verses": [] },
    { "id": 100, "name": "العاديات", "verses": [] },
    { "id": 101, "name": "القارعة", "verses": [] },
    { "id": 102, "name": "التكاثر", "verses": [] },
    { "id": 103, "name": "العصر", "verses": [] },
    { "id": 104, "name": "الهمزة", "verses": [] },
    { "id": 105, "name": "الفيل", "verses": [] },
    { "id": 106, "name": "قريش", "verses": [] },
    { "id": 107, "name": "الماعون", "verses": [] },
    { "id": 108, "name": "الكوثر", "verses": [] },
    { "id": 109, "name": "الكافرون", "verses": [] },
    { "id": 110, "name": "النصر", "verses": [] },
    { "id": 111, "name": "المسد", "verses": [] },
    { "id": 112, "name": "الإخلاص", "verses": [] },
    { "id": 113, "name": "الفلق", "verses": [] },
    { "id": 114, "name": "الناس", "verses": [] }
  ]
}
